[{"by": "JohnBooty", "id": 30184504, "parent": 30182176, "text": "What a poor attempt at reductio ad absurdum. If you put half the effort into <i>understanding</i> this as you&#x27;re currently spending on <i>fighting very hard to not understand</i> it, you&#x27;d have more free time in your day and learn something to boot.<p>There are quite a few native americans who find it wack when people, especially those belonging to the culture that took their land and more or less genocided them, co-opt their cultural symbols.<p>There are also a lot of native americans who don&#x27;t care, probably some who think it&#x27;s neato and a lot of native americans for whom the entire issue gets a big old &quot;not applicable&quot; because it&#x27;s a big continent and &quot;native american&quot; is not a monolithic culture and not all of them give a shit about dream catchers.<p>Ultimately, it&#x27;s up to you. You can decide to give a shit about the N% of native americans who feel it&#x27;s wack for white people to make dream catchers, or you can decide they&#x27;re a bunch of whiny crybabies who aren&#x27;t qualified to make decisions about their own culture, and open a big ol&#x27; dream catcher factory within spitting distance of your nearest reservation. A lot of people will think you&#x27;re a dick, and probably a lot of people will think you&#x27;re a totally cool dude who just owned the libs.", "time": 1643838397, "type": "comment"}, {"by": "malepoon", "id": 30184505, "parent": 30184185, "text": "To be honest I only notice that with movies. Books are fine, TV show episodes are usually fine, but long movies I can have a hard time concentrating on. Maybe because I can easily change my reading speed to keep my mind occupied.", "time": 1643838407, "type": "comment"}, {"by": "jjav", "id": 30184506, "parent": 30179429, "text": "&gt; Should this be legal?<p>It should not be legal, to do testing on public streets with unwilling participants.<p>Tesla should be required to be able to enable this only in closed areas where access is limited to those participating in the testing.", "time": 1643838407, "type": "comment"}, {"by": "Jtsummers", "id": 30184507, "parent": 30184307, "text": "I&#x27;m not sure if that&#x27;s supposed to be a counterargument or not. I mean, MIT taught SICP for over 20 years with Scheme before dropping it. So it may be true that a majority of MIT trained programmers learned a Lisp in college. But that&#x27;s not the typical experience across universities, and I doubt it ever was the case that the majority of universities taught the majority of their CS students with a mandatory Lisp course (that is, a course beyond the survey-style course I mentioned before, which seems to be <i>far</i> more common course).<p>Even top universities didn&#x27;t require it. Georgia Tech, one of the top technical universities in the US, did something like a 2-year stint with a mandatory SICP course before dropping it in favor of Python (IIRC), and had no mandatory Lisp course besides that (though they did have a mandatory Smalltalk course at the time).", "time": 1643838414, "type": "comment"}, {"by": "jacquesm", "id": 30184508, "parent": 30184384, "text": "Very large textured voxels!", "time": 1643838417, "type": "comment"}, {"deleted": true, "id": 30184509, "parent": 30183732, "time": 1643838427, "type": "comment"}, {"by": "rrrodia", "id": 30184510, "parent": 30162767, "text": "Despite the &#x27;growth&#x27; of the web and its related professions, I feel like a lot of it has neither good UX or interesting design. I&#x27;ve been out of front end for years now, but don&#x27;t feel inspired to put it mildly.. my plan is to separate these interest:<p>* build interesting graphical web styles &#x2F; experiments, pushing the envelope<p>* build a living UX guide founded in research (like an up to date wiki);", "time": 1643838427, "type": "comment"}, {"by": "sandworm101", "id": 30184511, "parent": 30184422, "text": "Have you been to LA, SF, Vancouver or Denver?  These are Teslas, not Ferraris.  Lots of teenagers are driving their parent&#x27;s tesla.  Go look at any university parking lot and you will find plenty of 50,000$ cars.", "time": 1643838427, "type": "comment"}, {"by": "iNic", "descendants": 0, "id": 30184512, "score": 2, "time": 1643838429, "title": "Code Smell: Concrete Abstraction", "type": "story", "url": "https://matklad.github.io//2020/08/15/concrete-abstraction.html"}, {"by": "ricardobeat", "id": 30184513, "parent": 30178570, "text": "600% from where it sat before the craze, which was the market price for a failing company. The company has seen revenue decline by 40%, lost roughly half a billion dollars in both 2019 and 2020, their EBITDA is negative, cash flow is negative, their margins are negative and falling. Their only plan to turnaround the ship so far seems to be entering the NFT market...<p>&gt; subjectively high chance of having a real stock squeeze<p>Ha, that explains a lot. The only way to believe the stock will go up, is the fairy-tale short squeeze. The current valuation is extremely generous based on reality.", "time": 1643838430, "type": "comment"}, {"by": "detaro", "id": 30184514, "parent": 30184500, "text": "because FAANG is originally a stock market term for (at the time) hot tech stocks, and Microsoft was already old and boring.", "time": 1643838446, "type": "comment"}, {"by": "solarmist", "id": 30184515, "parent": 30182617, "text": "Really?<p>Maybe that&#x27;s true in general because the spread in skill for being able to make a living as a lawyer and the same as a programmer depends far less on that attention to detail being a core skill. Still, I wonder if that also holds at the high levels of the profession. I get the impression that at the FAANG-level, lawyers would compare pretty favorably to programmers in detail orientation. In particular, patent and contract law.<p>That said, it&#x27;s just my general impression of what lawyers get up to.<p>...Hmm, thinking about the contract law thing a bit more. Yeah, I do believe you are right. Lawyers aren&#x27;t writing nearly as many extremely detail-oriented texts as programmers are on a day-to-day basis. Their jobs are much more around finding, reading, and understanding those things and building stories around them.", "time": 1643838460, "type": "comment"}, {"by": "nathias", "id": 30184516, "parent": 30184217, "text": "Yea, I was thinking more in terms of what would be good for society, regardless of current implementation. It would really help fight corruption if each state&#x2F;business interaction can be tracked along with all supply chains.", "time": 1643838460, "type": "comment"}, {"by": "bm-rf", "id": 30184517, "parent": 30180674, "text": "You could use Microsoft&#x27;s DeepSpeed to run the model for inference on multiple GPUS, see <a href=\"https:&#x2F;&#x2F;www.deepspeed.ai&#x2F;tutorials&#x2F;inference-tutorial&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.deepspeed.ai&#x2F;tutorials&#x2F;inference-tutorial&#x2F;</a>", "time": 1643838465, "type": "comment"}, {"by": "standardUser", "id": 30184518, "parent": 30184206, "text": "Fans should also check out the Brave New World mod for the game (excellent changes to combat and gameplay, plus tons of minor tweaks and improvements) and the T edition (massive Japanese expansion that was recently release in English).", "time": 1643838469, "type": "comment"}, {"by": "withinboredom", "id": 30184519, "parent": 30171501, "text": "Tinfoil hat: the number of US GPS satellites in operation has been going down, both in % of total satellites and in actual numbers over the years. I’d venture “US being able to rely on GPS” is probably not a great thing.<p>That being said, wanting more user data is probably the right answer.", "time": 1643838471, "type": "comment"}, {"by": "chrisofspades", "descendants": 0, "id": 30184520, "score": 2, "time": 1643838473, "title": "NPM enrolls Top package maintainers into mandatory 2FA", "type": "story", "url": "https://therecord.media/npm-enrolls-top-100-package-maintainers-into-mandatory-2fa/"}, {"by": "awinter-py", "id": 30184521, "parent": 30181291, "text": "settings are also a great resolution to behind-the-scenes design conversations<p>in particular the classic &#x27;PM wants to incentivize a flow, developer thinks it will be annoying as shit and threatens to throw phone out the window&#x27;<p>&#x27;let&#x27;s make this a setting to see if people turn it off&#x27; is my favorite compromise for these. (Also simplifies phase two of a gradual rollout, because jealous early adopters can turn the beta setting on manually)", "time": 1643838478, "type": "comment"}, {"by": "rootsudo", "id": 30184522, "parent": 30184149, "text": "The more longer you pretend, the more rights she has to your future income and alimony.<p>But What&#x27;s the problem? You don&#x27;t want kids, and she said she isn&#x27;t sure.<p>The more longer you stay together and let her complete her studies, her biological clock ticks and women do have issues having kids later in life.<p>You just don&#x27;t like being married? Not being together?<p>More for reddit, but, just curious in general.", "time": 1643838482, "type": "comment"}, {"by": "sne11ius", "descendants": 0, "id": 30184523, "score": 1, "text": "Hi HN.\nI did a small thing. If you&#x27;re bound to use host code on bitbucket (and&#x2F;or use Jenkins), you&#x27;re probably just a corporate dev like me ;)<p>I hope this tool can make your life a little easier. I use it mainly to clone repositories I only vaguely know the name of.<p>Any comments welcome.", "time": 1643838492, "title": "Show HN: Furbnicator, a tool to ease burdens for the common corporate programmer", "type": "story", "url": "https://github.com/sne11ius/furbnicator"}, {"deleted": true, "id": 30184524, "parent": 30184394, "time": 1643838495, "type": "comment"}, {"by": "bmhin", "id": 30184525, "parent": 30184385, "text": "Yeah, we need our TicketFixer to also include the No_Bob 0.2 plugin that figures out that a decent percentage of the time whatever &quot;Bob&quot; is asking for in that meeting is not what &quot;Bob&quot; thinks he is asking for or should be asking for and can squash those tickets.  Without that we&#x27;re gonna somehow end up with spreadsheets in everything.", "time": 1643838498, "type": "comment"}, {"by": "burnished", "id": 30184526, "parent": 30183895, "text": "This isn&#x27;t turning the problem around in the same sense. In order to effectively turn a problem around you need to use its complement, and then it should be a binary proposition. Your example where you suppose an idealogical attack fails here because it is not the only other explanation, you haven&#x27;t turned the problem around in the same way that turning &quot;what is the probability this action had an effect&quot; around can become &quot;what is the probability that this action had no effect&quot;.", "time": 1643838507, "type": "comment"}, {"by": "roelschroeven", "id": 30184527, "parent": 30180596, "text": "Jordan, not UAE. Both Lawrence of Arabia and Dune 2021 were (largely) shot in the Wadi Rum in Jordan (and likewise desert scenes in many other movies).", "time": 1643838516, "type": "comment"}, {"by": "Someone1234", "id": 30184528, "parent": 30184149, "text": "&gt; Main problem is that she still depends on me financially. Am I a bad person if I keep pretending for a couple of years until she finishes her studies, gets a good job and then break up? (she is also a software dev, she is already working but earns a pretty low salary)<p>Those aren&#x27;t the only two options. You could both agree to support her financially AND move on.<p>I would suggest you should be having these conversations with her, even if just to give her a heads up that you&#x27;re feeling this way so when you decide to make a change it isn&#x27;t completely out of the blue.<p>&gt; One strategy I used was to tell her that I don&#x27;t want to have kids, and I told her it was ok if she left me.<p>This isn&#x27;t a &quot;strategy.&quot; This is just not dealing with the problem and trying to push her into doing it for you.<p>You two need counseling, even if only as a nicer way to let her know you&#x27;re one foot out the door already. If you want to support her after your married dissolves then try to do arbitration and offer that.", "time": 1643838516, "type": "comment"}, {"by": "ketzo", "id": 30184529, "parent": 30184032, "text": "Wow. Excellent analogy.", "time": 1643838523, "type": "comment"}, {"by": "Zababa", "id": 30184530, "parent": 30181349, "text": "If some people are confused (I was for a long time):<p>- OCaml is a functional, object-oriented and statically typed programming language that compiles to binaries and bytecode. It&#x27;s a ML (Meta Language) descendant, like SML for example<p>- js_of_ocaml is a compiler that takes in OCaml bytecode and outputs JavaScript<p>- BuckleScript is a compiler that takes OCaml code and outputs JavaScript<p>- ReasonML is an alternative syntax for OCaml. ReasonML code can be compiled to binaries like regular OCaml code.<p>- BuckleScript and ReasonML were used together often<p>- ReScript is a new language that&#x27;s based on the OCaml compiler, BuckleScript, and ReasonML syntax. ReScript targets only JavaScript and has a<p>A post on the history of ReScript&#x2F;BuckleScript in the OCaml forum: <a href=\"https:&#x2F;&#x2F;discuss.ocaml.org&#x2F;t&#x2F;a-short-history-of-rescript-bucklescript&#x2F;7222\" rel=\"nofollow\">https:&#x2F;&#x2F;discuss.ocaml.org&#x2F;t&#x2F;a-short-history-of-rescript-buck...</a>", "time": 1643838524, "type": "comment"}, {"by": "spiffytech", "id": 30184531, "parent": 30183932, "text": "A better option would be using the HTML meta tag to perform the redirect, since HN has a bunch of JS-avoidant users:<p><pre><code>  &lt;meta http-equiv=&quot;refresh&quot; content=&quot;0;url=https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=30180253&quot; &#x2F;&gt;</code></pre>", "time": 1643838527, "type": "comment"}, {"by": "donsupreme", "id": 30184532, "parent": 30184454, "text": "Wormhole mainly focused on bridging in&#x2F;out of Solana.  Solana isn&#x27;t having a good year to say the least.", "time": 1643838528, "type": "comment"}, {"by": "overgard", "id": 30184533, "parent": 30183113, "text": "I&#x27;m not sure that&#x27;s true. I usually am far more frustrated when something in an OS isn&#x27;t customizable. One reason I prefer Linux and Windows over macOS is because macOS tends to be much more rigid in what I can customize.", "time": 1643838528, "type": "comment"}, {"by": "YeGoblynQueenne", "id": 30184534, "parent": 30183925, "text": "Program synthesis from natural language specifications has existed for many\nyears, also. I&#x27;m not particularly interested in the task, but here&#x27;s a paper I\nfound from 2017, with a quick search:<p><a href=\"https:&#x2F;&#x2F;www.semanticscholar.org&#x2F;paper&#x2F;Program-Synthesis-from-Natural-Language-Using-Lin&#x2F;8ec6abfdc5009b4e490e975991c871dfeec05434\" rel=\"nofollow\">https:&#x2F;&#x2F;www.semanticscholar.org&#x2F;paper&#x2F;Program-Synthesis-from...</a><p>AlphaCode is not particularly good at it, either. In the arxiv preprint, besides\nthe subjetive and pretty meaningless &quot;evaluation&quot; against human coders it&#x27;s also\ntested on a formal prorgam synthesis benchmark, the APPS dataset. The best\nperforming variant reported in the arxiv preprint solves 25% of the\n&quot;introductory&quot; tasks (the least challenging ones). All AlphaCode variants tested\nsolve less than 10% on the &quot;interview&quot; and &quot;competition&quot; (intermediary and\nadvanced) tasks. These more objective results are not reported in the article\nabove, I think for obvious reasons (because they are extremely poor).<p>So it&#x27;s not doing anything radically new and it&#x27;s not doing it particularlly\nwell either. Please be better informed before propagating hype.", "time": 1643838541, "type": "comment"}, {"by": "Scarblac", "id": 30184535, "parent": 30181932, "text": "In the Netherlands, in my case. Party lists, yes. Most European countries have that as far as I know, I thought the UK was an outlier.", "time": 1643838542, "type": "comment"}, {"by": "aantix", "id": 30184536, "parent": 30183686, "text": "Interesting take..<p>What do you think is the solution - when an enterprise already has Jira, Github and Confluence, how do you think a product like Grafana Incident should integrate with these somewhat overlapping products?", "time": 1643838546, "type": "comment"}, {"by": "facundo_olano", "id": 30184537, "parent": 30184330, "text": "Thanks for the suggestion, and for your book and your blog posts, by the way, they are the main reason we thought about tackling this project!", "time": 1643838548, "type": "comment"}, {"by": "DavideNL", "id": 30184538, "parent": 30183236, "text": "I once read (somewhere...) that the position of text on the page is also an important factor; when scrolling the position of &quot;the location on the page where you read something&quot; changes constantly, versus paper where the info always stays in the same location.\nApparently, this helps our brain to remember things, better.<p>So, if you read on an electronic device, it&#x27;s probably beneficial to configure it to not use &quot;continuous scrolling&quot; but rather use something &quot;fixed&quot;.", "time": 1643838550, "type": "comment"}, {"by": "jahewson", "id": 30184539, "parent": 30183675, "text": "More style than substance but the blazon disregard for IP is clear:<p><a href=\"https:&#x2F;&#x2F;www.agriland.ie&#x2F;farming-news&#x2F;fancy-a-chinese-interpretation-of-a-john-deere&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.agriland.ie&#x2F;farming-news&#x2F;fancy-a-chinese-interpr...</a>", "time": 1643838550, "type": "comment"}, {"by": "sanedigital", "id": 30184540, "parent": 30178142, "text": "[Citation needed] on the part where you said being smart makes you less likely to believe in bullshit. I know plenty of smart people who aren’t independent thinkers at all.", "time": 1643838553, "type": "comment"}, {"by": "capableweb", "id": 30184541, "parent": 30183958, "text": "In my person experience, the &quot;drunk drivers&quot;, &quot;road ragers&quot;, &quot;habitual speeders&quot; groups seems to be over-represented in expensive cars rather than cheaper cars. Poor people cannot afford to crash their car while rich people can.", "time": 1643838555, "type": "comment"}, {"by": "henryw", "id": 30184542, "parent": 30182146, "text": "Can this be made into bulletproof clothing that looks like normal clothes? That would be cool", "time": 1643838559, "type": "comment"}, {"by": "donsupreme", "id": 30184543, "parent": 30184498, "text": "Dare I say  ... money?", "time": 1643838566, "type": "comment"}, {"deleted": true, "id": 30184544, "parent": 30178594, "time": 1643838566, "type": "comment"}, {"by": "mrtksn", "id": 30184545, "parent": 30184453, "text": "How it&#x27;s other car companies fault that Tesla isn&#x27;t publishing data so we can check if Autopilot miles are mostly on straight lines and human miles are at tricky situations?", "time": 1643838567, "type": "comment"}, {"by": "dmitriid", "id": 30184546, "parent": 30184361, "text": "&gt; Autopilot is a tool. You can miss use it, sure. But if you care about safety it&#x27;s hard to match with what they offer.<p>1. It&#x27;s not autopilot, by any measurable criteria<p>2. As the adjusted data clearl shows, it&#x27;s not that hard to match it. And since you mention Volvo, they definitely match it. They are honest enough though not to call it &quot;autopilot&quot;, or &quot;full safe driving&quot; or pin the plame for its failures on the driver.", "time": 1643838569, "type": "comment"}, {"by": "riantogo", "id": 30184547, "parent": 30182181, "text": "How much of an impact would you say it has on the index? If it were normalized for “citizens only” do you really think US will fare much better?<p>If your larger point is about treatment of immigrants, how do you feel about US taxing its immigrants as citizens after 1 yr of stay, but putting them on a line to actual citizenship that could be more than multiple lifetimes long? Didn’t we fight a war about “taxation without representation”? I’m not even talking about literally tearing apart poor immigrant families while all along extracting taxes from them.", "time": 1643838584, "type": "comment"}, {"by": "petermcneeley", "id": 30184548, "parent": 30182146, "text": "Joules per Kg or gtfo.", "time": 1643838599, "type": "comment"}, {"by": "nerdjon", "id": 30184549, "parent": 30183693, "text": "I think at the time I set it up that feature may not exist?<p>It isn&#x27;t really anything sensitive, really more just when I am interviewing and related activities.<p>But I also want it to be a separate email instead of just an alias which I assume iClouds is. Could be wrong though.<p>Amazon&#x27;s is just $5 a month so not really a huge drive to change it.", "time": 1643838605, "type": "comment"}, {"by": "samueljbrewer", "dead": true, "id": 30184550, "score": 1, "time": 1643838608, "type": "story"}, {"by": "frickinLasers", "id": 30184551, "parent": 30183959, "text": "Ugh. As a not-really-power user I can&#x27;t stand Gnome 3, not least because I have to Google how to and then install a tool just to make useful settings accessible. Everything in Tweaks should be in the default settings panel.", "time": 1643838616, "type": "comment"}, {"by": "solarmist", "id": 30184552, "parent": 30181663, "text": "There isn&#x27;t? I feel like there&#x27;s still a ton of places software hasn&#x27;t even touched and not because it doesn&#x27;t make sense, but because no one&#x27;s gotten to it. It&#x27;s not the most profitable thing people could write software for.", "time": 1643838618, "type": "comment"}, {"by": "Ericson2314", "id": 30184553, "parent": 30178814, "text": "If the compiler is so omnicient, then you should just be able to take the pointer to the field in the unsafe struct too!<p>Surely such a genius compiler can see &quot;oh, they took a field reference, better make sure that field is aligned&quot; whether the reference is a safe one or not!", "time": 1643838620, "type": "comment"}, {"by": "statico", "id": 30184554, "parent": 30184456, "text": "As of right now, I have almost zero information about who is using it. It&#x27;s currently running on Vercel as a hobby project, and I&#x27;ve already used my single free analytics add-on for another project.<p>(Will I run out of free Vercel function execution credits or whatever? Probably. We&#x27;ll see, I guess.)", "time": 1643838622, "type": "comment"}, {"by": "tagoregrtst", "id": 30184555, "parent": 30180839, "text": "I hate title.<p>Do they mean run of the mill plastic?<p>What does stronger than steel mean? Tensile strength? Yield strength? Toughness?<p>And “stronger” than steel is not that impressive in of itself. Many materials are stringer than steel. Steel’s combination of properties makes it useful, not merely its tensile strength.", "time": 1643838622, "type": "comment"}, {"by": "megous", "id": 30184556, "parent": 30137504, "text": "Well, if you set max-width: something for example. You need to set other dimension as auto in CSS. So that would be height: auto.", "time": 1643838627, "type": "comment"}, {"by": "pjmlp", "id": 30184557, "parent": 30184062, "text": "It fits on having a <i>var : type</i> syntax, naturally it isn&#x27;t Turbo Pascal 6.0 with the Turbo Vision IDE, given 1992.", "time": 1643838630, "type": "comment"}, {"by": "FireBeyond", "id": 30184558, "parent": 30183058, "text": "Huh. Citation needed that drivers who buy, say, a Model S, particularly one with Ludicrous mode are less likely to be &quot;habitual speeders&quot; than the average driver.<p>This has come up before. When the new FSD beta started, people started claiming that safe driving was a function of vehicle price, and therefore Tesla drivers, especially those who had paid for FSD, were more likely to be safer. When I noted that my current vehicle costs more than a Model S, based on the logic, Tesla should be recruiting me to beta test FSD, well it was hard to find a refutation.", "time": 1643838635, "type": "comment"}, {"by": "tshaddox", "id": 30184559, "parent": 30181418, "text": "This is cherry-picking. There are countless characters from comic books who are so powerful that they would be considered laughable in modern superhero movies the same way you seem to think a few cherry-picked modern superhero movie characters are laughably overpowered compared to a few cherry-picked characters from older superhero movies.", "time": 1643838644, "type": "comment"}][{"by": "chermanowicz", "id": 30196957, "parent": 30194699, "text": "What was your choice of manufactured home?  Did you have a couple options you were struggling between or was it an obvious decision?", "time": 1643914682, "type": "comment"}, {"by": "lokalfarm", "id": 30196958, "parent": 30195036, "text": "Your comment brought to mind this story written by the late, great John Perry Barlow: <a href=\"https:&#x2F;&#x2F;www.eff.org&#x2F;pages&#x2F;crime-and-puzzlement\" rel=\"nofollow\">https:&#x2F;&#x2F;www.eff.org&#x2F;pages&#x2F;crime-and-puzzlement</a><p>My impression is that the young generations are growing up in an environment where the lines between their &quot;digital life&quot; and &quot;real life&quot; are almost completely blurred. Whether it is socializing with their peers, dating, going to school, or getting a job - so much of &quot;being online&quot; nowadays involves people being groomed as both the consumer and the product. It did not feel that way to me in the 90&#x27;s and early 2000&#x27;s, although that might not quite fit the definition of &quot;older folks.&quot;", "time": 1643914685, "type": "comment"}, {"by": "Iwan-Zotow", "id": 30196959, "parent": 30187408, "text": "and abc saga is still ongoing...", "time": 1643914689, "type": "comment"}, {"by": "AlexCoventry", "id": 30196960, "parent": 30196657, "text": "<a href=\"http:&#x2F;&#x2F;www.paulgraham.com&#x2F;submarine.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.paulgraham.com&#x2F;submarine.html</a>", "time": 1643914690, "type": "comment"}, {"by": "johncena33", "descendants": 0, "id": 30196961, "score": 1, "time": 1643914691, "title": "Find out the environmental impact of your Google searches", "type": "story", "url": "https://qz.com/1267709/every-google-search-results-in-co2-emissions-this-real-time-dataviz-shows-how-much/"}, {"by": "jacquesm", "id": 30196962, "parent": 30196634, "text": "The trick is to match the rpms as the engine drops naturally you just slot it in gear at the right moment. If you do it often enough at some point you don&#x27;t even notice anymore until you try to drive another vehicle, at which point hilarity will ensue.<p>Those old beetles were just four speeds, pretty beefy gears. I never managed a good downshift though, I would cheat and very briefly depress the clutch so it wouldn&#x27;t slip. Do it too long and you&#x27;d get that horribly expensive smell. I was dirt poor and got the car for free so I really couldn&#x27;t complain. Baby blue. And it taught me to be very careful on wet surfaces with a rear mounted engine (took out a bicycle stand with it in front of one of the busiest coffee places in Amsterdam West, &quot;Tramlijn Begeerte&quot; (dutch translation of a &#x27;streetcar called desire&#x27;). Funny little car.", "time": 1643914695, "type": "comment"}, {"by": "alangibson", "id": 30196963, "parent": 30196721, "text": "It&#x27;s well earned negativity. If you look at the &quot;success&quot; we&#x27;ve had with COVID-19 and climate change so far, there&#x27;s little reason to believe we&#x27;re up to the challenges that are here&#x2F;coming. Yes, there is plenty that we <i>could</i> do, but very little that we <i>will</i> do. All that&#x27;s left is to brace for impact.", "time": 1643914696, "type": "comment"}, {"by": "OkayPhysicist", "id": 30196964, "parent": 30194040, "text": "No. A felony is just a classification of serious crime. It has nothing to do with whether it has federal or state jurisdiction.<p>In theory it has to do with if the prison sentence can last more than a year.", "time": 1643914699, "type": "comment"}, {"by": "micromacrofoot", "id": 30196965, "kids": [30197010], "parent": 30196750, "text": "Tile <i>still</i> isn&#x27;t getting harped for stalking. I used a Tile to track down a backpack thief 5 years ago, could have easily been a person I was stalking.<p>Apple&#x27;s getting a lot of flack because they&#x27;re enormous, consumers are more aware, and they have a better network... but the fact that they did <i>any</i> stalker alerting is beyond anything the existing products in the market have done. I&#x27;d guess the product designers at Apple are probably constantly frustrated with this reality.", "time": 1643914700, "type": "comment"}, {"by": "benreesman", "id": 30196966, "parent": 30191917, "text": "I’m pretty sure that all my SV bridges were burned a long time ago. Antonio was very kind to me in the book but “god of the drunken brogrammers” doesn’t have the same ring to it that it did when Chaos Monkeys got all those awards.<p>The only character reference I can hope for, or frankly would want, is that I’m pretty good at my job in spite of my personal issues.<p>I wasn’t trying to spin up a big contentious thread, I was trying to inject some first hand knowledge of how this stuff works so that people can make informed judgements about it.<p>If having worked at FB half a decade ago and thinking Boz is a pretty stand up guy in person makes me a pariah?<p>Then I guess it’s a beautiful day for an auto de fay.", "time": 1643914701, "type": "comment"}, {"by": "kccqzy", "id": 30196967, "parent": 30196923, "text": "That&#x27;s quite possible, judging by the huge bonuses a few friends working there got as a SWE.", "time": 1643914703, "type": "comment"}, {"by": "vorpalhex", "id": 30196968, "parent": 30196351, "text": "Epic had moderate success, as does f-droid.", "time": 1643914705, "type": "comment"}, {"by": "e40", "id": 30196969, "parent": 30195956, "text": "&gt; I&#x27;d much rather have the shorter and safer trucks around than the current US designs.<p>My grandmother&#x27;s best friend, when I was a child, was killed by a truck running over her while she was in a crosswalk (legally crossing the street).  The light turned green while she was in front of the truck and he ran her over.  They are so tall and set back so far, many of them can&#x27;t see a person walking right in front of it.", "time": 1643914706, "type": "comment"}, {"by": "Teknoman117", "id": 30196970, "parent": 30196594, "text": "As far as big SUVs go, I drive an &#x27;04 Ford Expedition (parents gave it to me years ago when they no longer needed a child transporter and it&#x27;s stupid easy to keep running).<p>If I drive 55 mph, I get 20 mpg on the highway. If I &quot;drive with the traffic&quot; in CA, I can get as low as 14 mpg.", "time": 1643914706, "type": "comment"}, {"by": "_Microft", "id": 30196971, "kids": [30196996], "parent": 30194666, "text": "Have through hole vias everywhere and turn your PCB into the surface of a tiny airhockey table?", "time": 1643914708, "type": "comment"}, {"by": "m463", "id": 30196972, "parent": 30196217, "text": "But what if there was a &quot;Bruce Schneier&quot; app store?", "time": 1643914716, "type": "comment"}, {"by": "x86_64Ubuntu", "id": 30196973, "parent": 30193083, "text": "Even if the AG is told to start the rescheduling process, a &quot;study&quot; has to be done to enable it.<p><a href=\"https:&#x2F;&#x2F;www.brookings.edu&#x2F;blog&#x2F;fixgov&#x2F;2015&#x2F;02&#x2F;13&#x2F;how-to-reschedule-marijuana-and-why-its-unlikely-anytime-soon&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.brookings.edu&#x2F;blog&#x2F;fixgov&#x2F;2015&#x2F;02&#x2F;13&#x2F;how-to-resc...</a><p>The only entity that can end prohibition altogether is Congress.  When they setup the drug laws, they made them so that there would be a massive chain of signoffs, and so that any single unreasonable person could stop the whole thing.", "time": 1643914716, "type": "comment"}, {"by": "bhartzer", "descendants": 0, "id": 30196974, "score": 1, "time": 1643914717, "title": "Who Has Your Face?", "type": "story", "url": "https://www.whohasyourface.org/"}, {"deleted": true, "id": 30196975, "time": 1643914723, "type": "story"}, {"by": "rlt", "id": 30196976, "parent": 30196371, "text": "I assume Apple only cares enough about the anti-stalking feature to avoid significant negative press.<p>As others have pointed out, you can buy small GPS trackers without anti-stalking features already, and those will only get smaller &#x2F; better battery life over time.", "time": 1643914724, "type": "comment"}, {"by": "Yizahi", "id": 30196977, "parent": 30196719, "text": "Easy - print 300 millions of any one of the half a hundred existing stabletokens, then exchange them for ethereum tokens. Or if they were of the founders of some token, they can spend part of their premine for Eth. Possibilities are endless if the market is &quot;free&quot; :)", "time": 1643914730, "type": "comment"}, {"by": "yamrzou", "descendants": 0, "id": 30196978, "score": 1, "time": 1643914731, "title": "Self-Leadership (2014)", "type": "story", "url": "http://trideltaleadership.blogspot.com/2014/02/self-leadership.html"}, {"by": "e4e78a06", "id": 30196979, "parent": 30196923, "text": "Jane Street made $8bn in 2020 [1]. $320M is probably peanuts in exchange for maintaining the stability of a market they dominate in capturing arbitrage money on.<p>[1]: <a href=\"https:&#x2F;&#x2F;www.bloomberg.com&#x2F;news&#x2F;articles&#x2F;2021-06-18&#x2F;jane-street-and-drw-traders-made-billions-in-pandemic-markets\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bloomberg.com&#x2F;news&#x2F;articles&#x2F;2021-06-18&#x2F;jane-stre...</a>", "time": 1643914736, "type": "comment"}, {"by": "josefslerka", "descendants": 0, "id": 30196980, "score": 1, "time": 1643914737, "title": "Wikipedia: Rocket mail is the delivery of mail by rocket or missile", "type": "story", "url": "https://en.wikipedia.org/wiki/Rocket_mail"}, {"by": "sudosysgen", "id": 30196981, "parent": 30196229, "text": "That is simply false. Few countries hypocritical about counter-intelligence. You absolutely have to draw the difference between intelligence work and counter-intelligence work. Saying that going after someone for catching your spies is normal is totally insane, no one except the US does it.<p>If Uganda was spying on the US in the US, then you would have a point. That&#x27;s not what happened.", "time": 1643914738, "type": "comment"}, {"by": "loa_in_", "id": 30196982, "parent": 30196650, "text": "When your cat&#x27;s fur changes colour it&#x27;s not our fault, but it&#x27;s time to pack and leave.[1]<p>(1) <a href=\"http:&#x2F;&#x2F;www.theraycatsolution.com&#x2F;#10000\" rel=\"nofollow\">http:&#x2F;&#x2F;www.theraycatsolution.com&#x2F;#10000</a>", "time": 1643914739, "type": "comment"}, {"by": "pornel", "id": 30196983, "parent": 30196752, "text": "Mobile app stores are a duopoly, so Google can charge as much as Apple charges.", "time": 1643914739, "type": "comment"}, {"by": "zepto", "id": 30196984, "parent": 30196847, "text": "I notice you don’t say they are bringing in $5 billion from <i>surveillance</i> advertising.<p>Presumably because to claim that would be false.", "time": 1643914740, "type": "comment"}, {"by": "rhino369", "id": 30196985, "parent": 30196101, "text": "&gt;Living close to a water source or reservoir doesn’t make conservation less important.<p>It doesn&#x27;t necessarily make conservation less important.  But it certainly does in some places like Chicago. They pull water from the same water shed that it eventually flows back into after use. And they control how much water flows from Lake Michigan into the Chicago river (and eventually the Mississippi River) via a damn.<p>It&#x27;s probably a bit more complex than that, and creating that system did change the water flow in the Great lakes (but that damage was done 130 years ago).  But right now, its essentially free water.  In Illinois, all roads (waterways) lead to Rome (the Mississippi).", "time": 1643914744, "type": "comment"}, {"by": "alisonatwork", "id": 30196986, "parent": 30196073, "text": "Can&#x27;t speak for Kazakhstan, but Germany and surrounding countries have sauerkraut, pretzels, beer, cider, wine, french fries, dumplings, pumpernickel and many other breads and brötchen, apple sauce, veges like asparagus and kohlrabi, desserts with rhubarb, red currants, berries... Certainly most meals are meat- and dairy-forward, but it&#x27;s not like there is nothing else in the cuisine.", "time": 1643914749, "type": "comment"}, {"by": "idohft", "id": 30196987, "parent": 30196923, "text": "Jump is very profitable.", "time": 1643914751, "type": "comment"}, {"by": "thereddaikon", "id": 30196988, "parent": 30194868, "text": "SC is a textbook example of feature creep. And Chris Roberts has the same problem George Lucas did, a creative with a blank check and nobody to tell him no. If they had stuck to the original feature set as promised in the kickstarter nearly a decade ago then the game would have been released by now. Instead they waste time and resources on overly ambitious features that are mostly unfinished and more and more ships.<p>Do I think its a scam? Not strictly. I don&#x27;t think they went in to this with the goal of taking people&#x27;s money and not delivering. But I do think its horribly mismanaged.", "time": 1643914752, "type": "comment"}, {"by": "atoav", "id": 30196989, "parent": 30195804, "text": "Last time I checked (2021) the CO2 emissions of <i>one</i> bitcoin transaction was equivalent to driving over 2000 km in an average middle european car from the same year (see: <a href=\"https:&#x2F;&#x2F;www.forbes.com&#x2F;sites&#x2F;philippsandner&#x2F;2021&#x2F;11&#x2F;19&#x2F;bitcoin-co2-emissions-from-an-investor-perspective-and-how-to-compensate-them&#x2F;?sh=3850e748c1ca\" rel=\"nofollow\">https:&#x2F;&#x2F;www.forbes.com&#x2F;sites&#x2F;philippsandner&#x2F;2021&#x2F;11&#x2F;19&#x2F;bitco...</a>)<p>Unless I made an error here, or that study is flawed this seems to me like a ridiculously huge amount?", "time": 1643914754, "type": "comment"}, {"by": "axiosgunnar", "id": 30196990, "kids": [30197005], "parent": 30196496, "text": "What is it used for? Explosives?", "time": 1643914756, "type": "comment"}, {"by": "lmilcin", "id": 30196991, "parent": 30196652, "text": "Professionalism, in my opinion, is about taking reasonable precautions to prevent the problem from happening.<p>If you are professional you know what kind of potential problems might happen and you know what are reasonable possible approaches to handle it.<p>If security of your piece of software relies on default values of some settings I would reasonably expect you to have automated tests to verify that these settings have correct values.", "time": 1643914760, "type": "comment"}, {"by": "lostlogin", "id": 30196992, "parent": 30196298, "text": "The 737 Max attempted pioneering work in this area.", "time": 1643914769, "type": "comment"}, {"by": "8note", "id": 30196993, "parent": 30191178, "text": "They&#x27;re marketed as such, I imagine to avoid antitrust of &quot;general purpose computers&quot; like the iPhone, despite both being generic computers", "time": 1643914770, "type": "comment"}, {"by": "underscore_ku", "descendants": 0, "id": 30196994, "score": 1, "time": 1643914770, "title": "U.S. says new Intel shows Russia plotting false flag attack", "type": "story", "url": "https://apnews.com/article/russia-ukraine-business-europe-belarus-jens-stoltenberg-43c9151532de706a2edec5684dfcf07d"}, {"by": "digisign", "id": 30196995, "parent": 30196564, "text": "IBM had been established for decades before the PC, also the PC in general was established for years before their entry.\nI think they knew what to do.  It was a bit of a gamble, sure.  And you can make the argument they guessed wrong.  But the success of the PC and subsequent crushing of the rest of the industry was incredibly successful.<p>The flexible design did catch on, simultaneously a blessing and a curse to IBM.", "time": 1643914771, "type": "comment"}, {"by": "jacquesm", "id": 30196996, "parent": 30196971, "text": "Neat! Not too much pressure though or you&#x27;ll be peeling your robots off the ceiling :)", "time": 1643914773, "type": "comment"}, {"by": "thatfrenchguy", "id": 30196997, "parent": 30196865, "text": "In a newly built 2500sqft house you should need a lot less than 200A for this, it should have almost perfect insulation.<p>That, and tankless water heater are stupid, frankly.", "time": 1643914774, "type": "comment"}, {"by": "bena", "id": 30196998, "parent": 30196325, "text": "Sim City for Windows 3.x would read memory it recently freed.<p>This never crashed the program because Windows 3.x was more like a graphical shell on top of DOS. It wasn&#x27;t a true multi-user or multi-tasking operating system. If you released memory, there wasn&#x27;t anything else waiting to grab it from you. So the fact that you shouldn&#x27;t read memory that&#x27;s been freed, it went unnoticed.<p>Until they tried to run it on Windows 95. Then it would crash. A lot. The game was unplayable. Because Windows 95 was a multi-tasking operating system and it would reallocate freed memory to other programs that may ask for it.<p>So they put a specific check in Windows 95 to see if Sim City is running. And if it was, they essentially sandboxed its memory so nothing else could grab any memory it used.<p>While in this case, this isn&#x27;t an example of a bug that was intentionally left in, it is an example of code written into an operating system to handle the bug of a single program.<p>But that&#x27;s how they&#x27;d handle it. If PROGRAM X required certain behavior, they&#x27;d check to see if that program was running and alter behavior so the program would run. If feels like that&#x27;s like half of what the registry is for.", "time": 1643914778, "type": "comment"}, {"by": "loceng", "id": 30196999, "kids": [30197054], "parent": 30196496, "text": "Is ammonium nitrate used for weapons production of any kind?", "time": 1643914779, "type": "comment"}, {"by": "lpapez", "id": 30197000, "parent": 30196836, "text": "There are literally hundreds of simple (and open-source) music players out there, including Winamp you mentioned and its offspring. What is preventing you from using those? IMO, this is the same argument like when people say &quot;modern music sucks&quot; without ever searching for amazing new bands outside the mainstream.", "time": 1643914786, "type": "comment"}, {"by": "dblohm7", "id": 30197001, "parent": 30190684, "text": "IP addresses are uniquely identifiable, sure, but not <i>personally</i> identifiable.", "time": 1643914787, "type": "comment"}, {"by": "vorpalhex", "id": 30197002, "parent": 30196399, "text": "Your employer can already do this on both platforms, and Apple totally bent over for China and their abusive apps.<p>This needs a fix, and clearly we don&#x27;t have one currently. No reason to let another ill occur in the meantime.", "time": 1643914789, "type": "comment"}, {"by": "zjaffee", "id": 30197003, "parent": 30192364, "text": "Honestly the reason I use facebook still is to consume content from people I don&#x27;t know, facebook groups are the only social thing left on the website, and the rest of it I use for fb marketplace which at least in my area has totally stolen the spotlight from craigslist.", "time": 1643914796, "type": "comment"}, {"by": "MikeBVaughn", "id": 30197004, "parent": 30196405, "text": "I mean, my first impulse would have been to respond with &quot;no&quot; and close the issue, so as far as I&#x27;m concerned, he&#x27;s well ahead of the curve.<p>I&#x27;m not sure how many ways there are to respond to &#x27;is it safe to push the button labeled &quot;don&#x27;t push this button, it&#x27;s unsafe to push it, it&#x27;s bad to push it, please don&#x27;t push, dear God just don&#x27;t&quot;?&#x27; Time is finite and some questions just aren&#x27;t very good questions.", "time": 1643914797, "type": "comment"}, {"by": "loceng", "id": 30197005, "parent": 30196990, "text": "I&#x27;m wondering the same - or perhaps biological weapons? It&#x27;s obviously a cover story, their farmland and farmer needs didn&#x27;t just all of a sudden lead to requiring the amount it exports.", "time": 1643914798, "type": "comment"}, {"by": "xoa", "id": 30197006, "parent": 30196750, "text": "I haven&#x27;t experienced the same issues you describe in terms of random beeping or the like. But I do think one of the most curious and irritating missing pieces from AirTags is no sort of tie-in with Family Sharing or some sort of contacts whitelist. I saw one thing saying that was about privacy but that makes zero sense because Apple doesn&#x27;t do the same thing elsewhere. While it&#x27;s opt-in, having done so I can see device locations for all of my family&#x27;s stuff, which is very helpful when somebody is missing their phone or the like (anyone else can help with it) as well as checking in disasters. I don&#x27;t see why that would be fine but keys wouldn&#x27;t. It can&#x27;t be that rare for a family to have multiple vehicles where a certain amount of sharing happens, particularly if it&#x27;s a pattern like us where the SO and I each have a car but then there is a single old truck that we both use. Family names are on the insurance, legally it&#x27;s multidriver property. And even good friends&#x2F;room mates probably share some kinds of property. Whomever has it is responsible for not losing it and thus has an interest in tracking it.<p>Yeah it&#x27;s a v1.0, but even so when Apple already has all this infrastructure up strikes me as an odd omission that significantly detracts from the utility for no good end.", "time": 1643914803, "type": "comment"}, {"deleted": true, "id": 30197007, "parent": 30196816, "time": 1643914813, "type": "comment"}, {"by": "subpixel", "id": 30197008, "parent": 30193899, "text": "This reminds me a lot of time I spend reading Dwell magazine a decade ago.<p>Since that time, I&#x27;ve moved past the point where building such a house is impossible for me financially, but I&#x27;ve also moved past the point where such a house is attractive to me.<p>I saved up a lot of back issues of Dwell thinking I&#x27;d refer to them when building a dream home, and in a move a few years ago I threw them out. It felt exactly like what I imagine throwing out an adult magazine collection might feel like - oddly relieving.<p>Like airbrushed nude photos in Playboy (showing my age, I know), grand home schemes of all kinds are a pursuit of perfection. But nothing is perfect, or stays that way very long, and the higher your expectation and expense in relation to objects-as-happiness, the greater the disappointment.<p>I really am a sucker for innovative architecture, but for me, innovation is about dealing with constraints, not conquering nature and heating your pool at all costs.", "time": 1643914814, "type": "comment"}, {"by": "lamontcg", "id": 30197009, "parent": 30195017, "text": "Except when it comes to mRNA vaccine mandates, then technology is suddenly bad.", "time": 1643914814, "type": "comment"}, {"by": "izacus", "id": 30197010, "kids": [30197041], "parent": 30196965, "text": "Tile also isn&#x27;t nearly as sensitive because it needs people to install their app to opt-in to their tracking network.<p>Apple coopted every single phone into a tracker essentially creating a biggest people following and tracking network in the world - plus they use UWB which massively more accurate than what Tile uses.<p>What Apple created would be Facebooks, NSAs and pretty much every spying entities wet dream to get fingers on.", "time": 1643914815, "type": "comment"}, {"by": "riedel", "id": 30197011, "parent": 30196952, "text": "While it sounds nice in principle, I really hope it is not as messy as the data governance and AI act.", "time": 1643914829, "type": "comment"}, {"by": "Stronico", "id": 30197012, "parent": 30193946, "text": "Maybe I&#x27;ve just gotten better at what I follow&#x2F;comment on, but the mood feels like it&#x27;s gotten a bit better over the past few years, more tolerant, more heterdox, less shrill, more interesting, less combative, less &quot;performative&quot;, etc.  Not perfect, but improving over a few years ago.  It does feel like the average age of the commenter has increased though.", "time": 1643914832, "type": "comment"}, {"by": "vorpalhex", "id": 30197013, "parent": 30196549, "text": "Then don&#x27;t use third party stores. Done.", "time": 1643914835, "type": "comment"}, {"by": "jefftk", "id": 30197014, "parent": 30195209, "text": "<i>&gt; We&#x27;re paying $0.30-$0.40 &#x2F; kwh to PG&amp;E, which pencils out to over $9 &#x2F; gallon.</i><p>No way.  An electric car (including charging inefficiency) uses about ~0.3 kWh per mile, so at $0.35&#x2F;kWh each mile costs you ~$0.10 in electricity. If a gas car gets 35mpg, then for each mile to cost ~$0.10 in fuel, gas would need to cost $3.50 not $9.<p>How are you getting $9?", "time": 1643914839, "type": "comment"}, {"by": "cableshaft", "id": 30197015, "parent": 30196862, "text": "Congrats!<p>Unfortunately not in the US. Health care alone will likely to take at least a third of that.<p>&quot;Because of the effects of inflation, a 50-year-old couple in 2019 planning to retire at age 65 can expect to spend about $405,000 on health care in retirement. A 40-year-old couple faces $455,000 in expenses, the report says.&quot;<p><a href=\"https:&#x2F;&#x2F;www.annuity.org&#x2F;retirement&#x2F;health-care-costs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.annuity.org&#x2F;retirement&#x2F;health-care-costs&#x2F;</a>", "time": 1643914839, "type": "comment"}, {"by": "beambot", "id": 30197016, "parent": 30196928, "text": "They need to switch over to Helium&#x27;s LoRa network, which has vastly better coverage...", "time": 1643914845, "type": "comment"}, {"by": "Klonoar", "id": 30197017, "parent": 30196620, "text": "Your comment hits the nail on the head for me.<p>Regarding bots, it feels like any time this issue is discussed here it gets pushed down rather quickly. I really think it should be examined harder though. I outright stopped glancing at &#x2F;new since it often looks like the same accounts trying to push some messaging (e.g vaccine rhetoric, often from some random substack).<p>Your other point is one I’ve tried to put into words lately. I think I even put it to one friend (a YC founder no less) that “the people who actually wanted to build something left long ago, and often all that feels left is the old crowd that just complains about specific tech repeatedly”.<p>If I see another discussion repeating the same Linux on the desktop talking points, or the problems with Electron, I’ll scream.", "time": 1643914849, "type": "comment"}, {"by": "DavideNL", "id": 30197018, "parent": 30184457, "text": "Heh. So if you click the Apple icon, you get games that are NOT playable on Apple devices :S<p>*confusing*", "time": 1643914850, "type": "comment"}, {"by": "bduerst", "id": 30197019, "parent": 30195810, "text": "I&#x27;d say that Star Citizen and video game NFTs are both on par with being all promise and no meaningful delivery (yet) though.  I could see both Ubi restricting sales of their &quot;NFTs&quot; and Star Citizen adding resale features later.  That&#x27;s how nebulous both are.", "time": 1643914855, "type": "comment"}, {"by": "ilamont", "descendants": 0, "id": 30197020, "score": 1, "time": 1643914856, "title": "How a Boston sewer employee redesigned drain covers to reduce hazardous waste", "type": "story", "url": "https://www.dotnews.com/2022/where-do-our-storm-drains-lead-read-plaques"}, {"by": "orangepurple", "id": 30197021, "parent": 30196726, "text": "1.7 million people may disagree with you<p>Oct. 22, 2021\nA record 1.7 million migrants from around the world, many of them fleeing pandemic-ravaged countries, were encountered trying to enter the United States illegally in the last 12 months, capping a year of chaos at the southern border, which has emerged as one of the most formidable challenges for the Biden administration.<p><a href=\"https:&#x2F;&#x2F;www.nytimes.com&#x2F;2021&#x2F;10&#x2F;22&#x2F;us&#x2F;politics&#x2F;border-crossings-immigration-record-high.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nytimes.com&#x2F;2021&#x2F;10&#x2F;22&#x2F;us&#x2F;politics&#x2F;border-crossi...</a>", "time": 1643914856, "type": "comment"}, {"by": "saila", "id": 30197022, "parent": 30196642, "text": "Reading through this, it doesn&#x27;t sound like ABS was required in 2009: <a href=\"https:&#x2F;&#x2F;crashstats.nhtsa.dot.gov&#x2F;Api&#x2F;Public&#x2F;ViewPublication&#x2F;811182\" rel=\"nofollow\">https:&#x2F;&#x2F;crashstats.nhtsa.dot.gov&#x2F;Api&#x2F;Public&#x2F;ViewPublication&#x2F;...</a>.<p>Another source says it&#x27;s been required (federally) as of 2013: <a href=\"https:&#x2F;&#x2F;knowhow.napaonline.com&#x2F;what-does-abs-mean-on-a-car&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;knowhow.napaonline.com&#x2F;what-does-abs-mean-on-a-car&#x2F;</a>.", "time": 1643914857, "type": "comment"}, {"by": "rootusrootus", "id": 30197023, "parent": 30196918, "text": "A quick search on Amazon for &#x27;gps tracker&#x27; will yield at least one option on the first page for $29.99.  GSM for communications.  Not as small as an AirTag, but 1.5 inches by 0.9 by 0.6 inches isn&#x27;t exactly huge either.<p>A legitimate point is that the battery life isn&#x27;t great.  But that&#x27;s not too hard to solve, if you tolerate a little more space for a bigger battery.<p>I&#x27;m sure there are even better options out there, that&#x27;s just what I could come up with in under a minute.  For anybody with more than idle curiosity, I imagine there are some pretty clever solutions available.", "time": 1643914858, "type": "comment"}, {"by": "rolobio", "id": 30197024, "parent": 30196935, "text": "Tile does not have nearly the network that Apple does.  I attached an AirTag to an electric scooter, which I ended up returning.  I forgot to remove the AirTag; I&#x27;ve been able to track the scooter over hundreds of miles with quick updates (even driving down a freeway).  I&#x27;ve been having a fun time checking in on the scooter for months now.<p>I have a Tile attached to a generator at my house. Since I&#x27;ve disabled Tile on my phone in favor of AirTag, my generator hasn&#x27;t been detected in over 31 days.  Even with neighbors walking past my house constantly.", "time": 1643914860, "type": "comment"}, {"by": "pessimizer", "id": 30197025, "parent": 30196405, "text": "I read it, and he seemed entirely polite and cheery. Is there any way to refuse something that can&#x27;t be read as rude by someone?", "time": 1643914862, "type": "comment"}, {"by": "sdze", "id": 30197026, "parent": 30193899, "text": "No Costs listed. \nDidn&#x27;t read it.", "time": 1643914862, "type": "comment"}, {"by": "jcrawfordor", "id": 30197027, "parent": 30194891, "text": "NA uses 120VAC at most loads - but service is 240V split. So 200A service in NA is the same as 200A in the EU. Of course this is confusing since we often talk about 120V loads, e.g. a 15A electric kettle in the US is pretty lame compared to a 15A electric kettle in the UK.<p>The 120V outlets are approximately equally split between the two legs (which you could view as -120 to 0 and 0 to +120), so one way you could view it is that 200A service in NA allows for about 400A of 120V load. But then larger loads are usually across both legs and you have to account for imbalance so it doesn&#x27;t work out quite that simply. And then there are &quot;weird load&quot; like dryers, which commonly put the heating element across both legs but the drum and blower motors across only one, resulting in some amps on both legs and some more amps on only one of them.<p>And while we&#x27;re at it commercial buildings often run the lighting across both legs for wire gauge economy. So there&#x27;s a lot of nuance on the load side. But on the supply side it&#x27;s all 240V either way (well, kind of, could be 208V in case of a wye supply, but that&#x27;s not common).", "time": 1643914865, "type": "comment"}, {"by": "thatfrenchguy", "id": 30197028, "parent": 30193899, "text": "First comment from my partner was “I don’t know if this is the Parasite house of an Apple Store” :-)", "time": 1643914869, "type": "comment"}, {"by": "zepto", "id": 30197029, "parent": 30196086, "text": "&gt; How can I offer explanation to the decline of a regime? Is it not obvious that mental health has been in decline for decades? Or that economic inequality is ever-growing? The average lifespan is in decline. Houselessness is on the rise.<p>Yes, and Facebook is contributing to the acceleration of those things.<p>Is that not something you have considered?", "time": 1643914871, "type": "comment"}, {"by": "tgtweak", "id": 30197030, "parent": 30195371, "text": "Correct, it has been proven many times that the lack of blindspot directly in front of the vehicle (to the driver) is the main factor.  New &quot;stubby&quot; nose school bus designs greatly improved this over existing ones which were closer to a semi.  Lately, front cameras and warning systems have made this less of a concern but it still remains the case.", "time": 1643914872, "type": "comment"}, {"by": "ipython", "id": 30197031, "parent": 30196298, "text": "<a href=\"https:&#x2F;&#x2F;en.m.wikipedia.org&#x2F;wiki&#x2F;Therac-25\" rel=\"nofollow\">https:&#x2F;&#x2F;en.m.wikipedia.org&#x2F;wiki&#x2F;Therac-25</a>", "time": 1643914874, "type": "comment"}, {"by": "PaywallBuster", "id": 30197032, "parent": 30196719, "text": "The parent company is a crypto HFT<p>It&#x27;s parent company is huge HFT trading company too.<p><a href=\"https:&#x2F;&#x2F;www.coindesk.com&#x2F;business&#x2F;2022&#x2F;02&#x2F;03&#x2F;jump-trading-backstops-wormholes-320m-exploit-loss-sources&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.coindesk.com&#x2F;business&#x2F;2022&#x2F;02&#x2F;03&#x2F;jump-trading-ba...</a><p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Jump_Trading\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Jump_Trading</a>", "time": 1643914880, "type": "comment"}, {"by": "stratagem_ben", "id": 30197033, "parent": 30194782, "text": "There isn&#x27;t, but there ought to be so that&#x27;s on the todo now. But I&#x27;ll try to give you a quick rundown here.<p>The steps to getting an ASN essentially entail setting up some objects over at the RIPE database and then letting us know what these are, we will then send you some paperwork to print, sign &amp; return to us. \nFrom here, we submit this application to RIPE (along with company documents, if applying as a company) and they will then request ID verification from you directly (if applying as an individual) or seek to validate your Company, if applying as a company. A few days later, RIPE will give you an ASN. This is the short version but it is essentially just a bit of paperwork and that&#x27;s all.<p>The &#x2F;48 is PA space we give to you in order for you to announce via BGP, with your fresh new ASN. This is included for the life of your ASN (or the heat death of the universe, whichever comes first) and you are free to take that and announce it wherever you want. We do make a polite request that you peer with us but it&#x27;s not a requirement. If you do peer with us we can help get you up &amp; running and your prefix announced.<p>Hope that helps a little &amp; if not, feel free to find me on Discord (link is in the footer of the website) and I&#x27;ll be happy to walk you through it.", "time": 1643914884, "type": "comment"}, {"by": "vkou", "id": 30197034, "parent": 30195753, "text": "If there was no emissions testing to begin with, these trucks would be designed to pollute for their entire service life, instead of just the last 20-40% of it.", "time": 1643914898, "type": "comment"}, {"by": "pajko", "id": 30197035, "parent": 30196371, "text": "So this is a failed product then. Too good for tracking because it can be abused. While the new version alerts the thieves in the intended use case. Should have been given a 10x-50x price tag right from the start, to make it less available and affordable for malicious activities.", "time": 1643914900, "type": "comment"}, {"by": "bin_bash", "id": 30197036, "parent": 30196956, "text": "I&#x27;ve been using Tile for years. It&#x27;s inferior, yes, but it&#x27;s definitely good enough for spying.", "time": 1643914901, "type": "comment"}, {"by": "jiggunjer", "id": 30197037, "parent": 30184457, "text": "I&#x27;m pretty confident gaming addiction is a thing, but not sure how strong (in terms of studies&#x2F;evidence) the correlation is with these dark patterns. My hypothesis is that certain personality types are just more susceptible to gaming addiction, regardless of patterns.", "time": 1643914906, "type": "comment"}, {"by": "oblio", "id": 30197038, "parent": 30192201, "text": "Yup, but the current system is not a decentralized, immutable database.<p>At least you kind-of-sort-of have a chance at reverting a transaction.<p>Heck, my bank blocks my transaction over a certain limit and frequently delays transactions larger than another limit and they call me to verify that I want to do them.<p>Sure, blockchains could do the same, through intermediaries, but then... they&#x27;ve reinvented banks.", "time": 1643914907, "type": "comment"}, {"by": "potamic", "id": 30197039, "parent": 30194636, "text": "Wouldn&#x27;t it be easier to dismantle the mast and rebuild it?", "time": 1643914916, "type": "comment"}, {"by": "OkayPhysicist", "id": 30197040, "parent": 30196802, "text": "Most hallucinogens are actually pretty reasonable when it comes to testing. Between the reasonably long effects, and the relatively short period where you won&#x27;t piss clean, you can pretty much use a standard urine test as a test for being under the influence.", "time": 1643914922, "type": "comment"}, {"by": "micromacrofoot", "id": 30197041, "parent": 30197010, "text": "Yeah I get it, but Tile&#x27;s network is still good enough to find someone&#x27;s house in a somewhat densely populated area. I&#x27;ve done it.<p>&gt;What Apple created would be Facebooks, NSAs and pretty much every spying entities wet dream to get fingers on.<p>The government already has this with cell phones, no?", "time": 1643914923, "type": "comment"}, {"by": "udbhavs", "id": 30197042, "parent": 30195244, "text": "Private properties in JS classes are syntactic sugar that compile to variable definitions like this in the object&#x27;s scope", "time": 1643914924, "type": "comment"}, {"by": "aunty_helen", "id": 30197043, "parent": 30192391, "text": "This was early days when WhatsApp was still searching for a business model.<p>That business model turned out to be acquire critical mass and then be acquired, but I recall people talking about how WhatsApp was hemorrhaging money in the process.", "time": 1643914930, "type": "comment"}, {"by": "obelos", "id": 30197044, "parent": 30195000, "text": "I feel downright minimalist now with my 120A&#x2F;120V grid service.", "time": 1643914932, "type": "comment"}, {"by": "zepto", "id": 30197045, "parent": 30194651, "text": "I guess you are not aware that TikTok is both highly profitable and valuable.", "time": 1643914933, "type": "comment"}, {"by": "kipchak", "id": 30197046, "parent": 30193469, "text": "Anecdotally from playing Euro Truck Simulator, shorter trucks are also helpful in German zipper merge lanes, which are quite a bit smaller than typical US merge lanes. This article has a pretty good photo.<p><a href=\"https:&#x2F;&#x2F;www.ozy.com&#x2F;the-new-and-the-next&#x2F;german-roads-are-smarter-than-yours&#x2F;60839&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ozy.com&#x2F;the-new-and-the-next&#x2F;german-roads-are-sm...</a>", "time": 1643914935, "type": "comment"}, {"by": "everyone", "id": 30197047, "parent": 30196353, "text": "Sound like you simply dislike computer games.", "time": 1643914938, "type": "comment"}, {"by": "arrosenberg", "id": 30197048, "parent": 30196399, "text": "Can you explain how this is materially different from the apps corporate security already makes you install on devices to allow them to track and wipe the device? How it is materially different from what goes on my laptop?", "time": 1643914941, "type": "comment"}, {"by": "powersnail", "id": 30197049, "parent": 30196563, "text": "&gt; U.S. government mostly doesn&#x27;t enforce its laws against unlawful entry<p>If you ever get arrested for anything, get background checked for anything, get reported by somebody to the police, need to deal with legal matter, need health insurance, or if one day somebody at ICE missed his morning coffee......<p>Life as a fugitive is not fun. Even if currently the law is not strictly enforced.", "time": 1643914944, "type": "comment"}, {"by": "cbm-vic-20", "id": 30197050, "parent": 30195633, "text": "My 100 year old house in the US has 100A service- though I&#x27;m thinking of upgrading to 200A service to help with Level 2 EV charging.", "time": 1643914949, "type": "comment"}, {"by": "pupppet", "id": 30197051, "parent": 30194868, "text": "As a game developer they have the sweetest gig – near unlimited funds and zero expectations.", "time": 1643914964, "type": "comment"}, {"by": "winternett", "id": 30197052, "parent": 30193946, "text": "People are frustrated because their online experience is more frustrating than before. App updates, social media, and even entertainment options are all tightening their grip on revenue streams and profit, which makes online experiences far more frustrating without most people knowing that it&#x27;s occurring.<p>Also, opportunity is still being twisted by corporations to prevent employee advancement and growth as &quot;pushback&quot; to economic protests going on right now.<p>There is also fatigue from our current world-wide pandemic to where people aren&#x27;t communicating and social as they were prior.<p>All of these things are manifesting in our daily experiences, and when combined with intentionally limited tools where people can communicate and express themselves and in normally encountering negative discourse online, many people are becoming even more and more aggravated, triggered, and aggressive towards each other as a result online and in real life.<p>Our user experiences are a major issue now that we rely so much on software and now that they have almost all been corrupted by monetization, inundated by advertisements, and limited because they&#x27;ve scaled too far to truly be useful to us as individuals.<p>It may sound like doom and gloom, but that worry goes away if you turn the tech off and go outside and talk to real people without all of the feckless apps and overpriced hardware involved.", "time": 1643914964, "type": "comment"}, {"by": "orangepurple", "id": 30197053, "parent": 30196680, "text": "The Transportation Security Administration confirmed to Fox News on Friday that it allows illegal immigrants to use arrest warrants as an alternative form of ID to board airplanes.<p>&quot;For non-citizens and non-U.S. nationals who do not otherwise have acceptable forms of ID for presentation at security checkpoints, TSA may also accept certain DHS-issued forms, including ICE Form I-200 (Warrant for Arrest of an Alien),&quot; a TSA spokesperson told Fox News. That refers to a civil immigration arrest warrant, not a criminal arrest warrant.<p>The agency added that the document will then be validated via an &quot;alien identification number&quot; being checked against a number of Customs and Border Protection (CBP) databases.<p>&quot;All passengers whose identity is verified through alternate procedures receive additional screening before being allowed into the secure area of the airport,&quot; the statement said.", "time": 1643914976, "type": "comment"}, {"by": "rootsudo", "id": 30197054, "parent": 30196999, "text": "Explosives and Fertilizer. It can also be used in drug production.", "time": 1643914976, "type": "comment"}, {"by": "mrtranscendence", "id": 30197055, "parent": 30196627, "text": "I&#x27;ve never played Star Citizen, but I&#x27;ve heard from many parties that it&#x27;s full of frequent, immersion-breaking bugs that aren&#x27;t fixed in lieu of adding more new features. Is it a scam? Maybe that&#x27;s too harsh. But it&#x27;s eight years into unmet promises and scope creep, and that doesn&#x27;t make me hopeful for the game&#x27;s future.", "time": 1643914984, "type": "comment"}, {"by": "nomel", "id": 30197056, "parent": 30193634, "text": "I think the argument is that having a completely open App Store would increase the attack surface, since the average user will click any install icon.", "time": 1643914984, "type": "comment"}, {"by": "johnyzee", "id": 30197057, "parent": 30195924, "text": "Mohammad Bin Zayed, ruler of Abu Dhabi (and thus, the United Arab Emirates).", "time": 1643914991, "type": "comment"}][{"by": "enragedcacti", "id": 30197058, "parent": 30196793, "text": "courts don&#x27;t really care about technicalities like that. No one is filing their taxes or sending out work emails on their Xbox so its not the same even if someone hypothetically could.", "time": 1643915001, "type": "comment"}, {"by": "demadog", "id": 30197059, "parent": 30196942, "text": "They would if they could. Those are mostly tiny countries with almost no resources to spy.", "time": 1643915001, "type": "comment"}, {"by": "jeffbee", "id": 30197060, "parent": 30195000, "text": "The whole thing is pretend environmentalism. It starts out with some superficially &quot;green&quot; elements like solar power but eventually throws it all out the window when that conflicts with luxury or desire. In the end they&#x27;ve built a huge, inefficient house with enough embodied energy to power Ghana for a year, only accessible with the family&#x27;s giant gas-guzzling truck, as depicted.", "time": 1643915003, "type": "comment"}, {"by": "nexuist", "id": 30197061, "parent": 30196923, "text": "Jump Trading Group isn&#x27;t some rando crypto org, it&#x27;s a legit hedge fund established in 1999. Supposedly it has at minimum $150M AUM[1] but because it&#x27;s a private company nobody actually knows the real amount. We can predict that they probably have a few billion in cash lying around if they&#x27;ve been successfully trading for over 20 years. Jump Crypto, the group that bailed out Wormhole, is their crypto trading division.<p>[1] <a href=\"https:&#x2F;&#x2F;wallmine.com&#x2F;fund&#x2F;3mg&#x2F;jump-trading-llc\" rel=\"nofollow\">https:&#x2F;&#x2F;wallmine.com&#x2F;fund&#x2F;3mg&#x2F;jump-trading-llc</a>", "time": 1643915005, "type": "comment"}, {"by": "panzagl", "id": 30197062, "parent": 30196764, "text": "The analogy is saying there are malls in two different towns- there&#x27;s only one mall in Androidville, and if I want to go to the one in Appletown I have to sell my house and all the stuff I bought at the Androidville mall and move there.  Trying to argue its not a monopoly is engaging in the worst type of pointless semantic argument.", "time": 1643915008, "type": "comment"}, {"by": "Zigurd", "id": 30197063, "parent": 30181533, "text": "Paltrow on Goop selling jade balls for your hoo ha is ridiculous. But nobody died (that I know of). Pandemic misinformation is different.", "time": 1643915013, "type": "comment"}, {"by": "tmaly", "id": 30197064, "parent": 30192644, "text": "This made me think of the original idea of using Gold or precious metals as a currency.<p>The idea is that this type of currency should hold value and buy the same amount of goods and services.   A 1 ounce gold coin in 1920 would buy a nice tailored suit.  Today a 1 ounce gold coin still buys a nice tailored suit.<p>Could this idea be extended to a crypto currency that is not used for pure speculative trading, but really as a store of value?", "time": 1643915014, "type": "comment"}, {"by": "autarch", "id": 30197065, "parent": 30195958, "text": "&gt; <i>And you genuinely see nothing ethically questionable with supporting products which pretend that they are made from animals?</i><p>No, I don&#x27;t. Honestly, I don&#x27;t even understand how someone could. As others have noted, this is just branding. No one is being fooled, and the idea that eating &quot;mock duck&quot; somehow normalizes eating actual duck seems pretty unlikely to me.", "time": 1643915015, "type": "comment"}, {"by": "warble", "id": 30197066, "parent": 30196437, "text": "Yeah, in the current market you&#x27;re correct, but we should be concentrating on creating an excess of cheap power (carbon free of course) rather than conserving.", "time": 1643915015, "type": "comment"}, {"by": "aronishchal", "id": 30197067, "parent": 30164270, "text": "SEEKING WORK | Europe | Remote<p>Location: Europe<p>Remote: Yes<p>Willing to relocate: No<p>Technologies: Java EE, Spring, Spring Security, REST, HTML&#x2F;CSS, JavaScript, JQuery, Dojo, Node.js, Python, Perl, Jaspersoft Studio, Eclipse, Tomcat, MySQL, Oracle, Git<p>Résumé&#x2F;CV: <a href=\"https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1Oyazlm3ucxH1XLgqScKs7g9zBOSGjT8q&#x2F;view\" rel=\"nofollow\">https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1Oyazlm3ucxH1XLgqScKs7g9zBOS...</a><p>Email: nishchalaro[at]gmail.com<p>I am a senior backend Java developer &#x2F; consultant with over 11 years in the industry. My expertise is in - building robust, secure and scalable backend services and enterprise Java applications, Javascript based geospatial maps and data visualization. I also have extensive experience with the TIBCO Jaspersoft BI product offering - Jaspersoft Studio, JasperReports Server and JETL (Talend ETL).<p>I am looking for part-time contract or freelance&#x2F;consulting opportunities at the moment (up to 20 hours&#x2F;week).<p>Website: <a href=\"https:&#x2F;&#x2F;www.aroranishchal.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.aroranishchal.com&#x2F;</a><p>Linkedin: <a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;nishchal-arora\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;nishchal-arora</a>", "time": 1643915017, "type": "comment"}, {"by": "errcorrectcode", "id": 30197068, "parent": 30196001, "text": "Some people think maintaining bank accounts on Mongo would be a good idea.<p>ACID, locking, referential integrity, SQL (language flavors and RE DBMSes) aren&#x27;t appreciated, probably due to a lack of CS education.", "time": 1643915026, "type": "comment"}, {"by": "drewrv", "id": 30197069, "parent": 30196697, "text": "I don&#x27;t know a good article, but for some reason I was curious at one point and discovered the marketing pages for various big rigs. Marketing materials presumably showcase more flashy features and higher trim levels.<p>Also the &#x2F;r&#x2F;Truckers&#x2F; subreddit has users post their setup sometimes. But usually those are either &quot;look what I was able to cook&quot; or &quot;check out my gaming setup&quot;.<p><a href=\"https:&#x2F;&#x2F;www.peterbilt.com&#x2F;trucks&#x2F;highway&#x2F;model-579\" rel=\"nofollow\">https:&#x2F;&#x2F;www.peterbilt.com&#x2F;trucks&#x2F;highway&#x2F;model-579</a><p><a href=\"https:&#x2F;&#x2F;www.volvotrucks.us&#x2F;trucks&#x2F;vnl&#x2F;interior&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.volvotrucks.us&#x2F;trucks&#x2F;vnl&#x2F;interior&#x2F;</a><p><a href=\"https:&#x2F;&#x2F;www.macktrucks.com&#x2F;trucks&#x2F;anthem&#x2F;features&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.macktrucks.com&#x2F;trucks&#x2F;anthem&#x2F;features&#x2F;</a>", "time": 1643915028, "type": "comment"}, {"by": "m463", "id": 30197070, "parent": 30196228, "text": "It&#x27;s been long known (yet unpopular to report) that speed variance is what is dangerous, not speed.<p>Basically the difference between the &quot;common sense speed&quot; for a road and the posted speed limit correlates to accident rate.", "time": 1643915037, "type": "comment"}, {"by": "aronishchal", "id": 30197071, "parent": 30164269, "text": "Location: Europe<p>Remote: Yes<p>Willing to relocate: No<p>Technologies: Java EE, Spring, Spring Security, REST, HTML&#x2F;CSS, JavaScript, JQuery, Dojo, Node.js, Python, Perl, Jaspersoft Studio, Eclipse, Tomcat, MySQL, Oracle, Git<p>Résumé&#x2F;CV: <a href=\"https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1Oyazlm3ucxH1XLgqScKs7g9zBOSGjT8q&#x2F;view\" rel=\"nofollow\">https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;1Oyazlm3ucxH1XLgqScKs7g9zBOS...</a><p>Email: nishchalaro[at]gmail.com<p>I am a senior backend Java developer &#x2F; consultant with over 11 years in the industry. My expertise is in - building robust, secure and scalable backend services and enterprise Java applications, Javascript based geospatial maps and data visualization. I also have extensive experience with the TIBCO Jaspersoft BI product offering - Jaspersoft Studio, JasperReports Server and JETL (Talend ETL).<p>I am looking for part-time contract or freelance&#x2F;consulting opportunities at the moment (up to 20 hours&#x2F;week).<p>Website: <a href=\"https:&#x2F;&#x2F;www.aroranishchal.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.aroranishchal.com&#x2F;</a><p>Linkedin: <a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;nishchal-arora\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;nishchal-arora</a>", "time": 1643915042, "type": "comment"}, {"by": "parasense", "id": 30197072, "parent": 30075961, "text": "Nonesense...<p>* What about looking at people with one&#x27;s own eyes, without the express consent of other people?<p>* What about people with photographic memory, who are effectively walking cameras?<p>* What about artists who draw pictures of people they see in public?<p>Where does this nonsense ever end? While the question is hyperbolic, and I apologize, that&#x27;s intentional use of the &quot;Reducto absurdum&quot; fallacy to help illustrate the absurdity of this kind of idea.", "time": 1643915043, "type": "comment"}, {"by": "spike021", "id": 30197073, "parent": 30196951, "text": "Your comment is akin to &quot;which came first, the chicken or the egg?&#x27;<p>I highly doubt there&#x27;s (much of) a market looking to buy AirTags without already owning the pre-requisite Apple hardware.", "time": 1643915045, "type": "comment"}, {"by": "maerF0x0", "id": 30197074, "parent": 30196963, "text": "if we look at the human race&#x27;s success across time though we&#x27;ve survived many pandemics and many hard to adapt to events. I guess it entirely depends on your scale of perspective, from individual and short term to species and long term.<p>An example of support for success could be: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=yCm9Ng0bbEQ\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=yCm9Ng0bbEQ</a> (Steven pinker TED talk)", "time": 1643915059, "type": "comment"}][{"by": "irrational", "id": 30197075, "parent": 30196983, "text": "But, isn&#x27;t this trying to close the barn doors after the horses are already out? Side loading is already here and there are already multiple app stores:<p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;List_of_Android_app_stores\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;List_of_Android_app_stores</a>", "time": 1643915061, "type": "comment"}, {"by": "bee_rider", "id": 30197076, "parent": 30196891, "text": "There are places where we waste energy because we&#x27;re doing dumb stuff: in northern parts of the country, your house should be well insulated and designed for cold temperatures.<p>Then there are places like Nevada, which are just not suitable for large-scale habitation. &quot;Can we make this monument to our hubris more energy efficient&quot; is kind of missing the point, right?", "time": 1643915065, "type": "comment"}, {"by": "shdon", "id": 30197077, "parent": 30192773, "text": "Really cool concept.<p>Some oddness to be found: run MSBASIC.EXE, then enter the command &quot;FILES&quot; (which is the BASIC command to get a listing of the files in the current directory, essentially a DIR command. That gets stuck in an endless loop, showing &quot;.       .*&quot;", "time": 1643915065, "type": "comment"}, {"deleted": true, "id": 30197078, "parent": 30114909, "time": 1643915071, "type": "comment"}, {"deleted": true, "id": 30197079, "parent": 30196657, "time": 1643915075, "type": "comment"}, {"by": "scarface74", "id": 30197080, "parent": 30196595, "text": "- you can’t access the unique identifier on iPhones as an app developer. Apple blocked that years ago.<p>- if you have found away to get around iOS’s ssndboxing, you could collect a bug bounty<p>- ad blocking doesn’t work well or at all for first party ads like FB, Reddit and Twitter use.", "time": 1643915082, "type": "comment"}, {"by": "Neil44", "id": 30197081, "parent": 30193946, "text": "Maybe it’s time for an Erlang purge.", "time": 1643915082, "type": "comment"}, {"by": "packetlost", "id": 30197082, "parent": 30193461, "text": "I don&#x27;t know what you&#x27;re talking about, I recall learning about T-cell immunity in middle-school biology class like 15 years ago. Just because politics causes you to cloud your judgement and memory does not mean the research and knowledge wasn&#x27;t already there.", "time": 1643915090, "type": "comment"}, {"by": "facorreia", "id": 30197083, "parent": 30195490, "text": "&gt; All preview binaries shown here are DEBUG versions, which means that all run-time assertions are enabled, so file sizes and memory usage are larger than normal, and overall performance is slightly lower.", "time": 1643915093, "type": "comment"}, {"by": "freedomben", "id": 30197084, "parent": 30195984, "text": "Yes I agree, although having gone through that several times in different frameworks, I am now a believer that you can avoid the majority of issues like that by keeping state centralized (like redux pattern) and building components in a functional-reactive way (no state in components).  Of course this doesn&#x27;t help much if you&#x27;re using Java Swing, but the vast majority of products that I run into this are web-based.  The &quot;always re-render&quot; approach of React can help a ton.  With that you have two separate event handlers (one for the click, one for the key press) but both of them simply update the &quot;state&quot; variable for whatever it is.  The framework then figures out what needs to change and does it.", "time": 1643915095, "type": "comment"}, {"by": "e1g", "id": 30197085, "parent": 30196785, "text": "Absolutely. @Swizec: ask your immigration lawyers if they&#x27;re OK with this post being online and linked to both of you. If they are, you need new lawyers.", "time": 1643915100, "type": "comment"}, {"by": "sudosysgen", "id": 30197086, "parent": 30196898, "text": "Offensive counterintelligence is not the same as catching a spy and hacking them.<p>Offensive counterintelligence involves manipulation or long-term disruption of adversaries. Hacking someone&#x27;s phone doesn&#x27;t qualify, that&#x27;s just normal defensive counterintelligence.<p>&gt;We don&#x27;t disappear people under diplomatic cover, we PNG them just like everyone else does.<p>Sure.<p>&gt;nd when we do catch foreign agents without diplomatic cover, we imprison them. Why kill a useful asset that could be traded for someone on our team?<p>We both know that&#x27;s not true. When it&#x27;s more useful to trade them, that&#x27;s done. When you want to send another signal, the US is not shy at all about killing them.", "time": 1643915102, "type": "comment"}, {"by": "Frost1x", "id": 30197087, "parent": 30196545, "text": "I went down this entire train of thought after opening the article  and decided on &quot;The Hidden Costs of [Shipment] Containerization.&quot; This I think clarified overload on  &quot;shipping&quot;, &quot;ship&quot;, &quot;containers&quot; and &quot;containization.&quot; At least until next week when Docker decides to offer a new deployment option&#x2F;format&#x2F;interface it calls a &quot;Shipment&quot; or some nonsense.<p>I&#x27;m sure the people knowledgable of physical shipping containers and infrastructure really weren&#x27;t that concerned or perhaps even aware how overloaded the term is in tech, nor did they know they&#x27;d land on the front page of a highly trafficked tech site. I don&#x27;t know the policy on editorialized headlines here but I know people seem to get up in arms about it, which I understand, but here&#x27;s a case where a nice insert makes sense.", "time": 1643915109, "type": "comment"}, {"by": "mbrevoort", "id": 30197088, "parent": 30195967, "text": "Using 400A consistently would be insane. Building the capacity to support 400A but using much, much less on average is... prudent, especially when building a house that is remote.", "time": 1643915111, "type": "comment"}, {"by": "tracyhenry", "id": 30197089, "parent": 30195191, "text": "Hey congrats on the launch! This is definitely a useful concept.<p>I haven&#x27;t dug deep, but is code reviews possible? A big point of the whole data-as-code movement is to enable easier review of the data generation process, make abstractions and versioning. Being able to generate pipelines from Jupyter notebooks sounds exciting in theory, but I&#x27;d imagine code reviewing the generated pipelines can be a pain.", "time": 1643915111, "type": "comment"}, {"by": "DrPhish", "id": 30197090, "parent": 30195633, "text": "True. For comparison, I have a 60s era 1000sqft house in northern Canada that had a 60A service into a 50A breaker panel up until last year. For insurance, safety and maintenance reasons[0] we upgraded to a 200A service, but for a small house and a 3-4 person family 50A is sufficient provided your hot water heater is natural gas.<p>[0]: The incoming line was aerial and over the legal span length, so it had been attached to an insulator nailed to a tree halfway between the house and mast. Also the mast was deteriorating to the point that it needed to be replaced anyways and insurance was making noise about not allowing a new policy if it wasn&#x27;t upgraded to at least 120A. We did a customer pole and went underground to the house. Much nicer aesthetics and I can now turn off a breaker on my side of the meter at the pole to do maintenance.", "time": 1643915112, "type": "comment"}, {"by": "CrankyBear", "descendants": 0, "id": 30197091, "score": 1, "time": 1643915113, "title": "The NSA spies shaping the future", "type": "story", "url": "https://www.technologyreview.com/2022/02/01/1044561/meet-the-nsa-spies-shaping-the-future/"}, {"by": "vonseel", "id": 30197092, "parent": 30197008, "text": "Yeah, it blew my mind that having a pool was so important to someone in a cold place like Canada. We have a pool in Texas and while it was installed with propane heating 30 years ago, the heating has really never been used as it’s not efficient to do so. I can’t imagine how much it would cost to heat a pool in the author’s climate.", "time": 1643915114, "type": "comment"}, {"by": "krasi0", "id": 30197093, "parent": 30169527, "text": "I am surprised that there have been no responses to your question as this would be like the holly grail for people interested in privacy oriented and robust peer to peer messaging.\nI wouldn&#x27;t be able to add much know how to the technical aspects unfortunately.", "time": 1643915116, "type": "comment"}, {"by": "zepto", "id": 30197094, "parent": 30194178, "text": "Apple is a dividend paying stock.", "time": 1643915120, "type": "comment"}, {"by": "nopenopenopeno", "id": 30197095, "parent": 30195913, "text": "But that wouldn’t support their argument that FB is failing to keep up with the times.<p>I think it matters largely because I don’t believe that most people just want content.  Everyone I speak with who uses FB on a daily basis has made the decision to excuse the habit purely because they are interested in keeping in touch with people. But by excusing that habit, they end up mostly consuming content because that’s what the feed gives them.<p>I left FB the day their “timeline” stopped supporting chronological sort.", "time": 1643915130, "type": "comment"}, {"by": "seemaze", "id": 30197096, "parent": 30193236, "text": "I am consistently impressed by the publication quality at Quanta Magazine. Their articles are a joy to read for an audience of any background. I also enjoy Aeon[0] and Psyche[1]. Can anyone recommend publishers of similar quality in other domains?<p>[0] <a href=\"https:&#x2F;&#x2F;aeon.co\" rel=\"nofollow\">https:&#x2F;&#x2F;aeon.co</a><p>[1] <a href=\"https:&#x2F;&#x2F;psyche.co&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;psyche.co&#x2F;</a>", "time": 1643915136, "type": "comment"}, {"by": "Justsignedup", "id": 30197097, "parent": 30194868, "text": "just for context:<p>- star citizen roadmap used to be: &quot;improved fps, 3 new ships, new inventory system&quot;<p>- star citizen roadmap became: &quot;these 50 things are being worked on&quot;<p>- star citizen roadmap is now: &quot;improved fps, 3 new ships, new inventory system&quot;<p>The reality is that literally ZERO features of star citizen have been delivered on time. Everything that is announced might as well add 3 years to.<p>AND THE BEST PART: They can&#x27;t stop raising record breaking profits. Last year alone was 80MM USD, and that&#x27;s I believe 10MM more than previous year.", "time": 1643915137, "type": "comment"}, {"by": "ibobev", "dead": true, "id": 30197098, "score": 1, "time": 1643915140, "type": "story"}, {"by": "slg", "id": 30197099, "parent": 30196819, "text": "They aren&#x27;t doing this because it is the morally right thing to do.  They are doing it because they feel that the $320m is important to secure the value of their business, the ETH ecosystem, and crypto in general.<p>My personal interpretation of that, there are a lot of awfully rich people who are scared of the bubble popping.", "time": 1643915145, "type": "comment"}, {"by": "paxys", "id": 30197100, "parent": 30196866, "text": "You absolutely can not. There are no GPS trackers for &lt;$30 with an ~unlimited battery life and no subscription fees.", "time": 1643915146, "type": "comment"}, {"by": "metacritic12", "id": 30197101, "parent": 30183745, "text": "When I first opened the site, I wondered if it was a more technical&#x2F;wonkish dive, or whether it was a political take.  Looking at the root site prospect.org made it clear it&#x27;s the latter.  Don&#x27;t get me wrong, their thesis can still be right, but this is like reading about &quot;is free trade good&quot; in the Economist.", "time": 1643915147, "type": "comment"}, {"by": "pajko", "id": 30197102, "parent": 30196990, "text": "It&#x27;s what exploded in Beirut: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=MEpFyE_ED7M\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=MEpFyE_ED7M</a>", "time": 1643915154, "type": "comment"}, {"by": "Aqueous", "id": 30197103, "parent": 30114909, "text": "It&#x27;s a platform for managing a kind of appointment, but it doesn&#x27;t have an appointments table. The appointments data is combined with a different table, and there was no way to disentangle them easily because the entire system was built around that object model. Case study in failure to normalize.<p>The hard part is done, but basically we had to switch the engine while the car was running so to speak. In order to switch this out you need to start writing the correct data shape, then switch everything over to reading that shape. When people work strict 9 to 5s this will take you <i>forever</i> especially when managing a large amount of volume, which requires you to be extremely risk-averse and slow.", "time": 1643915161, "type": "comment"}, {"by": "moby_click", "id": 30197104, "parent": 30196487, "text": "&gt; harvesting honey which has fallen off a honeycomb beneath a tree<p>I never had this opportunity, but I don&#x27;t see an ethical problem here. As a more realistic example (in my environment), I suggest dumpster diving. I think it would be okay, ethically, but I would not do it because it grosses me out in a way that vegan substitutes don&#x27;t, and that feeling is not related to the dumpster part.<p>I may have to do some more introspection, but I honestly don&#x27;t think, that my acceptance of vegan substitutes is based on a desire to harm animals.", "time": 1643915168, "type": "comment"}, {"by": "bee_rider", "id": 30197105, "parent": 30189678, "text": "So is Vim just run in one of VSCode&#x27;s terminals?<p>What&#x27;s VSCode providing here compared to something like a terminal with tmux?", "time": 1643915170, "type": "comment"}, {"by": "wmf", "id": 30197106, "parent": 30196879, "text": "I was wondering how a bridge could hope to earn back $300M in fees in any reasonable horizon, but if we view Wormhole as a loss leader to pump the overall Solana ecosystem (which I guess Jump is invested in) it makes sense.", "time": 1643915178, "type": "comment"}, {"by": "parasense", "id": 30197107, "parent": 30075637, "text": "That&#x27;s fine, actually.<p>Why would anybody have an expectation of privacy from aerial vehicles far above?", "time": 1643915179, "type": "comment"}, {"by": "dang", "id": 30197108, "parent": 30193350, "text": "Please don&#x27;t post this sort of flamewar comment to HN, regardless of what your views are or how right you feel they are.<p><a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;newsguidelines.html\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;newsguidelines.html</a>", "time": 1643915183, "type": "comment"}, {"by": "throwaway2048", "id": 30197109, "parent": 30196861, "text": "Not everyone has an iOS device, or bluetooth&#x2F;wifi enabled even if they do.", "time": 1643915187, "type": "comment"}, {"by": "moasda", "id": 30197110, "parent": 30195529, "text": "I have never understood why companies spend so much effort to maintain two themes in their web apps or mobile apps. At least for developers I finally found a good explanation:<p>Why do developers prefer the dark theme?\nBecause the light attracts bugs.", "time": 1643915188, "type": "comment"}, {"by": "scarface74", "id": 30197111, "parent": 30196644, "text": "Would you trust Apple to patch security fixes and distribute it as soon as they know or a random third party developer?", "time": 1643915188, "type": "comment"}, {"by": "adamcharnock", "id": 30197112, "parent": 30196873, "text": "I&#x27;m in Central Portugal. It is the Gardunha region (known for its cherry growing). Between Fundao, Castelo Branco, and Penamacor.<p>I don&#x27;t think property tax is a big deal. Bureaucracy is a PITA, but accountants, lawyers, and architects are cheap. Use them and it&#x27;ll all be easier, and likely cheaper in the long run.<p>Construction costs are going up around here. The price I heard 4 years ago was €500-€750&#x2F;m2 of house construction minimum.<p>Land should cost around €1&#x2F;m2, although it will be more if it has a habitable house or is being sold as &#x27;you can build a house here&#x27; plot. I got planning permission (via an architect) to build a 300m2 house on an agricultural-only plot of land, although I didn&#x27;t go through with it. Rules vary by region, but around here you can fairly easily get planning permission if you own more than 2ha of land.<p>Get in touch if you want to talk more! Email is on my website. (asking questions here is also great)", "time": 1643915192, "type": "comment"}, {"deleted": true, "id": 30197113, "parent": 30196680, "time": 1643915193, "type": "comment"}, {"by": "david927", "id": 30197114, "parent": 30195342, "text": "There&#x27;s  a reason I&#x27;ve been following the story.  There is nothing new about hedge funds naked shorting (essentially counterfitting) shares, and nothing new in the SEC&#x27;s refusal to do anything about it.<p>What&#x27;s new here is that this is the first time in history that retail has simply used collective buying power to catch them out at it.  By simply en masse buying and holding directly registered shares, it puts them over a barrel.<p>The statements that it&#x27;s war or what could happen aren&#x27;t hyperbole -- and I find that fascinating.  We&#x27;ll see...", "time": 1643915195, "type": "comment"}, {"by": "jcrawfordor", "id": 30197115, "parent": 30196866, "text": "GPS trackers anywhere near the size and cost of the AirTag are going to have a battery life of a few days at best. You can get into multi-year battery lives on cellular GPS trackers but you&#x27;re going to need large batteries and aggressive use of deep-sleep mode, e.g. check-in only once per day.", "time": 1643915201, "type": "comment"}, {"by": "paulluuk", "id": 30197116, "parent": 30196414, "text": "I really like the basic concepts of Astrox Imperium, but the fact that almost the entire game revolves around getting from station to station in a desperate attempt not to run out of air was a big turndown for me.<p>It eventually made the game unplayable for me, as I found myself in a savegame where no matter which direction I went, there simply wasn&#x27;t a single station closeby enough that provided air, so I was essentially stuck and had to start a new campaign.", "time": 1643915204, "type": "comment"}, {"by": "Tostino", "id": 30197117, "parent": 30196178, "text": "It&#x27;s higher than hundreds. I had 150+ player raids on a private L2 server I hosted back in the day on an Athlon X2 with 4gb of ram. I had 50 player raids when that server was hosted on a spare P3 800mhz 512mb ram box I had in the closet.<p>This was not efficient software, l2j had so many issues I recognize now that I&#x27;ve worked a decade in the software industry, but it worked!", "time": 1643915206, "type": "comment"}, {"by": "semioticthrowa", "id": 30197118, "parent": 30197005, "text": "It&#x27;s a common explosive. It&#x27;s not a biological weapon - Wikipedia states that it has a similar median lethal dose to table salt[0]<p>[0] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Ammonium_nitrate#Health_hazards\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Ammonium_nitrate#Health_hazard...</a>", "time": 1643915208, "type": "comment"}, {"by": "jeffbee", "id": 30197119, "parent": 30194375, "text": "The post says they own a duplex in Vancouver, the most expensive housing market on Earth. This is where your rents are going if you are a family renting a flat in Vancouver for $4500&#x2F;month: for these people to pave over some remaining BC forests.", "time": 1643915211, "type": "comment"}, {"by": "rootusrootus", "id": 30197120, "parent": 30196861, "text": "&gt; Is this saying that Apple is relying on the unknown tag to announce itself by emitting a beep, and is that true?<p>Not by itself, no.  If you have an iPhone, you get notifications on your phone whether the AirTag ever beeps or not.", "time": 1643915211, "type": "comment"}, {"by": "buescher", "id": 30197121, "parent": 30194448, "text": "Pretty good.  Where would the Oracle Lite products go?", "time": 1643915225, "type": "comment"}, {"by": "Zak", "id": 30197122, "parent": 30196752, "text": "I don&#x27;t think Google is against sideloading since Android supports it by default.<p>I think Google is against being required to allow third-party app stores to have feature parity with its own, and against being required to allow third-party payments in apps purchased from the Play store. Those things would reduce Google&#x27;s revenue.", "time": 1643915229, "type": "comment"}, {"by": "H1Supreme", "id": 30197123, "parent": 30193677, "text": "&gt; However, social VR is also immensely useful for more introverted people, which more extroverted people might not realize. It is quite simply easier talking to people in VR than it is in real life.<p>I think you&#x27;re confusing introversion with social anxiety.", "time": 1643915233, "type": "comment"}, {"by": "jjbrigs", "descendants": 0, "id": 30197124, "score": 1, "text": "Hi all, I&#x27;m building a small web app using a bunch of no-code tools and would really like to know if I can generate a website via an API call. Is there any such service out there you have experience with? My search brought me no results except for an enterprise solution from a website builder called Duda.co but that is way out of budget.<p>The tool I&#x27;m creating is for a real estate agency. Users from the agency will login to the app and submit details about a house for sale. Using that information we go and make a WordPress website. I&#x27;m looking to automate this by passing the information the user submit via an API call to a website builder of some sort to instantly generate a website.<p>Any help in this would be hugely appreciated!", "time": 1643915235, "title": "Can you instantly generate a website with an API call?", "type": "story"}, {"by": "nexuist", "id": 30197125, "parent": 30196675, "text": "Is that fair? Why can&#x27;t you develop software for the hardware you purchased? How is that different from the argument against Apple&#x27;s App Store?<p>&gt; Those aren&#x27;t general-purpose devices<p>So if Apple sold an &quot;iPad Gaming Edition&quot; then none of this would matter?", "time": 1643915238, "type": "comment"}, {"by": "k__", "id": 30197126, "parent": 30196989, "text": "To be fair, Bitcoin proponents don&#x27;t even see this as critique, they say it&#x27;s by design and everything more efficient would jeopardize their goals, lol.", "time": 1643915241, "type": "comment"}, {"by": "joe5150", "id": 30197127, "parent": 30196487, "text": "&quot;harvesting honey which has fallen off a honeycomb beneath a tree&quot; so theft?", "time": 1643915243, "type": "comment"}, {"by": "kristijankej", "id": 30197128, "parent": 30197005, "text": "The price of living in eastern europe is rising. Natural gas prices have rissen quite a bit where I live and it&#x27;s disrupting the economy, prices of everything will rise in the upcoming months.\nI believe this is economical warfare.", "time": 1643915249, "type": "comment"}, {"by": "nelblu", "id": 30197129, "parent": 30195669, "text": "This! Too many rich people I know are very miserable people. Sometimes I wonder whether it is an effect of having too much wealth that makes one miserable. Personally, being a minimalist (naturally because of how I was raised), I also wonder sometimes how I should calculate as to when I would&#x2F;could retire.<p>Anyone has any links to do these calculators would be great. I can choose to retire in Canada, India or US if that matters.", "time": 1643915254, "type": "comment"}, {"by": "endisneigh", "id": 30197130, "parent": 30197036, "text": "The parent comment is talking about using mobile data and gps - not sure why you even brought up the tile.<p>Tile is inferior to an AirTag if you seriously want to stalk someone. The network is orders of magnitude smaller. Don’t know why anyone who owns an Apple device would bother with it at this point", "time": 1643915254, "type": "comment"}, {"by": "mmaunder", "id": 30197131, "parent": 30194306, "text": "Thanks for the explanation. How does this mechanism compare to how rituximab works? Thanks again!", "time": 1643915255, "type": "comment"}, {"by": "Spooky23", "id": 30197132, "parent": 30196816, "text": "They work great, it’s just the network effects are smaller for Samsung.<p>For people at risk, it is meaningless. Your crazy stalker will just drive around locations and confirm where you are remotely.<p>The whole controversy is both real and bullshit. It is very trivial for people to get tracking devices for modest amounts of money in high threat scenarios.<p>I think the issue with AirTags is the less malevolent, but creepy scenarios. And to be honest, the issue has existed for years with “Find My Friends”, which I’m sure is widely abused by family members and others to follow people around.", "time": 1643915259, "type": "comment"}, {"by": "steelstraw", "id": 30197133, "parent": 30196343, "text": "Vitalik actually warned about bridge risk a few weeks ago:<p>The fundamental security limits of bridges are actually a key reason why while I am optimistic about a multi-chain blockchain ecosystem (there really are a few separate communities with different values and it&#x27;s better for them to live separately than all fight over influence on the same thing), I am pessimistic about cross-chain applications.<p><a href=\"https:&#x2F;&#x2F;old.reddit.com&#x2F;r&#x2F;ethereum&#x2F;comments&#x2F;rwojtk&#x2F;ama_we_are_the_efs_research_team_pt_7_07_january&#x2F;hrngyk8&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;old.reddit.com&#x2F;r&#x2F;ethereum&#x2F;comments&#x2F;rwojtk&#x2F;ama_we_are...</a>", "time": 1643915260, "type": "comment"}, {"by": "athielking", "descendants": 0, "id": 30197134, "score": 1, "time": 1643915260, "title": "Google delivers Flutter support for Windows desktop apps", "type": "story", "url": "https://siliconangle.com/2022/02/03/google-delivers-flutter-support-windows-desktop-apps/"}, {"by": "Klonoar", "id": 30197135, "parent": 30196436, "text": "Surely you could link to the actual blog pose rather than a subreddit that regularly crosses the border into conspiracy theory territory.", "time": 1643915261, "type": "comment"}, {"by": "shlosky", "descendants": 0, "id": 30197136, "score": 1, "time": 1643915266, "title": "Show HN: A Penny – answer questions and earn “a penny for your thought”", "type": "story", "url": "https://a-penny.com/"}, {"by": "joering2", "descendants": 0, "id": 30197137, "score": 1, "time": 1643915266, "title": "Top analyst calculates Tesla true worth is $138 a share", "type": "story", "url": "https://fortune.com/2022/02/02/tsla-stock-valuation-predictions-2022/"}, {"by": "smm11", "id": 30197138, "parent": 30193469, "text": "Where I live, the only requirement in a semi truck is an area to store large volumes of meth.", "time": 1643915279, "type": "comment"}, {"by": "poulsbohemian", "id": 30197139, "parent": 30196782, "text": "I hear what you are saying, especially since we lack real quantitative data here and are speaking subjectively about how we perceive a decade+ of discussion... I&#x27;m sure you are right that there was always an undertone of young men trying to one-up each other with comments. My gut tells me though that if we go back in time, there were more actual experts commenting, who drowned out or downvoted the people just here to shit post. Maybe not though, as your experiences bear out.", "time": 1643915279, "type": "comment"}, {"by": "burkaman", "id": 30197140, "parent": 30195327, "text": "It just depends on your definition of &quot;solved&quot;. If solved means &quot;all consequences of anthropogenic climate change avoided&quot; then it&#x27;s obviously too late, there&#x27;s no solution other than time travel. If solved means &quot;humanity survives as a species&quot; then we&#x27;re in pretty good shape no matter what we do. For most people I think solved means &quot;we avoid the worst effects&quot;, which of course leads to another question about definitions.<p>Many people look at the graph in your citation and see it as a picture of success, because the baseline in their mind is RCP8.5. Note that the graph makes a comparison to RCP2.6, which is not a &quot;do nothing&quot; scenario, it&#x27;s a pretty optimistic and aspirational future.", "time": 1643915280, "type": "comment"}, {"by": "mdasen", "id": 30197141, "parent": 30193335, "text": "Some towns in the US have done this, but it isn&#x27;t without difficulties.<p>Just looking at a satellite map of Spain, I see La Langa. It seems like it has very few people, but they all live in a small town center. Looking at Uclés, it&#x27;s the same: tiny place, but everyone is living in the town center.<p>Let&#x27;s look at Potomac, MD in the US. The roads are sprawling with giant houses all far apart. That&#x27;s a lot more distance to run fiber to get it to each house. Potomac is a rich suburb of DC and has fine internet (it&#x27;s still dense enough for that), but the US keeps sprawling. Look at a satellite view of Pike Township, PA. There&#x27;s a lot of houses with huge distances in between and no discernible town center.<p>&gt; If you manage to use electric or telephone posts deploying fiber and getting a carrier is doable<p>I think this can also be an issue in the US since place might not have easy&#x2F;cheap access to those utility poles. Title II carriers in the US get cheap, regulated access to utility poles. That&#x27;s traditionally been your phone company. I believe the FCC tried reclassifying broadband as Title II under the Obama administration, but it might have been reversed under the Trump administration. If you&#x27;re someone that already has access to the utility poles, you don&#x27;t want more people getting cheap access to them.<p>Even if you have access to the utility poles, you can face difficulty. As noted, you aren&#x27;t wiring up a town center, you can be wiring up places with a huge amount of distance between people. Even if that isn&#x27;t a problem, property owners might want new cables buried. Even when power lines are above ground, sometimes they&#x27;re underground from the street to the house. Many houses might be set back from the street by 50 meters so it can be a larger distance. You can have a 300m road with 3 houses on it each with a 50m set back from the street.<p>That&#x27;s not to say it isn&#x27;t possible (and some towns have created coop ISPs), but costs add up. Uclés has 140 people in it, but everyone seems to live within a 250m radius of the city center. That seems pretty easy to wire up. Pike Township, PA has 1,700 people that are incredibly spread out. That seems a lot harder to wire up. It&#x27;s not impossible, but it seems harder.", "time": 1643915281, "type": "comment"}, {"deleted": true, "id": 30197142, "parent": 30192915, "time": 1643915282, "type": "comment"}, {"by": "CrankyBear", "descendants": 0, "id": 30197143, "score": 2, "time": 1643915286, "title": "Is NPM a Hotbed of Malware?", "type": "story", "url": "https://thenewstack.io/is-npm-a-hotbed-of-malware/"}, {"by": "quickthrowman", "id": 30197144, "parent": 30195701, "text": "US residential service is split phase 120&#x2F;240, commercial service is generally 120&#x2F;208v three-phase or 277&#x2F;480v three-phase.", "time": 1643915287, "type": "comment"}, {"by": "nomel", "id": 30197145, "parent": 30196825, "text": "If the thief has an iPhone, they&#x27;ll still be alerted that the tracker is following them. If they move their phone around on your bike, they&#x27;ll be able to find it, within several inches, with the NFC identification feature that gives the last four digits of the owners phone number.<p>Maybe apple campaign is working, or there&#x27;s some truth to it? <a href=\"https:&#x2F;&#x2F;www.theguardian.com&#x2F;technology&#x2F;2020&#x2F;feb&#x2F;26&#x2F;apple-does-not-let-bad-guys-use-iphones-on-screen\" rel=\"nofollow\">https:&#x2F;&#x2F;www.theguardian.com&#x2F;technology&#x2F;2020&#x2F;feb&#x2F;26&#x2F;apple-doe...</a>", "time": 1643915289, "type": "comment"}, {"by": "xdavidliu", "id": 30197146, "parent": 30196354, "text": "I misread your post in exactly the same way and thought the joke was made by a journalist.", "time": 1643915290, "type": "comment"}, {"by": "dboreham", "id": 30197147, "parent": 30196977, "text": "That&#x27;s not actually a thing though. There are people&#x2F;entities with large ETH holdings who could well be motivated to foot this loss, but they can&#x27;t just magic (real) money out of thin air.", "time": 1643915293, "type": "comment"}, {"by": "ravar", "id": 30197148, "parent": 30195955, "text": "I know with some bacteria (which I work with for evolutionary biology) they can intentionally mutate at higher rates when under stress.", "time": 1643915294, "type": "comment"}, {"by": "wonderwonder", "id": 30197149, "parent": 30196343, "text": "Could this hack have allowed for the printing of eth on solana that did not actually exist on the eth blockchain or was it limited to real eth that had been bridged to solana?", "time": 1643915307, "type": "comment"}, {"by": "bick_nyers", "id": 30197150, "parent": 30194101, "text": "What if I just didn&#x27;t pay my bill and the utility company disconnected me from the power grid? Would I be subject to fines and jail time? Absurd, but hey, that sure sounds like Florida.", "time": 1643915308, "type": "comment"}, {"by": "RC_ITR", "id": 30197151, "parent": 30192619, "text": "Well, it was always kind of doomed in this way.<p>When everyone is still actively building their friend list (remember this started for college students) its an amazing product because it brings you closer to people in a new way and allows for curation without investing a ton into AI&#x2F;ML.<p>For people who stay in a static social bubbles for long times (e.g., your parents, your friends from HS who didn&#x27;t move to a coastal city) it&#x27;s also perfect, because they tend to value content related to their social group more than something new and interesting.<p>But for the highest value users (e.g., the ones with high-paying knowledge-based jobs and a willingness to try new things) the social graph will never keep up with their lives.  Bad content from the edges of the graph will slowly creep into feeds (MLMs being a prime example) and those high-value users will seek out new platforms that conform better to their interests.<p>Instagram was a brilliant stop-gap, but Mark never saw the writing on the wall about algorithmic content (probably b&#x2F;s Bytedance had the advantage of cutting its teeth in China first) and is just too far behind to ever really catch up.<p>So now he&#x27;s trying to out-future Bytedance with VR (and even got them to burn $1bn on Pico), but unless he has some hard-tech rabbit to pull out of his hat, there&#x27;s just not anything there.<p>We may very well be seeing the largest (negative) turn-around story in history since Yahoo! play out in front of our eyes.", "time": 1643915310, "type": "comment"}, {"by": "rlt", "id": 30197152, "parent": 30196819, "text": "If that’s the case “restored” is an interesting way to put it.", "time": 1643915315, "type": "comment"}, {"by": "mmaunder", "id": 30197153, "parent": 30196613, "text": "That’s awesome! Best of luck!!", "time": 1643915316, "type": "comment"}, {"by": "aaomidi", "id": 30197154, "parent": 30196914, "text": "With more power, comes more responsibility.<p>Apple is going to always be under the magnifying glass because they are just so much &quot;bigger&quot;.", "time": 1643915319, "type": "comment"}, {"by": "bryanlarsen", "id": 30197155, "parent": 30193752, "text": "But there are no 100W ones.", "time": 1643915319, "type": "comment"}, {"by": "hoerzu", "id": 30197156, "parent": 30195191, "text": "Really helpful keeping notebooks tidy :)", "time": 1643915326, "type": "comment"}, {"by": "scarface74", "id": 30197157, "parent": 30196318, "text": "Fair enough.  But you do notice that newspapers are still the most popular way for CPG goods like P&amp;G to advertise where they don’t have to target or track.", "time": 1643915334, "type": "comment"}, {"by": "Coding_Cat", "id": 30197158, "parent": 30196289, "text": "I took a brief look at it and saw nothing to suggest that &#x27;web3&#x27; added anything of real value.<p>If you believe there is, then I&#x27;d love to hear what it adds that&#x27;s 1. unique and 2. actually desirable.", "time": 1643915336, "type": "comment"}, {"by": "jws", "id": 30197159, "parent": 30193826, "text": "ATT&#x27;s product along this line was a complete failure for me. I didn&#x27;t have a street address at the fixed (albeit remote) location, and there were no street addresses I could pretend to have within its tolerable radius. They had no way of enabling the device without it being near a street address.<p>The technology would have worked just fine, they just couldn&#x27;t fill in their E911 entry with anything that would work.", "time": 1643915337, "type": "comment"}, {"by": "BenjiWiebe", "id": 30197160, "parent": 30196022, "text": "It&#x27;s also the friction of everything turning. And you&#x27;ve still got your alternator, oil pump, water pump, fan etc that are removing energy.", "time": 1643915339, "type": "comment"}, {"by": "parsd", "id": 30197161, "parent": 30189202, "text": "There is nothing facetious or self-flattering here, these things aren&#x27;t achievements, rather reactions to dependence on some massive facets of modern life, which, as it turns out, are not critical or even necessary.", "time": 1643915351, "type": "comment"}, {"by": "aerostable_slug", "id": 30197162, "parent": 30196700, "text": "Hell, DLI teaches Hebrew (once euphemized as &quot;special Arabic&quot; in some settings) [0]. That&#x27;s not just for exchange&#x2F;liaison officers... Not to dig up that bucket of worms, but there were Hebrew linguists aboard the USS Liberty.<p>[0] <a href=\"https:&#x2F;&#x2F;www.dliflc.edu&#x2F;about&#x2F;languages-at-dliflc&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.dliflc.edu&#x2F;about&#x2F;languages-at-dliflc&#x2F;</a>", "time": 1643915354, "type": "comment"}, {"by": "toovs", "id": 30197163, "parent": 30196748, "text": "Did you even read the above post whatsoever? If all you have are spaceship jpegs, I&#x27;m not sure what game you&#x27;re playing but it isn&#x27;t star citizen.", "time": 1643915360, "type": "comment"}, {"by": "panzagl", "id": 30197164, "parent": 30196549, "text": "Collective bargaining involves two parties, one representing the &#x27;collective&#x27;.  App stores are more at-will: &#x27;my way or the highway&#x27;.", "time": 1643915362, "type": "comment"}, {"by": "Spooky23", "id": 30197165, "parent": 30197010, "text": "&gt; What Apple created would be Facebooks, NSAs and pretty much every spying entities wet dream to get fingers on.<p>No, Apple made it available to you. Police and intelligence agencies can buy this data from various entities or subpoena it.", "time": 1643915366, "type": "comment"}, {"by": "willcipriano", "id": 30197166, "parent": 30196928, "text": "This is a place for a generic open protocol. To have a real internet of things we need some kind of DNS but for objects.", "time": 1643915370, "type": "comment"}, {"by": "brimble", "id": 30197167, "parent": 30195813, "text": "This definitely wasn&#x27;t intended as a &quot;medieval kings had it great by modern standards&quot; call to return to the past, but rather to emphasize just <i>how much</i> world-class, hyper-stimulative entertainment we have available, dirt-cheap and on tap, every hour of the day. Even TV stations used to shut down for the night. The shift started with electrification &amp; recording technology, but entered a whole new phase only quite recently. When you put what we have in terms of what our everyday entertainment options would have looked like in a pre-industrial society, it emphasizes just how <i>large</i> a difference there is.<p>If anything, this is closer to a &quot;Gods of the Copybook Headings&quot; argument. &quot;Too much of a good thing...&quot; may be cliché and something only old fogeys say... but what if <i>we&#x27;re</i> the ones making an error, in rolling our eyes at them? What if, not even that long ago, that was a bit silly applied to this particular thing (entertainment and nighttime lighting, chiefly) but no longer is?<p>I don&#x27;t expect this problem to actually be fixed, but I do find all the casting about for &quot;why do <i>so many</i> people have trouble sleeping, these days?&quot; risible in light of what sure looks like the most obvious explanation, which never gets more than a personal-responsibility treatment (&quot;put the phone in another room&quot;) which seems like a bad joke when you apply the medieval-king thought experiment. &quot;Maybe the king should just not leave the bedroom, then?&quot; LOL.", "time": 1643915373, "type": "comment"}, {"by": "Sohcahtoa82", "id": 30197168, "parent": 30189145, "text": "It takes an extreme level of hubris to ever think your code covers all edge cases and potential exploits.", "time": 1643915373, "type": "comment"}, {"by": "brailsafe", "id": 30197169, "parent": 30196353, "text": "People have been doing this for the last 18 years with World of Warcraft since it&#x27;s release.", "time": 1643915382, "type": "comment"}][{"by": "Justsignedup", "id": 30197097, "parent": 30194868, "text": "just for context:<p>- star citizen roadmap used to be: &quot;improved fps, 3 new ships, new inventory system&quot;<p>- star citizen roadmap became: &quot;these 50 things are being worked on&quot;<p>- star citizen roadmap is now: &quot;improved fps, 3 new ships, new inventory system&quot;<p>The reality is that literally ZERO features of star citizen have been delivered on time. Everything that is announced might as well add 3 years to.<p>AND THE BEST PART: They can&#x27;t stop raising record breaking profits. Last year alone was 80MM USD, and that&#x27;s I believe 10MM more than previous year.", "time": 1643915137, "type": "comment"}, {"by": "ibobev", "dead": true, "id": 30197098, "score": 1, "time": 1643915140, "type": "story"}, {"by": "slg", "id": 30197099, "parent": 30196819, "text": "They aren&#x27;t doing this because it is the morally right thing to do.  They are doing it because they feel that the $320m is important to secure the value of their business, the ETH ecosystem, and crypto in general.<p>My personal interpretation of that, there are a lot of awfully rich people who are scared of the bubble popping.", "time": 1643915145, "type": "comment"}, {"by": "paxys", "id": 30197100, "parent": 30196866, "text": "You absolutely can not. There are no GPS trackers for &lt;$30 with an ~unlimited battery life and no subscription fees.", "time": 1643915146, "type": "comment"}, {"by": "metacritic12", "id": 30197101, "parent": 30183745, "text": "When I first opened the site, I wondered if it was a more technical&#x2F;wonkish dive, or whether it was a political take.  Looking at the root site prospect.org made it clear it&#x27;s the latter.  Don&#x27;t get me wrong, their thesis can still be right, but this is like reading about &quot;is free trade good&quot; in the Economist.", "time": 1643915147, "type": "comment"}, {"by": "pajko", "id": 30197102, "parent": 30196990, "text": "It&#x27;s what exploded in Beirut: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=MEpFyE_ED7M\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=MEpFyE_ED7M</a>", "time": 1643915154, "type": "comment"}, {"by": "Aqueous", "id": 30197103, "parent": 30114909, "text": "It&#x27;s a platform for managing a kind of appointment, but it doesn&#x27;t have an appointments table. The appointments data is combined with a different table, and there was no way to disentangle them easily because the entire system was built around that object model. Case study in failure to normalize.<p>The hard part is done, but basically we had to switch the engine while the car was running so to speak. In order to switch this out you need to start writing the correct data shape, then switch everything over to reading that shape. When people work strict 9 to 5s this will take you <i>forever</i> especially when managing a large amount of volume, which requires you to be extremely risk-averse and slow.", "time": 1643915161, "type": "comment"}, {"by": "moby_click", "id": 30197104, "parent": 30196487, "text": "&gt; harvesting honey which has fallen off a honeycomb beneath a tree<p>I never had this opportunity, but I don&#x27;t see an ethical problem here. As a more realistic example (in my environment), I suggest dumpster diving. I think it would be okay, ethically, but I would not do it because it grosses me out in a way that vegan substitutes don&#x27;t, and that feeling is not related to the dumpster part.<p>I may have to do some more introspection, but I honestly don&#x27;t think, that my acceptance of vegan substitutes is based on a desire to harm animals.", "time": 1643915168, "type": "comment"}, {"by": "bee_rider", "id": 30197105, "parent": 30189678, "text": "So is Vim just run in one of VSCode&#x27;s terminals?<p>What&#x27;s VSCode providing here compared to something like a terminal with tmux?", "time": 1643915170, "type": "comment"}, {"by": "wmf", "id": 30197106, "parent": 30196879, "text": "I was wondering how a bridge could hope to earn back $300M in fees in any reasonable horizon, but if we view Wormhole as a loss leader to pump the overall Solana ecosystem (which I guess Jump is invested in) it makes sense.", "time": 1643915178, "type": "comment"}, {"by": "parasense", "id": 30197107, "parent": 30075637, "text": "That&#x27;s fine, actually.<p>Why would anybody have an expectation of privacy from aerial vehicles far above?", "time": 1643915179, "type": "comment"}, {"by": "dang", "id": 30197108, "parent": 30193350, "text": "Please don&#x27;t post this sort of flamewar comment to HN, regardless of what your views are or how right you feel they are.<p><a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;newsguidelines.html\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;newsguidelines.html</a>", "time": 1643915183, "type": "comment"}, {"by": "throwaway2048", "id": 30197109, "parent": 30196861, "text": "Not everyone has an iOS device, or bluetooth&#x2F;wifi enabled even if they do.", "time": 1643915187, "type": "comment"}, {"by": "moasda", "id": 30197110, "parent": 30195529, "text": "I have never understood why companies spend so much effort to maintain two themes in their web apps or mobile apps. At least for developers I finally found a good explanation:<p>Why do developers prefer the dark theme?\nBecause the light attracts bugs.", "time": 1643915188, "type": "comment"}, {"by": "scarface74", "id": 30197111, "parent": 30196644, "text": "Would you trust Apple to patch security fixes and distribute it as soon as they know or a random third party developer?", "time": 1643915188, "type": "comment"}, {"by": "adamcharnock", "id": 30197112, "parent": 30196873, "text": "I&#x27;m in Central Portugal. It is the Gardunha region (known for its cherry growing). Between Fundao, Castelo Branco, and Penamacor.<p>I don&#x27;t think property tax is a big deal. Bureaucracy is a PITA, but accountants, lawyers, and architects are cheap. Use them and it&#x27;ll all be easier, and likely cheaper in the long run.<p>Construction costs are going up around here. The price I heard 4 years ago was €500-€750&#x2F;m2 of house construction minimum.<p>Land should cost around €1&#x2F;m2, although it will be more if it has a habitable house or is being sold as &#x27;you can build a house here&#x27; plot. I got planning permission (via an architect) to build a 300m2 house on an agricultural-only plot of land, although I didn&#x27;t go through with it. Rules vary by region, but around here you can fairly easily get planning permission if you own more than 2ha of land.<p>Get in touch if you want to talk more! Email is on my website. (asking questions here is also great)", "time": 1643915192, "type": "comment"}, {"deleted": true, "id": 30197113, "parent": 30196680, "time": 1643915193, "type": "comment"}, {"by": "david927", "id": 30197114, "parent": 30195342, "text": "There&#x27;s  a reason I&#x27;ve been following the story.  There is nothing new about hedge funds naked shorting (essentially counterfitting) shares, and nothing new in the SEC&#x27;s refusal to do anything about it.<p>What&#x27;s new here is that this is the first time in history that retail has simply used collective buying power to catch them out at it.  By simply en masse buying and holding directly registered shares, it puts them over a barrel.<p>The statements that it&#x27;s war or what could happen aren&#x27;t hyperbole -- and I find that fascinating.  We&#x27;ll see...", "time": 1643915195, "type": "comment"}, {"by": "jcrawfordor", "id": 30197115, "parent": 30196866, "text": "GPS trackers anywhere near the size and cost of the AirTag are going to have a battery life of a few days at best. You can get into multi-year battery lives on cellular GPS trackers but you&#x27;re going to need large batteries and aggressive use of deep-sleep mode, e.g. check-in only once per day.", "time": 1643915201, "type": "comment"}, {"by": "paulluuk", "id": 30197116, "kids": [30197186], "parent": 30196414, "text": "I really like the basic concepts of Astrox Imperium, but the fact that almost the entire game revolves around getting from station to station in a desperate attempt not to run out of air was a big turndown for me.<p>It eventually made the game unplayable for me, as I found myself in a savegame where no matter which direction I went, there simply wasn&#x27;t a single station closeby enough that provided air, so I was essentially stuck and had to start a new campaign.", "time": 1643915204, "type": "comment"}, {"by": "Tostino", "id": 30197117, "parent": 30196178, "text": "It&#x27;s higher than hundreds. I had 150+ player raids on a private L2 server I hosted back in the day on an Athlon X2 with 4gb of ram. I had 50 player raids when that server was hosted on a spare P3 800mhz 512mb ram box I had in the closet.<p>This was not efficient software, l2j had so many issues I recognize now that I&#x27;ve worked a decade in the software industry, but it worked!", "time": 1643915206, "type": "comment"}, {"by": "semioticthrowa", "id": 30197118, "parent": 30197005, "text": "It&#x27;s a common explosive. It&#x27;s not a biological weapon - Wikipedia states that it has a similar median lethal dose to table salt[0]<p>[0] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Ammonium_nitrate#Health_hazards\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Ammonium_nitrate#Health_hazard...</a>", "time": 1643915208, "type": "comment"}, {"by": "jeffbee", "id": 30197119, "parent": 30194375, "text": "The post says they own a duplex in Vancouver, the most expensive housing market on Earth. This is where your rents are going if you are a family renting a flat in Vancouver for $4500&#x2F;month: for these people to pave over some remaining BC forests.", "time": 1643915211, "type": "comment"}, {"by": "rootusrootus", "id": 30197120, "parent": 30196861, "text": "&gt; Is this saying that Apple is relying on the unknown tag to announce itself by emitting a beep, and is that true?<p>Not by itself, no.  If you have an iPhone, you get notifications on your phone whether the AirTag ever beeps or not.", "time": 1643915211, "type": "comment"}, {"by": "buescher", "id": 30197121, "parent": 30194448, "text": "Pretty good.  Where would the Oracle Lite products go?", "time": 1643915225, "type": "comment"}, {"by": "Zak", "id": 30197122, "parent": 30196752, "text": "I don&#x27;t think Google is against sideloading since Android supports it by default.<p>I think Google is against being required to allow third-party app stores to have feature parity with its own, and against being required to allow third-party payments in apps purchased from the Play store. Those things would reduce Google&#x27;s revenue.", "time": 1643915229, "type": "comment"}, {"by": "H1Supreme", "id": 30197123, "parent": 30193677, "text": "&gt; However, social VR is also immensely useful for more introverted people, which more extroverted people might not realize. It is quite simply easier talking to people in VR than it is in real life.<p>I think you&#x27;re confusing introversion with social anxiety.", "time": 1643915233, "type": "comment"}, {"by": "jjbrigs", "descendants": 0, "id": 30197124, "score": 1, "text": "Hi all, I&#x27;m building a small web app using a bunch of no-code tools and would really like to know if I can generate a website via an API call. Is there any such service out there you have experience with? My search brought me no results except for an enterprise solution from a website builder called Duda.co but that is way out of budget.<p>The tool I&#x27;m creating is for a real estate agency. Users from the agency will login to the app and submit details about a house for sale. Using that information we go and make a WordPress website. I&#x27;m looking to automate this by passing the information the user submit via an API call to a website builder of some sort to instantly generate a website.<p>Any help in this would be hugely appreciated!", "time": 1643915235, "title": "Can you instantly generate a website with an API call?", "type": "story"}, {"by": "nexuist", "id": 30197125, "parent": 30196675, "text": "Is that fair? Why can&#x27;t you develop software for the hardware you purchased? How is that different from the argument against Apple&#x27;s App Store?<p>&gt; Those aren&#x27;t general-purpose devices<p>So if Apple sold an &quot;iPad Gaming Edition&quot; then none of this would matter?", "time": 1643915238, "type": "comment"}, {"by": "k__", "id": 30197126, "parent": 30196989, "text": "To be fair, Bitcoin proponents don&#x27;t even see this as critique, they say it&#x27;s by design and everything more efficient would jeopardize their goals, lol.", "time": 1643915241, "type": "comment"}, {"by": "joe5150", "id": 30197127, "parent": 30196487, "text": "&quot;harvesting honey which has fallen off a honeycomb beneath a tree&quot; so theft?", "time": 1643915243, "type": "comment"}, {"by": "kristijankej", "id": 30197128, "parent": 30197005, "text": "The price of living in eastern europe is rising. Natural gas prices have rissen quite a bit where I live and it&#x27;s disrupting the economy, prices of everything will rise in the upcoming months.\nI believe this is economical warfare.", "time": 1643915249, "type": "comment"}, {"by": "nelblu", "id": 30197129, "parent": 30195669, "text": "This! Too many rich people I know are very miserable people. Sometimes I wonder whether it is an effect of having too much wealth that makes one miserable. Personally, being a minimalist (naturally because of how I was raised), I also wonder sometimes how I should calculate as to when I would&#x2F;could retire.<p>Anyone has any links to do these calculators would be great. I can choose to retire in Canada, India or US if that matters.", "time": 1643915254, "type": "comment"}, {"by": "endisneigh", "id": 30197130, "parent": 30197036, "text": "The parent comment is talking about using mobile data and gps - not sure why you even brought up the tile.<p>Tile is inferior to an AirTag if you seriously want to stalk someone. The network is orders of magnitude smaller. Don’t know why anyone who owns an Apple device would bother with it at this point", "time": 1643915254, "type": "comment"}, {"by": "mmaunder", "id": 30197131, "parent": 30194306, "text": "Thanks for the explanation. How does this mechanism compare to how rituximab works? Thanks again!", "time": 1643915255, "type": "comment"}, {"by": "Spooky23", "id": 30197132, "parent": 30196816, "text": "They work great, it’s just the network effects are smaller for Samsung.<p>For people at risk, it is meaningless. Your crazy stalker will just drive around locations and confirm where you are remotely.<p>The whole controversy is both real and bullshit. It is very trivial for people to get tracking devices for modest amounts of money in high threat scenarios.<p>I think the issue with AirTags is the less malevolent, but creepy scenarios. And to be honest, the issue has existed for years with “Find My Friends”, which I’m sure is widely abused by family members and others to follow people around.", "time": 1643915259, "type": "comment"}, {"by": "steelstraw", "id": 30197133, "parent": 30196343, "text": "Vitalik actually warned about cross-chain bridge risk a few weeks ago:<p>My argument for why the future will be <i>multi-chain</i>, but it will not be <i>cross-chain</i>: there are fundamental limits to the security of bridges that hop across multiple &quot;zones of sovereignty&quot;.<p><a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;vitalikbuterin&#x2F;status&#x2F;1479501366192132099\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;vitalikbuterin&#x2F;status&#x2F;147950136619213209...</a>", "time": 1643915260, "type": "comment"}, {"by": "athielking", "descendants": 0, "id": 30197134, "score": 1, "time": 1643915260, "title": "Google delivers Flutter support for Windows desktop apps", "type": "story", "url": "https://siliconangle.com/2022/02/03/google-delivers-flutter-support-windows-desktop-apps/"}, {"by": "Klonoar", "id": 30197135, "parent": 30196436, "text": "Surely you could link to the actual blog pose rather than a subreddit that regularly crosses the border into conspiracy theory territory.", "time": 1643915261, "type": "comment"}, {"by": "shlosky", "descendants": 0, "id": 30197136, "score": 1, "time": 1643915266, "title": "Show HN: A Penny – answer questions and earn “a penny for your thought”", "type": "story", "url": "https://a-penny.com/"}, {"by": "joering2", "descendants": 0, "id": 30197137, "score": 1, "time": 1643915266, "title": "Top analyst calculates Tesla true worth is $138 a share", "type": "story", "url": "https://fortune.com/2022/02/02/tsla-stock-valuation-predictions-2022/"}, {"by": "smm11", "id": 30197138, "parent": 30193469, "text": "Where I live, the only requirement in a semi truck is an area to store large volumes of meth.", "time": 1643915279, "type": "comment"}, {"by": "poulsbohemian", "id": 30197139, "parent": 30196782, "text": "I hear what you are saying, especially since we lack real quantitative data here and are speaking subjectively about how we perceive a decade+ of discussion... I&#x27;m sure you are right that there was always an undertone of young men trying to one-up each other with comments. My gut tells me though that if we go back in time, there were more actual experts commenting, who drowned out or downvoted the people just here to shit post. Maybe not though, as your experiences bear out.", "time": 1643915279, "type": "comment"}, {"by": "burkaman", "id": 30197140, "parent": 30195327, "text": "It just depends on your definition of &quot;solved&quot;. If solved means &quot;all consequences of anthropogenic climate change avoided&quot; then it&#x27;s obviously too late, there&#x27;s no solution other than time travel. If solved means &quot;humanity survives as a species&quot; then we&#x27;re in pretty good shape no matter what we do. For most people I think solved means &quot;we avoid the worst effects&quot;, which of course leads to another question about definitions.<p>Many people look at the graph in your citation and see it as a picture of success, because the baseline in their mind is RCP8.5. Note that the graph makes a comparison to RCP2.6, which is not a &quot;do nothing&quot; scenario, it&#x27;s a pretty optimistic and aspirational future.", "time": 1643915280, "type": "comment"}, {"by": "mdasen", "id": 30197141, "parent": 30193335, "text": "Some towns in the US have done this, but it isn&#x27;t without difficulties.<p>Just looking at a satellite map of Spain, I see La Langa. It seems like it has very few people, but they all live in a small town center. Looking at Uclés, it&#x27;s the same: tiny place, but everyone is living in the town center.<p>Let&#x27;s look at Potomac, MD in the US. The roads are sprawling with giant houses all far apart. That&#x27;s a lot more distance to run fiber to get it to each house. Potomac is a rich suburb of DC and has fine internet (it&#x27;s still dense enough for that), but the US keeps sprawling. Look at a satellite view of Pike Township, PA. There&#x27;s a lot of houses with huge distances in between and no discernible town center.<p>&gt; If you manage to use electric or telephone posts deploying fiber and getting a carrier is doable<p>I think this can also be an issue in the US since place might not have easy&#x2F;cheap access to those utility poles. Title II carriers in the US get cheap, regulated access to utility poles. That&#x27;s traditionally been your phone company. I believe the FCC tried reclassifying broadband as Title II under the Obama administration, but it might have been reversed under the Trump administration. If you&#x27;re someone that already has access to the utility poles, you don&#x27;t want more people getting cheap access to them.<p>Even if you have access to the utility poles, you can face difficulty. As noted, you aren&#x27;t wiring up a town center, you can be wiring up places with a huge amount of distance between people. Even if that isn&#x27;t a problem, property owners might want new cables buried. Even when power lines are above ground, sometimes they&#x27;re underground from the street to the house. Many houses might be set back from the street by 50 meters so it can be a larger distance. You can have a 300m road with 3 houses on it each with a 50m set back from the street.<p>That&#x27;s not to say it isn&#x27;t possible (and some towns have created coop ISPs), but costs add up. Uclés has 140 people in it, but everyone seems to live within a 250m radius of the city center. That seems pretty easy to wire up. Pike Township, PA has 1,700 people that are incredibly spread out. That seems a lot harder to wire up. It&#x27;s not impossible, but it seems harder.", "time": 1643915281, "type": "comment"}, {"deleted": true, "id": 30197142, "parent": 30192915, "time": 1643915282, "type": "comment"}, {"by": "CrankyBear", "descendants": 0, "id": 30197143, "score": 2, "time": 1643915286, "title": "Is NPM a Hotbed of Malware?", "type": "story", "url": "https://thenewstack.io/is-npm-a-hotbed-of-malware/"}, {"by": "quickthrowman", "id": 30197144, "parent": 30195701, "text": "US residential service is split phase 120&#x2F;240, commercial service is generally 120&#x2F;208v three-phase or 277&#x2F;480v three-phase.", "time": 1643915287, "type": "comment"}, {"by": "nomel", "id": 30197145, "parent": 30196825, "text": "If the thief has an iPhone, they&#x27;ll still be alerted that the tracker is following them. If they move their phone around on your bike, they&#x27;ll be able to find it, within several inches, with the NFC identification feature that gives the last four digits of the owners phone number.<p>Maybe Apple&#x27;s campaign is working: <a href=\"https:&#x2F;&#x2F;www.theguardian.com&#x2F;technology&#x2F;2020&#x2F;feb&#x2F;26&#x2F;apple-does-not-let-bad-guys-use-iphones-on-screen\" rel=\"nofollow\">https:&#x2F;&#x2F;www.theguardian.com&#x2F;technology&#x2F;2020&#x2F;feb&#x2F;26&#x2F;apple-doe...</a>", "time": 1643915289, "type": "comment"}, {"by": "xdavidliu", "id": 30197146, "parent": 30196354, "text": "I misread your post in exactly the same way and thought the joke was made by a journalist.", "time": 1643915290, "type": "comment"}, {"by": "dboreham", "id": 30197147, "parent": 30196977, "text": "That&#x27;s not actually a thing though. There are people&#x2F;entities with large ETH holdings who could well be motivated to foot this loss, but they can&#x27;t just magic (real) money out of thin air.", "time": 1643915293, "type": "comment"}, {"by": "ravar", "id": 30197148, "parent": 30195955, "text": "I know with some bacteria (which I work with for evolutionary biology) they can intentionally mutate at higher rates when under stress.", "time": 1643915294, "type": "comment"}, {"by": "wonderwonder", "id": 30197149, "parent": 30196343, "text": "Could this hack have allowed for the printing of eth on solana that did not actually exist on the eth blockchain or was it limited to real eth that had been bridged to solana?", "time": 1643915307, "type": "comment"}, {"by": "bick_nyers", "id": 30197150, "parent": 30194101, "text": "What if I just didn&#x27;t pay my bill and the utility company disconnected me from the power grid? Would I be subject to fines and jail time? Absurd, but hey, that sure sounds like Florida.", "time": 1643915308, "type": "comment"}, {"by": "RC_ITR", "id": 30197151, "parent": 30192619, "text": "Well, it was always kind of doomed in this way.<p>When everyone is still actively building their friend list (remember this started for college students) its an amazing product because it brings you closer to people in a new way and allows for curation without investing a ton into AI&#x2F;ML.<p>For people who stay in a static social bubbles for long times (e.g., your parents, your friends from HS who didn&#x27;t move to a coastal city) it&#x27;s also perfect, because they tend to value content related to their social group more than something new and interesting.<p>But for the highest value users (e.g., the ones with high-paying knowledge-based jobs and a willingness to try new things) the social graph will never keep up with their lives.  Bad content from the edges of the graph will slowly creep into feeds (MLMs being a prime example) and those high-value users will seek out new platforms that conform better to their interests.<p>Instagram was a brilliant stop-gap, but Mark never saw the writing on the wall about algorithmic content (probably b&#x2F;c Bytedance had the advantage of cutting its teeth in China first) and is just too far behind to ever really catch up.<p>So now he&#x27;s trying to out-future Bytedance with VR (and even got them to burn $1bn on Pico), but unless he has some hard-tech rabbit to pull out of his hat, there&#x27;s just not anything there.<p>We may very well be seeing the largest (negative) turn-around story in history since Yahoo! play out in front of our eyes.", "time": 1643915310, "type": "comment"}, {"by": "rlt", "id": 30197152, "parent": 30196819, "text": "If that’s the case “restored” is an interesting way to put it.", "time": 1643915315, "type": "comment"}, {"by": "mmaunder", "id": 30197153, "parent": 30196613, "text": "That’s awesome! Best of luck!!", "time": 1643915316, "type": "comment"}, {"by": "aaomidi", "id": 30197154, "parent": 30196914, "text": "With more power, comes more responsibility.<p>Apple is going to always be under the magnifying glass because they are just so much &quot;bigger&quot;.", "time": 1643915319, "type": "comment"}, {"by": "bryanlarsen", "id": 30197155, "parent": 30193752, "text": "But there are no 100W ones.", "time": 1643915319, "type": "comment"}, {"by": "hoerzu", "id": 30197156, "parent": 30195191, "text": "Really helpful keeping notebooks tidy :)", "time": 1643915326, "type": "comment"}, {"by": "scarface74", "id": 30197157, "parent": 30196318, "text": "Fair enough.  But you do notice that newspapers are still the most popular way for CPG goods like P&amp;G to advertise where they don’t have to target or track.", "time": 1643915334, "type": "comment"}, {"by": "Coding_Cat", "id": 30197158, "parent": 30196289, "text": "I took a brief look at it and saw nothing to suggest that &#x27;web3&#x27; added anything of real value.<p>If you believe there is, then I&#x27;d love to hear what it adds that&#x27;s 1. unique and 2. actually desirable.", "time": 1643915336, "type": "comment"}, {"by": "jws", "id": 30197159, "parent": 30193826, "text": "ATT&#x27;s product along this line was a complete failure for me. I didn&#x27;t have a street address at the fixed (albeit remote) location, and there were no street addresses I could pretend to have within its tolerable radius. They had no way of enabling the device without it being near a street address.<p>The technology would have worked just fine, they just couldn&#x27;t fill in their E911 entry with anything that would work.", "time": 1643915337, "type": "comment"}, {"by": "BenjiWiebe", "id": 30197160, "parent": 30196022, "text": "It&#x27;s also the friction of everything turning. And you&#x27;ve still got your alternator, oil pump, water pump, fan etc that are removing energy.", "time": 1643915339, "type": "comment"}, {"by": "parsd", "id": 30197161, "parent": 30189202, "text": "There is nothing facetious or self-flattering here, these things aren&#x27;t achievements, rather reactions to dependence on some massive facets of modern life, which, as it turns out, are not critical or even necessary.", "time": 1643915351, "type": "comment"}, {"by": "aerostable_slug", "id": 30197162, "parent": 30196700, "text": "Hell, DLI teaches Hebrew (once euphemized as &quot;special Arabic&quot; in some settings) [0]. That&#x27;s not just for exchange&#x2F;liaison officers... Not to dig up that bucket of worms, but there were Hebrew linguists aboard the USS Liberty.<p>[0] <a href=\"https:&#x2F;&#x2F;www.dliflc.edu&#x2F;about&#x2F;languages-at-dliflc&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.dliflc.edu&#x2F;about&#x2F;languages-at-dliflc&#x2F;</a>", "time": 1643915354, "type": "comment"}, {"by": "toovs", "id": 30197163, "parent": 30196748, "text": "Did you even read the above post whatsoever? If all you have are spaceship jpegs, I&#x27;m not sure what game you&#x27;re playing but it isn&#x27;t star citizen.", "time": 1643915360, "type": "comment"}, {"by": "panzagl", "id": 30197164, "parent": 30196549, "text": "Collective bargaining involves two parties, one representing the &#x27;collective&#x27;.  App stores are more at-will: &#x27;my way or the highway&#x27;.", "time": 1643915362, "type": "comment"}, {"by": "Spooky23", "id": 30197165, "parent": 30197010, "text": "&gt; What Apple created would be Facebooks, NSAs and pretty much every spying entities wet dream to get fingers on.<p>No, Apple made it available to you. Police and intelligence agencies can buy this data from various entities or subpoena it.", "time": 1643915366, "type": "comment"}, {"by": "willcipriano", "id": 30197166, "parent": 30196928, "text": "This is a place for a generic open protocol. To have a real internet of things we need some kind of DNS but for objects.", "time": 1643915370, "type": "comment"}, {"by": "brimble", "id": 30197167, "parent": 30195813, "text": "This definitely wasn&#x27;t intended as a &quot;medieval kings had it great by modern standards&quot; call to return to the past, but rather to emphasize just <i>how much</i> world-class, hyper-stimulative entertainment we have available, dirt-cheap and on tap, every hour of the day. Even TV stations used to shut down for the night. The shift started with electrification &amp; recording technology, but entered a whole new phase only quite recently. When you put what we have in terms of what our everyday entertainment options would have looked like in a pre-industrial society, it emphasizes just how <i>large</i> a difference there is.<p>If anything, this is closer to a &quot;Gods of the Copybook Headings&quot; argument. &quot;Too much of a good thing...&quot; may be cliché and something only old fogeys say... but what if <i>we&#x27;re</i> the ones making an error, in rolling our eyes at them? What if, not even that long ago, that was a bit silly applied to this particular thing (entertainment and nighttime lighting, chiefly) but no longer is?<p>I don&#x27;t expect this problem to actually be fixed, but I do find all the casting about for &quot;why do <i>so many</i> people have trouble sleeping, these days?&quot; risible in light of what sure looks like the most obvious explanation, which never gets more than a personal-responsibility treatment (&quot;put the phone in another room&quot;) which seems like a bad joke when you apply the medieval-king thought experiment. &quot;Maybe the king should just not leave the bedroom, then?&quot; LOL.", "time": 1643915373, "type": "comment"}, {"by": "Sohcahtoa82", "id": 30197168, "parent": 30189145, "text": "It takes an extreme level of hubris to ever think your code covers all edge cases and potential exploits.", "time": 1643915373, "type": "comment"}, {"by": "brailsafe", "id": 30197169, "parent": 30196353, "text": "People have been doing this for the last 18 years with World of Warcraft since it&#x27;s release.", "time": 1643915382, "type": "comment"}, {"by": "BoorishBears", "id": 30197170, "parent": 30197016, "text": "Have things changed?<p><a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;nerQCrOam5U\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;nerQCrOam5U</a>", "time": 1643915388, "type": "comment"}, {"by": "charcircuit", "id": 30197171, "parent": 30192079, "text": "Even if you let computers have infinite memory it still doesn&#x27;t matter that much if a language is Turing complete. The person I replied to seemed to be more worried about CSS reading localstorage compared to being able to recognize a recursively enumerable language.", "time": 1643915391, "type": "comment"}, {"by": "harpersealtako", "id": 30197172, "parent": 30187348, "text": "How many people&#x27;s lives are saved from increased access to trans-oceanic trade?  I don&#x27;t have an answer to that, but isn&#x27;t it possible that the counterfactual world where no container ships exist involves worse health and mortality outcomes?", "time": 1643915391, "type": "comment"}, {"by": "ovao", "id": 30197173, "parent": 30194692, "text": "&gt; I&#x27;ve only been active since 2019, I wouldn&#x27;t say the tone has changed much...<p>Largely agreed. If the idea that the pandemic and the greater isolation that tends to come from remote work are contributing to more negativity in the things people write (which is a reasonable supposition), then you&#x27;d probably also expect a more negative take from the things people read. What was once innocuous might now read as not-so-innocuous. In other words, is whatever issue there is just a perception issue?<p>Overall, I don&#x27;t think HN&#x27;s tone or content quality has changed much. dang &amp; Co. are steering this ship just as well as ever in my opinion (thanks dang!)", "time": 1643915391, "type": "comment"}, {"by": "rhengles", "id": 30197174, "parent": 30196507, "text": "Would it require too much energy to spin it away from earth instead of towards it ?", "time": 1643915397, "type": "comment"}, {"by": "dboreham", "id": 30197175, "parent": 30196879, "text": "Also noteworthy: this kind of &quot;trusted&quot; bridge architecture is probably now doomed.", "time": 1643915397, "type": "comment"}, {"by": "patchorang", "id": 30197176, "parent": 30192917, "text": "(this was years ago but) I thought this too. I was relatively new to a new city and still building my friend group. I was worried that if I deleted facebook I wouldn&#x27;t get invited to events, keep in touch with new people I met.<p>I deleted it anyway. Deleting facebook didn&#x27;t change my real world in anyway.", "time": 1643915401, "type": "comment"}, {"by": "Tomte", "descendants": 0, "id": 30197177, "score": 1, "time": 1643915410, "title": "Ill-fitting gear puts female firefighters at risk, but that’s changing (2020)", "type": "story", "url": "https://www.theverge.com/2020/2/21/21147087/female-firefighter-gear-risk-california-australia-wildfires-climate-change"}, {"by": "elldoubleyew", "id": 30197178, "parent": 30197037, "text": "I’ve always wondered if I have a “gaming addiction”<p>I play league of legends at least 4 hours per day, sometimes 20+ hours. I am obsessed with learning all the intricacies and improving in the ELO-based ranking system.<p>I still maintain a full time job as an SWE, a romantic relationship, and personal hygiene&#x2F;diet. Admittedly LoL comes first before work for me, and can cause tension in my relationship at times.<p>I know many men that have a very similar relationship with golf, but are they golf addicts?", "time": 1643915412, "type": "comment"}, {"by": "wizwit999", "id": 30197179, "parent": 30195191, "text": "I think this is a good idea. Decoupling seems like an interesting approach. When I worked in this space as an engineer, bridging the notebook - production-ization divide was annoying. I&#x27;d be interested to see if this solves it.", "time": 1643915415, "type": "comment"}, {"by": "jackshaw", "id": 30197180, "parent": 30161333, "text": "I like GTML and GTTP. We only need to make sure that the G stands for GNU.", "time": 1643915417, "type": "comment"}, {"by": "masterof0", "id": 30197181, "parent": 30196296, "text": "Can&#x27;t you just get another nationality and then apply to the green card with that new passport?", "time": 1643915418, "type": "comment"}, {"by": "rmason", "id": 30197182, "parent": 30195387, "text": "Spoke with a trucker about this very issue.  He started out driving CoE trucks and said when there&#x27;s a crash the driver is ejected out through the window.  Now this was before the days of airbags but that would be enough to discourage their use.  He said it got so drivers refused to work at companies who used them.  However it was the desire for increased fuel economy that finally ended their reign.", "time": 1643915419, "type": "comment"}, {"by": "Tomte", "descendants": 0, "id": 30197183, "score": 1, "time": 1643915420, "title": "Play Secret Hitler (2020)", "type": "story", "url": "https://kristoff.it/blog/you-should-play-secret-hitler/"}, {"by": "imartin2k", "descendants": 0, "id": 30197184, "score": 1, "time": 1643915421, "title": "W(h)ither ARM?", "type": "story", "url": "https://digitstodollars.com/2022/02/02/whither-arm/"}, {"by": "sterlind", "id": 30197185, "parent": 30195583, "text": "I think this is the first time I&#x27;ve seen an API describe itself as a &quot;malevolent agent of chaos.&quot;<p>&gt; <i>The carcass of many a seasoned Haskell programmer lie strewn at its feet.</i><p>the docs are genuinely entertaining.", "time": 1643915425, "type": "comment"}, {"by": "pmoriarty", "id": 30197186, "parent": 30197116, "text": "<i>&quot;almost the entire game revolves around getting from station to station in a desperate attempt not to run out of air was a big turndown for me&quot;</i><p>That&#x27;s not been my experience at all.<p>Just invest in buying life support equipment upgrades whenever you find them and you won&#x27;t have any problem surviving in your trips from station to station.", "time": 1643915431, "type": "comment"}, {"by": "errcorrectcode", "id": 30197187, "parent": 30196282, "text": "Prolog isn&#x27;t a DBMS, it&#x27;s a functional &#x2F; logic programming language. It doesn&#x27;t store tables or operate on relational algebra.<p>How would you CRUD data DDL, DQL, DML, DCL, TCL against tables (not facts or variables) without SQL? Magic?<p>And why are you cobbling queries together manually and not using an ORM or library? SMH.", "time": 1643915438, "type": "comment"}, {"by": "JordanTen", "descendants": 0, "id": 30197188, "score": 1, "time": 1643915442, "title": "Easy Guide to Set Up Prometheus Alertmanager with Slack, PagerDuty, and Gmail", "type": "story", "url": "https://grafana.com/blog/2020/02/25/step-by-step-guide-to-setting-up-prometheus-alertmanager-with-slack-pagerduty-and-gmail/"}, {"deleted": true, "id": 30197189, "parent": 30194775, "time": 1643915442, "type": "comment"}, {"by": "quickthrowman", "id": 30197190, "parent": 30196313, "text": "400A @ 240v is 96kW", "time": 1643915448, "type": "comment"}, {"by": "cestith", "id": 30197191, "parent": 30196119, "text": "<a href=\"https:&#x2F;&#x2F;basicdos.com&#x2F;blog&#x2F;2020&#x2F;05&#x2F;17&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;basicdos.com&#x2F;blog&#x2F;2020&#x2F;05&#x2F;17&#x2F;</a>", "time": 1643915450, "type": "comment"}, {"by": "BiteCode_dev", "id": 30197192, "parent": 30195024, "text": "A bit unrelated, but I find fynny most frameworks don&#x27;t even have something to prevent CSRF. Most devs don&#x27;t even know what CSRF are, and some know it only as &quot;the stuff I need to disable because some ajax POST won&#x27;t work otherwise&quot;.<p>In fact, every time somebody choose flask over Django, I ask what they are going to do about CSRF, only to get a blank stare. Same with manual PHP or using most nodejs web libs.<p>There are so many websites that are vulnerable to this, and it&#x27;s something we know well, and have solutions for. Imagine what we don&#x27;t know about. The internet is really made of swiss cheese.", "time": 1643915454, "type": "comment"}, {"by": "seanwilson", "id": 30197193, "parent": 30195493, "text": "&gt; To hedge against this, I tend to include a bucket of hours for arbitrary changes.<p>Can you explain this part more? How do you explain what gets charged against the bucket of hours and how many hours for each change? At what stage do you issue change orders?<p>Small thing I don&#x27;t hear people mention but with the SOW I always add a list of &quot;not in scope&quot; items too (e.g. &quot;web app works in latest version of Chrome only&quot; + &quot;Internet Explorer and mobile support is out of scope&quot;). I find this help uncover ambiguities (like &quot;I assumed it would have worked on mobile Chrome and desktop Edge too&quot;) and makes it much easier to say &quot;we agreed that&#x27;s out of scope&quot; later.", "time": 1643915467, "type": "comment"}, {"by": "jfengel", "id": 30197194, "parent": 30195432, "text": "My favorite podcast app, Pocket Casts, doesn&#x27;t seem to support authenticated URLs. I&#x27;m not entirely sure why. I would have thought it was a relatively easy thing to do, and it&#x27;s not abandonware.<p>I do give money via Patreon for a number of podcasts, and in one instance I have to jump through some hoops to get the special content. The others, I just give money because I like it, and the extra content either doesn&#x27;t exist or doesn&#x27;t interest me.<p>If more people move to some kind of locked podcast, I&#x27;d have to switch. Which would be too bad because I really, really like Pocket Casts in every other respect. I do hope more creators find ways to monetize their podcasts.<p>But I&#x27;m sure never gonna use Spotify. Even before they spent $100 million dollars to make a jerk the face of their company. So when the CEO says &quot;it’s really easy to conclude we endorse every word he says and believe the opinions expressed by his guests&quot; -- yeah, it sure as heck does when you spend that kind of money on it.", "time": 1643915472, "type": "comment"}, {"by": "chipotle_coyote", "id": 30197195, "parent": 30196138, "text": "I wouldn&#x27;t be surprised if WoW has spent more money <i>by now</i> than Star Citizen has, but WoW was announced in 2001 and shipped a release version in 2004. The added expenditures are all game updates, new campaigns, and general recurring expenses from running arguably the most successful MMO of all time.<p>Star Citizen, by contrast, was announced over a decade later in 2012, and has gone through its hundreds of million dollars <i>without</i> shipping a release version, or even a beta version (they dub what&#x27;s currently shipping an alpha). So it seems reasonable to hold them to a different standard.<p>(Granted, it&#x27;s not impossible Star Citizen is <i>also</i> profitable, all things considered, but that just raises more questions.)", "time": 1643915475, "type": "comment"}, {"by": "dudus", "id": 30197196, "parent": 30196650, "text": "Isn&#x27;t this something they write on nuclear waste sites?", "time": 1643915477, "type": "comment"}, {"by": "gtm1260", "id": 30197197, "parent": 30197023, "text": "There are plenty of trackers, but they require monthly subscriptions!", "time": 1643915478, "type": "comment"}, {"by": "namelessoracle", "id": 30197198, "parent": 30195775, "text": "Its technically Meta Rift 2 now :)", "time": 1643915481, "type": "comment"}, {"by": "samatman", "id": 30197199, "parent": 30197006, "text": "Apple still has some weird atomization issues for a company which is going all-in on family stuff.<p>This is the company which ran out a credit card and payments infrastructure with serious fanfare— and, incredibly, no provisions for married people having joint accounts.<p>None, they added it later when dhh and Steve Wozniak made a stink about it.", "time": 1643915486, "type": "comment"}, {"by": "Dylan16807", "id": 30197200, "parent": 30190841, "text": "And today&#x27;s supercomputer work was impossible in the late 90&#x27;s.<p>That doesn&#x27;t really change my argument.  When you&#x27;re looking at languages that are used for small tasks today, they don&#x27;t have much relevance to how much bigger tasks are accomplished.  And by the time <i>those</i> tasks can be run on a laptop, WASM implementations are going to be much better and we still might not be using it at all for those kinds of tasks.", "time": 1643915488, "type": "comment"}][{"by": "BoorishBears", "id": 30197170, "parent": 30197016, "text": "Have things changed?<p><a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;nerQCrOam5U\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;nerQCrOam5U</a>", "time": 1643915388, "type": "comment"}, {"by": "charcircuit", "id": 30197171, "parent": 30192079, "text": "Even if you let computers have infinite memory it still doesn&#x27;t matter that much if a language is Turing complete. The person I replied to seemed to be more worried about CSS reading localstorage compared to being able to recognize a recursively enumerable language.", "time": 1643915391, "type": "comment"}, {"by": "harpersealtako", "id": 30197172, "parent": 30187348, "text": "How many people&#x27;s lives are saved from increased access to trans-oceanic trade?  I don&#x27;t have an answer to that, but isn&#x27;t it possible that the counterfactual world where no container ships exist involves worse health and mortality outcomes?", "time": 1643915391, "type": "comment"}, {"by": "ovao", "id": 30197173, "parent": 30194692, "text": "&gt; I&#x27;ve only been active since 2019, I wouldn&#x27;t say the tone has changed much...<p>Largely agreed. If the idea that the pandemic and the greater isolation that tends to come from remote work are contributing to more negativity in the things people write (which is a reasonable supposition), then you&#x27;d probably also expect a more negative take from the things people read. What was once innocuous might now read as not-so-innocuous. In other words, is whatever issue there is just a perception issue?<p>Overall, I don&#x27;t think HN&#x27;s tone or content quality has changed much. dang &amp; Co. are steering this ship just as well as ever in my opinion (thanks dang!)", "time": 1643915391, "type": "comment"}, {"by": "rhengles", "id": 30197174, "parent": 30196507, "text": "Would it require too much energy to spin it away from earth instead of towards it ?", "time": 1643915397, "type": "comment"}, {"by": "dboreham", "id": 30197175, "parent": 30196879, "text": "Also noteworthy: this kind of &quot;trusted&quot; bridge architecture is probably now doomed.", "time": 1643915397, "type": "comment"}, {"by": "patchorang", "id": 30197176, "parent": 30192917, "text": "(this was years ago but) I thought this too. I was relatively new to a new city and still building my friend group. I was worried that if I deleted facebook I wouldn&#x27;t get invited to events, keep in touch with new people I met.<p>I deleted it anyway. Deleting facebook didn&#x27;t change my real world in anyway.", "time": 1643915401, "type": "comment"}, {"by": "Tomte", "descendants": 0, "id": 30197177, "score": 1, "time": 1643915410, "title": "Ill-fitting gear puts female firefighters at risk, but that’s changing (2020)", "type": "story", "url": "https://www.theverge.com/2020/2/21/21147087/female-firefighter-gear-risk-california-australia-wildfires-climate-change"}, {"by": "elldoubleyew", "id": 30197178, "kids": [30197291], "parent": 30197037, "text": "I’ve always wondered if I have a “gaming addiction”<p>I play league of legends at least 4 hours per day, sometimes 20+ hours. I am obsessed with learning all the intricacies and improving in the ELO-based ranking system.<p>I still maintain a full time job as an SWE, a romantic relationship, and personal hygiene&#x2F;diet. Admittedly LoL comes first before work for me, and can cause tension in my relationship at times.<p>I know many men that have a very similar relationship with golf, but are they golf addicts?", "time": 1643915412, "type": "comment"}, {"by": "wizwit999", "id": 30197179, "kids": [30197264], "parent": 30195191, "text": "I think this is a good idea. Decoupling seems like an interesting approach. When I worked in this space as an engineer, bridging the notebook - production-ization divide was annoying. I&#x27;d be interested to see if this solves it.", "time": 1643915415, "type": "comment"}, {"by": "jackshaw", "id": 30197180, "parent": 30161333, "text": "I like GTML and GTTP. We only need to make sure that the G stands for GNU.", "time": 1643915417, "type": "comment"}, {"by": "masterof0", "id": 30197181, "kids": [30197229], "parent": 30196296, "text": "Can&#x27;t you just get another nationality and then apply to the green card with that new passport?", "time": 1643915418, "type": "comment"}, {"by": "rmason", "id": 30197182, "parent": 30195387, "text": "Spoke with a trucker about this very issue.  He started out driving CoE trucks and said when there&#x27;s a crash the driver is ejected out through the window.  Now this was before the days of airbags but that would be enough to discourage their use.  He said it got so drivers refused to work at companies who used them.  However it was the desire for increased fuel economy that finally ended their reign.", "time": 1643915419, "type": "comment"}, {"by": "Tomte", "descendants": 0, "id": 30197183, "score": 1, "time": 1643915420, "title": "Play Secret Hitler (2020)", "type": "story", "url": "https://kristoff.it/blog/you-should-play-secret-hitler/"}, {"by": "imartin2k", "descendants": 0, "id": 30197184, "score": 1, "time": 1643915421, "title": "W(h)ither ARM?", "type": "story", "url": "https://digitstodollars.com/2022/02/02/whither-arm/"}, {"by": "sterlind", "id": 30197185, "parent": 30195583, "text": "I think this is the first time I&#x27;ve seen an API describe itself as a &quot;malevolent agent of chaos.&quot;<p>&gt; <i>The carcass of many a seasoned Haskell programmer lie strewn at its feet.</i><p>the docs are genuinely entertaining.", "time": 1643915425, "type": "comment"}, {"by": "pmoriarty", "id": 30197186, "parent": 30197116, "text": "<i>&quot;almost the entire game revolves around getting from station to station in a desperate attempt not to run out of air was a big turndown for me&quot;</i><p>That&#x27;s not been my experience at all.<p>Just invest in buying life support equipment upgrades whenever you find them and you won&#x27;t have any problem surviving your trips from station to station, even in the most hazardous star systems.", "time": 1643915431, "type": "comment"}, {"by": "errcorrectcode", "id": 30197187, "parent": 30196282, "text": "Prolog isn&#x27;t a DBMS, it&#x27;s a functional &#x2F; logic programming language. It doesn&#x27;t store tables or operate on relational algebra.<p>How would you CRUD data DDL, DQL, DML, DCL, TCL against tables (not facts or variables) without SQL? Magic?<p>And why are you cobbling queries together manually and not using an ORM or library? SMH.", "time": 1643915438, "type": "comment"}, {"by": "JordanTen", "descendants": 0, "id": 30197188, "score": 1, "time": 1643915442, "title": "Easy Guide to Set Up Prometheus Alertmanager with Slack, PagerDuty, and Gmail", "type": "story", "url": "https://grafana.com/blog/2020/02/25/step-by-step-guide-to-setting-up-prometheus-alertmanager-with-slack-pagerduty-and-gmail/"}, {"deleted": true, "id": 30197189, "parent": 30194775, "time": 1643915442, "type": "comment"}, {"by": "quickthrowman", "id": 30197190, "parent": 30196313, "text": "400A @ 240v is 96kW", "time": 1643915448, "type": "comment"}, {"by": "cestith", "id": 30197191, "parent": 30196119, "text": "<a href=\"https:&#x2F;&#x2F;basicdos.com&#x2F;blog&#x2F;2020&#x2F;05&#x2F;17&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;basicdos.com&#x2F;blog&#x2F;2020&#x2F;05&#x2F;17&#x2F;</a>", "time": 1643915450, "type": "comment"}, {"by": "BiteCode_dev", "id": 30197192, "parent": 30195024, "text": "A bit unrelated, but I find fynny most frameworks don&#x27;t even have something to prevent CSRF. Most devs don&#x27;t even know what CSRF are, and some know it only as &quot;the stuff I need to disable because some ajax POST won&#x27;t work otherwise&quot;.<p>In fact, every time somebody choose flask over Django, I ask what they are going to do about CSRF, only to get a blank stare. Same with manual PHP or using most nodejs web libs.<p>There are so many websites that are vulnerable to this, and it&#x27;s something we know well, and have solutions for. Imagine what we don&#x27;t know about. The internet is really made of swiss cheese.", "time": 1643915454, "type": "comment"}, {"by": "seanwilson", "id": 30197193, "parent": 30195493, "text": "&gt; Of course, you need to be careful how militant you are here, because issuing a change order for every minor thing won&#x27;t help you get repeat business.<p>Yep, I also find the changes go both ways as well, where sometimes the requirements change in a way that make your life easier.<p>&gt; To hedge against this, I tend to include a bucket of hours for arbitrary changes.<p>Can you explain this part more? How do you explain what gets charged against the bucket of hours and how many hours for each change? At what stage do you issue change orders?<p>Small thing I don&#x27;t hear people mention but with the SOW I always add a list of &quot;not in scope&quot; items too (e.g. &quot;web app works in latest version of Chrome only&quot; + &quot;Internet Explorer and mobile support is out of scope&quot;). I find this help uncover ambiguities like the client saying later &quot;I assumed it would have worked on mobile Chrome and desktop Edge too&quot;, and makes it much easier to say &quot;we agreed that&#x27;s out of scope&quot;.", "time": 1643915467, "type": "comment"}, {"by": "jfengel", "id": 30197194, "parent": 30195432, "text": "My favorite podcast app, Pocket Casts, doesn&#x27;t seem to support authenticated URLs. I&#x27;m not entirely sure why. I would have thought it was a relatively easy thing to do, and it&#x27;s not abandonware.<p>I do give money via Patreon for a number of podcasts, and in one instance I have to jump through some hoops to get the special content. The others, I just give money because I like it, and the extra content either doesn&#x27;t exist or doesn&#x27;t interest me.<p>If more people move to some kind of locked podcast, I&#x27;d have to switch. Which would be too bad because I really, really like Pocket Casts in every other respect. I do hope more creators find ways to monetize their podcasts.<p>But I&#x27;m sure never gonna use Spotify. Even before they spent $100 million dollars to make a jerk the face of their company. So when the CEO says &quot;it’s really easy to conclude we endorse every word he says and believe the opinions expressed by his guests&quot; -- yeah, it sure as heck does when you spend that kind of money on it.", "time": 1643915472, "type": "comment"}, {"by": "chipotle_coyote", "id": 30197195, "parent": 30196138, "text": "I wouldn&#x27;t be surprised if WoW has spent more money <i>by now</i> than Star Citizen has, but WoW was announced in 2001 and shipped a release version in 2004. The added expenditures are all game updates, new campaigns, and general recurring expenses from running arguably the most successful MMO of all time.<p>Star Citizen, by contrast, was announced over a decade later in 2012, and has gone through its hundreds of million dollars <i>without</i> shipping a release version, or even a beta version (they dub what&#x27;s currently shipping an alpha). So it seems reasonable to hold them to a different standard.<p>(Granted, it&#x27;s not impossible Star Citizen is <i>also</i> profitable, all things considered, but that just raises more questions.)", "time": 1643915475, "type": "comment"}, {"by": "dudus", "id": 30197196, "parent": 30196650, "text": "Isn&#x27;t this something they write on nuclear waste sites?", "time": 1643915477, "type": "comment"}, {"by": "gtm1260", "id": 30197197, "parent": 30197023, "text": "There are plenty of trackers, but they require monthly subscriptions!", "time": 1643915478, "type": "comment"}, {"by": "namelessoracle", "id": 30197198, "parent": 30195775, "text": "Its technically Meta Rift 2 now :)", "time": 1643915481, "type": "comment"}, {"by": "samatman", "id": 30197199, "parent": 30197006, "text": "Apple still has some weird atomization issues for a company which is going all-in on family stuff.<p>This is the company which ran out a credit card and payments infrastructure with serious fanfare— and, incredibly, no provisions for married people having joint accounts.<p>None, they added it later when dhh and Steve Wozniak made a stink about it.", "time": 1643915486, "type": "comment"}, {"by": "Dylan16807", "id": 30197200, "parent": 30190841, "text": "And today&#x27;s supercomputer work was impossible in the late 90&#x27;s.<p>That doesn&#x27;t really change my argument.  When you&#x27;re looking at languages that are used for small tasks today, their speed doesn&#x27;t have much relevance to how vastly bigger tasks are accomplished.  And by the time <i>those</i> tasks can be run on a laptop, WASM implementations are going to be much better and we still might not be using it at all for those larger tasks.", "time": 1643915488, "type": "comment"}, {"by": "TheSocialAndrew", "id": 30197201, "parent": 30194746, "text": "It was a Mythbusters episode, and they concluded that you needed to be following the truck extremely closely (I believe within a couple of feet) to see a gain in fuel efficiency. The driver was unable to keep that small distance consistent for a continuous period of time causing more speed variations, resulting in a loss of fuel efficiency.", "time": 1643915497, "type": "comment"}, {"by": "lariati", "id": 30197202, "parent": 30195128, "text": "I really would love a browser plugin that removes all mention of crypto&#x2F;web3&#x2F;etc..<p>I am just so bored with reading about anything to do with the entire space, pro or con.<p>An inescapable argument about basically nothing. How do I opt out completely?", "time": 1643915507, "type": "comment"}, {"by": "noslenwerdna", "id": 30197203, "parent": 30196657, "text": "The article doesn&#x27;t seem to have anything to do with Facebook?", "time": 1643915512, "type": "comment"}, {"by": "moasda", "id": 30197204, "parent": 30196741, "text": "Yes, I also heared that argument. But I also can see a lot of web pages with dark theme that are not designed for mobile devices. For me it looks like following a trend.", "time": 1643915518, "type": "comment"}, {"by": "babyshake", "id": 30197205, "parent": 30196371, "text": "If I wanted to make sure I knew about an AirTag attached to my vehicle, for example, is there something I can do or something I can put in the vehicle to detect it?", "time": 1643915519, "type": "comment"}, {"by": "kenjackson", "id": 30197206, "parent": 30196286, "text": "This is an example of when people say, &quot;I&#x27;ll do my own research&quot; I often roll my eyes.  First, about the site you gave, here&#x27;s what BMJ has to say about this site:<p>&quot;Different websites (such as <a href=\"https:&#x2F;&#x2F;ivmmeta.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;ivmmeta.com&#x2F;</a>, <a href=\"https:&#x2F;&#x2F;c19ivermectin.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;c19ivermectin.com&#x2F;</a>, <a href=\"https:&#x2F;&#x2F;tratamientotemprano.org&#x2F;estudios-ivermectina&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;tratamientotemprano.org&#x2F;estudios-ivermectina&#x2F;</a>, among others) have conducted meta-analyses with ivermectin studies, showing unpublished colourful forest plots which rapidly gained public acknowledgement and were disseminated via social media, without following any methodological or report guidelines. These websites do not include protocol registration with methods, search strategies, inclusion criteria, quality assessment of the included studies nor the certainty of the evidence of the pooled estimates. Prospective registration of systematic reviews with or without meta-analysis protocols is a key feature for providing transparency in the review process and ensuring protection against reporting biases, by revealing differences between the methods or outcomes reported in the published review and those planned in the registered protocol. These websites show pooled estimates suggesting significant benefits with ivermectin, which has resulted in confusion for clinicians, patients and even decision-makers. This is usually a problem when performing meta-analyses which are not based in rigorous systematic reviews, often leading to spread spurious or fallacious findings.36&quot;<p>Furthermore, in good faith I went and randomly looked at one of the studies cited that sourced a reasonable journal: <a href=\"https:&#x2F;&#x2F;onlinelibrary.wiley.com&#x2F;doi&#x2F;10.1002&#x2F;jmv.27469\" rel=\"nofollow\">https:&#x2F;&#x2F;onlinelibrary.wiley.com&#x2F;doi&#x2F;10.1002&#x2F;jmv.27469</a><p>The c19ivermectin site misrepresents the results from the study.  To quote the actual study: &quot;However, a mortality benefit was not seen with ivermectin treatment before and after PSM (p values = 0.07 and 0.11, respectively). ICU admission, and intubation rate were not significantly different between the groups (p = 0.49, and p = 1.0, respectively). No differences were found between groups regarding the length of hospital stay, ICU admission, intubation rate, and in-hospital mortality.&quot;<p>Additionally the study notes:\n&quot;The ivermectin group was more likely to have bacterial pneumonia complications compared to the control group (43% vs. 23%, p = 0.02). Eight patients had a pulmonary embolism or deep vein thrombosis in the ivermectin group, and the ivermectin group more frequently received therapeutic anticoagulation therapy than the control group. In addition, 13 patients had acute kidney injury in the ivermectin group.&quot;<p>The website you provided has a very biased take on just the one study I looked at.  It&#x27;s hard for me to take it seriously as an unbiased meta-analysis of ivermectin.", "time": 1643915520, "type": "comment"}, {"by": "wk_end", "id": 30197207, "parent": 30194983, "text": "It&#x27;s <i>maybe</i> not dumb to use the forbidden internal symbols, but it&#x27;s certainly dumb to go ask the folks who through naming and documentation have communicated almost comically loudly and explicitly that they don&#x27;t want you using the symbols if it&#x27;s cool if you use the symbols.", "time": 1643915536, "type": "comment"}, {"by": "hindsightbias", "id": 30197208, "parent": 30191006, "text": "Lenovo is not high quality compared to mac except at the top of the range. Which is very expensive. Trying to compete in a commodity consumer market where nobody (other than Apple) made money for well over a decade would be a business disaster.<p>&gt; IBM use and prefer (again) ThinkPads, preinstalled with Linux.<p>Citation required. They had ~300K apple devices several years ago.<p><a href=\"https:&#x2F;&#x2F;www.zdnet.com&#x2F;article&#x2F;ibm-cio-mac-users-perform-better-more-engaged-than-windows-users&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.zdnet.com&#x2F;article&#x2F;ibm-cio-mac-users-perform-bett...</a>", "time": 1643915539, "type": "comment"}, {"by": "mataug", "id": 30197209, "parent": 30197053, "text": "Getting arrested this way has severe consequences later on in life.<p>It might also be difficult to obtain a driving license (essential in various parts of the country), and job prospects aren&#x27;t great as an illegal immigrant.<p>This would be a difficult and stressful life for anyone, and its only worth it if someone&#x27;s current circumstances are a lot worse than living as an illegal immigrant. Even then it maybe easier to seek asylum at some other country if possible.", "time": 1643915539, "type": "comment"}, {"by": "BiteCode_dev", "id": 30197210, "parent": 30187750, "text": "When I was a kid, I played bomberman too much with some friends one summer.<p>Going to sleep, I had the levels blinking through my eyes.", "time": 1643915544, "type": "comment"}, {"by": "elif", "id": 30197211, "parent": 30181675, "text": "i dont think you understand the clip.<p>it is a right turn onto a 2 lane road, where the right lane is protected by parked cars.<p>the tesla pulls into the PROTECTED lane to see around the parked cars.<p>you are assuming that it would have then decided to pull into traffic, but that belief is pretty unfounded. When FSD cannot see well enough to decide that a turn is safe, it will literally sit there for minutes. Yes, i am quite certain it would have done that in the protected parking lane.", "time": 1643915548, "type": "comment"}, {"by": "Tostino", "id": 30197212, "parent": 30196484, "text": "Why? The networking code is entirely on them to get right. What does Cryengine have to do with efficiently updating a giant number of players with movement &#x2F; action information?", "time": 1643915549, "type": "comment"}, {"by": "mahogany", "id": 30197213, "parent": 30195902, "text": "Did you use a set of plans specifically for the A-frame studio house, or was it an amalgamation of a bunch of different resources? I&#x27;d love more resources on it if you have a suggestion.", "time": 1643915551, "type": "comment"}, {"by": "sudosysgen", "id": 30197214, "parent": 30196641, "text": "Where did I say diplomats? Of course, you wouldn&#x27;t disappear the diplomats. However, they almost never operate alone - whenever there is a diplomat engaged in intelligence there are almost always other assets without diplomatic status.<p>Offensive intelligence operations that the US has been conducting in Uganda are, well, offensive in nature, and are thus an attack. Not all attacks are an act of war.<p>&gt; I think your comment sounds a bit biased that’s all. If you share some light - happy to accept the points raised.<p>I don&#x27;t see how it is biased. The US applying sanctions on Uganda after they got caught spying by Ugandan counter-intelligence (under other pretenses, of course) is massively hypocritical. As far as I know using economic pressure to coax a country into <i>accepting</i> espionage is a new low. The US is trying to normalize and establish as basic expectations that weaker countries should just let it spy on them, and that&#x27;s hypocritical above and beyond the norm.", "time": 1643915552, "type": "comment"}, {"by": "jonas21", "id": 30197215, "parent": 30194618, "text": "As an individual, you can deduct depreciation, as long as you&#x27;re using the asset for business purposes and not personal use. If you&#x27;re interested, you should talk to an accountant about this.", "time": 1643915553, "type": "comment"}, {"by": "iszomer", "id": 30197216, "parent": 30196337, "text": "<i>I</i> always saw it that way, away from all the global politics and bullshit, &quot;for science&quot;. Imagine if this turned into circus auction to lure Musk or Bezos to buy the damn thing instead..", "time": 1643915553, "type": "comment"}, {"by": "nicole_express", "descendants": 0, "id": 30197217, "score": 1, "time": 1643915554, "title": "Neo Geo Genesis 1 1/2: The Alpha 68K-V", "type": "story", "url": "https://nicole.express/2022/ganging-up-on-the-alpha.html"}, {"by": "stefan_", "id": 30197218, "kids": [30197275], "parent": 30196914, "text": "Apple coopted every iPhone into a global surveillance network for the benefit of throwaway keychain tokens. <i>That&#x27;s why</i>.", "time": 1643915556, "type": "comment"}, {"by": "poulsbohemian", "id": 30197219, "parent": 30197017, "text": "Yes! I think you nail all of the above, including your numbness to some of the more mundane topics that pop up here regularly. I can&#x27;t help but notice that there are certain topics that come around frequently - some technical, some not - where it feels very <i>planted</i>. Like someone has an agenda to bring up certain topics in order to get some kind of pulse, IE: if we just talked about that two weeks ago, why is this topic back again?", "time": 1643915558, "type": "comment"}, {"by": "tgv", "id": 30197220, "parent": 30196819, "text": "&gt; deep-pocketed investors<p>Or people with a lot of ETH, that want to hold on to the value of the rest they still own.", "time": 1643915559, "type": "comment"}, {"by": "googlryas", "id": 30197221, "parent": 30196769, "text": "The source of the power is important. Are they kids if they care about the environment and pay for 400A service of renewable energy?<p>Is there anyone in America or Canada who cares about the environment, who is <i>not</i> a kid by your standard? I know a bunch of people who claim to care about the environment, but they still eat meat, drive ICE cars, have children, use ridiculous amounts of power compared to the global average, and do many of the normal things North Americans do. I still believe they care about the environment though.", "time": 1643915559, "type": "comment"}, {"by": "WesSouza", "id": 30197222, "parent": 30192820, "text": "I use Visible and noticed this.<p>As soon as I enable a VPN (I use PIA), speeds go back to normal.", "time": 1643915560, "type": "comment"}, {"by": "higgins", "id": 30197223, "parent": 30192956, "text": "Product looks slick; good work.<p>Feedback: I get started for free but I don&#x27;t see how long my free period lasts", "time": 1643915561, "type": "comment"}, {"by": "arberx", "id": 30197224, "parent": 30197099, "text": "Solana ecosystem*<p>Exploit happened on Solana. Jump Trading has a vested interest in the Solana ecosystem and is effectively the sole market maker on it.", "time": 1643915567, "type": "comment"}, {"by": "rootusrootus", "id": 30197225, "parent": 30197100, "text": "And there aren&#x27;t any AirTags with the ability to track without notifying the target they are there.  Trade-offs.<p>The point is valid, though.  AirTags do not enable something which wasn&#x27;t already trivial to accomplish.  At best it just makes it more visible to the general public, but stalkers have known how to use inexpensive GPS trackers for many years.<p>What&#x27;s dishonest is the media pretending that this is some new capability that didn&#x27;t already exist.", "time": 1643915568, "type": "comment"}, {"by": "steve_adams_86", "id": 30197226, "parent": 30196326, "text": "I think people are concerned that the saved taxes don&#x27;t go towards employees as much as they should. I&#x27;m not saying it does or it doesn&#x27;t, just that it&#x27;s a common sentiment I&#x27;ve noticed.", "time": 1643915568, "type": "comment"}, {"by": "brailsafe", "id": 30197227, "parent": 30194868, "text": "Star Citizen looks like the least playable game I&#x27;ve ever seen. Not one thing looks compelling about it. Does anyone here actually like playing it? Why!? Help me!", "time": 1643915575, "type": "comment"}, {"by": "briHass", "id": 30197228, "parent": 30196865, "text": "Nobody should be running electric heat (resistance heat, COP=1), since we now have heat pump technology that can operate below 0F and do so with COPs of at least 2. Electric tankless WHs are also a terrible idea in almost all cases. A HPWH or standard electric tank would be much better for overall power demand.", "time": 1643915580, "type": "comment"}, {"by": "techsupporter", "id": 30197229, "parent": 30197181, "text": "No, they &quot;solved&quot; that &quot;loophole&quot; by amending the law in the 1996 Immigration &quot;Reform&quot; Act to state that place of birth is used, not place of nationality.<p>(Just another law in the long series of laws containing the word &quot;reform&quot; that makes things so much worse for the groups covered by the law.)", "time": 1643915581, "type": "comment"}, {"by": "bigdaddyrabbit2", "id": 30197230, "parent": 30197099, "text": "Nothing happens in finance because it is &quot;The morally right thing&quot;. It&#x27;s all a game of incentives. Wall Street Banks take disproportionate risks because they are incentivized to do so.<p>The interesting thing here is how the un-bailaout-able nature of ETH affects the players in Crypto. Because ETH can&#x27;t be magically printed, the VCs have to decide if they will walk away or bail out the retail end users. It looks like they decided to do the latter.<p>This has happened more than once in Crypto - I can think of the Binance hack, where Binance bailed out the users. OpenSea has also been covering ETH lost by its users who had their Bored Apes stolen because of user mistakes.<p>I wonder what it is about Crypto that causes large players to cover user loses. I need to learn more.", "time": 1643915581, "type": "comment"}, {"by": "Johnny555", "id": 30197231, "parent": 30196970, "text": "In my limited experience with LA traffic, &quot;drive with the traffic&quot; means stop-and-go traffic :-) In stop-and-go, I usually get around 52 mpg. Which is why I got the hybrid in the first place, to commute in rush hour traffic, but I bought it just before the pandemic and work-from-home, so never really used it to commute.", "time": 1643915584, "type": "comment"}, {"by": "RC_ITR", "id": 30197232, "kids": [30197266], "parent": 30197000, "text": "I think GP is confusing &#x27;I went to the store and bought this CD, and burned it to MP3, which plays for free on Winamp&#x27; with &#x27;Winamp was free and now I have to pay for that same experience via streaming.&#x27;&#x27;", "time": 1643915589, "type": "comment"}, {"by": "sephlietz", "id": 30197233, "parent": 30196750, "text": "Maybe this a dumb question, but is the AirTag configured to Notify When Left Behind except when left at your home? I&#x27;ve never heard an AirTag beep before.", "time": 1643915591, "type": "comment"}, {"by": "amelius", "id": 30197234, "parent": 30191282, "text": "It also reminds me of:<p><a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=9k7zywli4Vg\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=9k7zywli4Vg</a>", "time": 1643915597, "type": "comment"}, {"by": "cbenneh", "id": 30197235, "parent": 30196819, "text": "Not really bailing out retail. There was enough liquidity for retail users to exit the tokens at risk without a penalty.<p>On the other hand the VCs themselves that are large owners of the tokens in Solana ecosystem would incur large losses, and that&#x27;s excluding additional losses from reputation in future. It just shows how successful Jump VCs are when they put up $320M in a few hours. Maybe a month of their PnL?", "time": 1643915599, "type": "comment"}, {"by": "Aqueous", "id": 30197236, "parent": 30193106, "text": "Ah interesting - I vaguely remember hearing about this, but since I hadn&#x27;t heard about it in so long I assumed it died.<p>I don&#x27;t know what the uptake on this product is, but this specific product might be a case of &quot;Solving a problem no business is having.&quot; For instance I think it&#x27;d be hard to justify purchasing this service for an enterprise without a compelling use-case. But I certainly think that Facebook has enough technology to make something that solves a problem that people really do have.<p>On the other hand, Slack seems to solve a problem pretty (though increasingly less) well that most businesses have.<p>Finally, I don&#x27;t think VR as it currently exists solves a problem any business truly has. It remains &quot;cool tech&quot; that has yet to find a solid, non-gaming use case. This is why I think Meta is in trouble.", "time": 1643915605, "type": "comment"}, {"by": "qbasic_forever", "id": 30197237, "parent": 30194992, "text": "Expand to 1.5 hours or so drive and I bet you could find some options.", "time": 1643915605, "type": "comment"}, {"by": "BenjiWiebe", "id": 30197238, "parent": 30195436, "text": "It very much slows down. Just not quite as much as a gas engine. You still have friction losses (especially as you get higher rpm), losses from alternator, water pump, engine fans, oil pump, etc.<p>One of my vehicles is a VW Jetta TDI (diesel, ALH engine).", "time": 1643915613, "type": "comment"}, {"by": "kvee", "descendants": 0, "id": 30197239, "score": 1, "time": 1643915619, "title": "Do Animals Understand What It Means to Die?", "type": "story", "url": "https://www.vice.com/en/article/5dg57q/do-animals-understand-what-it-means-to-die"}, {"by": "TingPing", "id": 30197240, "parent": 30195735, "text": "It is clear to me as a native English speaker. We do have &quot;wolves&quot; already.", "time": 1643915621, "type": "comment"}, {"by": "gnabgib", "id": 30197241, "parent": 30191393, "text": "I didn&#x27;t say it was?  I just used cities (major population centers) to determine what coverage was like (bad) and how much of the country had access (almost none).", "time": 1643915624, "type": "comment"}, {"by": "oblio", "id": 30197242, "parent": 30196784, "text": "Didn&#x27;t they do the unthinkable a few years back, for Ethereum itself? They forked the immutable database because of a bug or exploit, I forget what it was exactly.<p>Similar story, rich people protecting their assets.", "time": 1643915628, "type": "comment"}, {"by": "deanmoriarty", "id": 30197243, "parent": 30196894, "text": "That’s kind of like saying: if you already have $X, then you just need $Y - $X.<p>My answer is based on someone going fron $0 to $Y.", "time": 1643915628, "type": "comment"}, {"by": "aasasd", "id": 30197244, "parent": 30192380, "text": "I haven&#x27;t seen an informative ad in ages. So they being beneficial to me in this sense is basically entirely bollocks.", "time": 1643915632, "type": "comment"}, {"by": "JanSt", "id": 30197245, "parent": 30196926, "text": "Law is not about making people happy", "time": 1643915633, "type": "comment"}, {"by": "sfteus", "id": 30197246, "parent": 30195683, "text": "Important to note that Children&#x27;s Health Defense is a highly suspect organization. Rated &quot;conspiracy-pseudoscience&quot;[1], described as &quot;one of the main sources of misinformation on vaccines&quot;[2], with numerous articles describing their fake health posts on social media[3][4] and shady leadership[5][6].<p>Not saying everything from that site should be discarded, but should definitely be taken with a grain of salt.<p>-----<p>[1]: <a href=\"https:&#x2F;&#x2F;mediabiasfactcheck.com&#x2F;childrens-health-defense&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;mediabiasfactcheck.com&#x2F;childrens-health-defense&#x2F;</a><p>[2]: <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Children%27s_Health_Defense\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Children%27s_Health_Defense</a><p>[3]: <a href=\"https:&#x2F;&#x2F;www.nbcnews.com&#x2F;news&#x2F;us-news&#x2F;social-media-hosted-lot-fake-health-news-year-here-s-n1107466\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nbcnews.com&#x2F;news&#x2F;us-news&#x2F;social-media-hosted-lot...</a><p>[4]: <a href=\"https:&#x2F;&#x2F;www.washingtonpost.com&#x2F;health&#x2F;2019&#x2F;11&#x2F;15&#x2F;majority-anti-vaccine-ads-facebook-were-funded-by-two-groups&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.washingtonpost.com&#x2F;health&#x2F;2019&#x2F;11&#x2F;15&#x2F;majority-an...</a><p>[5]: <a href=\"https:&#x2F;&#x2F;www.scientificamerican.com&#x2F;article&#x2F;how-robert-f-kennedy-jr-distorted-vaccine-science1&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.scientificamerican.com&#x2F;article&#x2F;how-robert-f-kenn...</a><p>[6]: <a href=\"https:&#x2F;&#x2F;www.mcgill.ca&#x2F;oss&#x2F;article&#x2F;covid-19-health-pseudoscience&#x2F;anti-vaccine-propaganda-robert-f-kennedy-jr\" rel=\"nofollow\">https:&#x2F;&#x2F;www.mcgill.ca&#x2F;oss&#x2F;article&#x2F;covid-19-health-pseudoscie...</a>", "time": 1643915637, "type": "comment"}, {"by": "naraga", "id": 30197247, "parent": 30197099, "text": "they are scared of bubble popping yet give away $320m. okay.", "time": 1643915642, "type": "comment"}, {"by": "ss108", "id": 30197248, "parent": 30197136, "text": "Downloading it.<p>But man, I thought it was going to be simple factual questions I might know the answer to, like a more streamlined Quora with better incentives to answer. Your example question in the screenshot on the Play Store is heavy shit. The first question I got was about gay marriage, which isn&#x27;t really a matter of contention at this point anyways.<p>What&#x27;s with this attempt to get peoples&#x27; opinions on &quot;hot-button&quot; issues? What is this for lol, who benefits from these answers? Who is asking these questions?", "time": 1643915643, "type": "comment"}, {"by": "itake", "id": 30197249, "parent": 30182963, "text": "I love this. Thanks for sharing.", "time": 1643915645, "type": "comment"}, {"by": "nomel", "id": 30197250, "kids": [30197282, 30197279], "parent": 30197023, "text": "&gt; A legitimate point is that the battery life isn&#x27;t great.<p>A big difference is that these GPS trackers broadcast their position continuously, wherever there is cell coverage. The AirTags only update their position when an Apple device (made after 2015) is within the relatively short bluetooth range of the tag.", "time": 1643915645, "type": "comment"}, {"by": "SonOfLilit", "id": 30197251, "parent": 30196282, "text": "Few people, when they say &quot;SQL is amazing!&quot;, mean the language.<p>The language is ok minus, it&#x27;s usable and isn&#x27;t a problem center. String parsing isn&#x27;t expensive enough for anyone to replace, and there are many benefits to the 100% language decoupling it ensures.<p>What we mean is &quot;RDBMSs are amazing!&quot;, and they are. Humanity has spent a lot of resources on their design and evolution, making them into systems that efficiently solve your hard problems years before you first find out you have them.", "time": 1643915655, "type": "comment"}, {"by": "ketzo", "id": 30197252, "parent": 30196868, "text": "It&#x27;s a matter of tradeoffs. California electric companies – and PG&amp;E in particular – desperately need to decrease load during fire season so that they have more flexibility in the grid. It&#x27;s important for them to try and disincentivize power usage pretty much however they can.<p>Plus, using less power is better for the environment.", "time": 1643915656, "type": "comment"}, {"by": "abletonlive", "id": 30197253, "parent": 30196745, "text": "That&#x27;s much more rational than buying lottery tickets because you are in desperate need of money.", "time": 1643915656, "type": "comment"}, {"by": "0xCMP", "id": 30197254, "parent": 30193849, "text": "Yep I think this will be my next major project. Taking inspiration from Rust, Go&#x2F;Zig, Nix, Unison, Old SmallTalk and Self videos, Eve, and probably SQLite&#x2F;Postgres.<p>There is a lot of separate innovation that could be combined; so I think.<p>While inspired from these various things I doubt it would just be &quot;another smalltalk&quot; or &quot;just a nocode thing&quot; which many modern versions of this end up looking like.", "time": 1643915657, "type": "comment"}, {"by": "samstave", "descendants": 0, "id": 30197255, "score": 1, "text": "So what did I do or NOT do to help the dystopian BS currently attacking our world:<p>I fucking helped spy on you (I can take a screenshot of anything you are watching, as an example)<p>One amongst many ex.<p>So what bullshit did you create that, if you have a conscious, you will admit to?", "time": 1643915658, "title": "Ask HN: An Amti Resume;", "type": "story"}, {"by": "bhedgeoser", "id": 30197256, "parent": 30196506, "text": "I wonder why linux is still not stable. It appears to work pretty good, to the point that it&#x27;s now the official app toolkit for ubuntu.", "time": 1643915659, "type": "comment"}, {"by": "loceng", "id": 30197257, "parent": 30197128, "text": "Good point - or it&#x27;s a double-whammy economic warfare + reserves for weapons manufacturing; ideally it&#x27;s also them shooting themselves in the foot and some ally country is seeing the business opportunity, and security threat, and will ramp up production.<p>In smart, organized nations, they&#x27;ll hopefully realize this and simply go into debt - ideally at the same rate as other allies who ideally share the burden, so no one is &quot;getting behind&quot; more than the other ally.", "time": 1643915673, "type": "comment"}, {"by": "TuringNYC", "id": 30197258, "parent": 30196866, "text": "Can you name some alternatives with a decent network?<p>If the item has its own mobile network, i&#x27;m expecting an extra $20&#x2F;mo for a phone plan (at which point, comparing to a fixed cost of an AirTag isnt valid.)<p>If it doesnt have a mobile network and relies on the mesh, then, is there any mesh available? Apple&#x27;s mesh is global and pervasive.<p>And if it provides neither mobile support nor mesh, it isnt useful for anything except lost keys in a house.", "time": 1643915679, "type": "comment"}, {"by": "errcorrectcode", "id": 30197259, "parent": 30195690, "text": "OLAP isn&#x27;t a technology and it didn&#x27;t go away. That&#x27;s an approach your and many other orgs have been using for decades to do data warehousing. NoSQLs definitely didn&#x27;t go away.<p>The need for denormalized data and data warehousing will never go away.", "time": 1643915685, "type": "comment"}, {"by": "pinot", "id": 30197260, "parent": 30197145, "text": "Yeah but at least when I loan my bicycle to my friend it won’t beep constantly.", "time": 1643915686, "type": "comment"}, {"by": "duxup", "id": 30197261, "parent": 30196750, "text": "I haven&#x27;t experienced any of the rouge alerts with them.<p>That&#x27;s very strange, I wonder what is triggering it for you.", "time": 1643915698, "type": "comment"}, {"by": "qbasic_forever", "id": 30197262, "parent": 30196757, "text": "You&#x27;re about 15 years too late to find &#x27;deals&#x27; in Monroe&#x2F;North Bend area.  It&#x27;s seeing huge growth and property values are way up.  There&#x27;s not as much land as you think too since a lot of it butts up against state and national forests.", "time": 1643915699, "type": "comment"}, {"by": "api", "id": 30197263, "parent": 30195214, "text": "There&#x27;s a lot of FUD and misunderstanding here.<p>Phrases like &quot;we are secured with AES&quot; are just marking babble by people who don&#x27;t understand the details.<p>AES is significantly faster in hardware if there is support. The vast majority of non-embedded chips (and some embedded) now have AES support in the CPU core including virtually all x64 and aarch64 chips sold today. AES is slower than ChaCha without hardware support but constant time &quot;bit slicing&quot; implementations exist that are fast enough for most use cases.<p>The broken crypto you cite was due to bad implementations or improper use. AES was not broken. You&#x27;re definitely right that the implementation almost always is what gets attacked, but that&#x27;s as true with ChaCha as it is with AES. Any crypto can be used incorrectly and any software can have bugs.<p>Nothing wrong with ChaCha, but don&#x27;t spread FUD.", "time": 1643915699, "type": "comment"}, {"by": "edublancas", "id": 30197264, "parent": 30197179, "text": "Thanks for your feedback! Do you have any stories to share? I&#x27;d love to hear about your experience with the notebooks-production gap", "time": 1643915699, "type": "comment"}, {"by": "benreesman", "id": 30197265, "parent": 30192180, "text": "I think my original post started out by saying there are legitimate reasons to be concerned about social media.<p>I mean, I quit with a lot of unvested stock because it wasn’t obvious to me that I was making people net happier by my work, which is a way that I want to feel about my work.<p>But I think that the number of people on this site who organize their careers around pure altruism is small enough that I’ll probably live through those people throwing rocks because I’m arguing that this subject is <i>nuanced</i> and <i>complicated</i>.<p>I think I said that Boz and I have disagreed plenty over the years. But if he’s going to get burned at the stake in a public forum because he’s had to make very, very difficult decisions and didn’t always make the right ones, we’ll tie me to the same post because I’ve badly fucked up on much simpler decisions.", "time": 1643915710, "type": "comment"}, {"by": "omgitsabird", "id": 30197266, "parent": 30197232, "text": "With the right attitude, you can rip from streams and play it for free from Winamp. You can also buy a lot of music as an MP3.", "time": 1643915711, "type": "comment"}, {"by": "X6S1x6Okd1st", "id": 30197267, "parent": 30197099, "text": "Were the 2008 bank bailouts done because it was the morally right thing to do or because they felt like it was important to secure the value of the economy.<p>It seemed like there was a lot of awfully well resourced individuals that were scared of slipping into a depression", "time": 1643915713, "type": "comment"}, {"by": "cool_dude85", "id": 30197268, "parent": 30196108, "text": "Even demand charges often do a bad job of matching utility costs. If I run a church and my peak demand is consistently reached at 11 AM on Sunday morning, guess what, I&#x27;m way overpaying relative to my cost to the utility.<p>The problem with high meter charges (or charging based on panel amperage&#x2F;etc.) is that it doesn&#x27;t do a good job matching utility costs either. Let&#x27;s say I have a 2-story house and split it into a duplex. I add a second panel on the top floor and live on the bottom. Did my second panel double costs for the utility? Absolutely not. If I build a carriage house in my backyard with a 200 amp panel, does it cost the same to the utility as if I put a 200 amp panel on my new house in my far-off exurb? Absolutely not.<p>That&#x27;s not to get into the distributional effects of these kinds of changes. Any kind of base-rate increase will absolutely hammer the poor in order to save lots for suburb mcmansions. This may be economically more efficient, but good luck selling it.", "time": 1643915719, "type": "comment"}, {"by": "rjakobsson", "id": 30197269, "parent": 30196699, "text": "I’m sorry, but you are vey misinformed regarding the transaction cost of Bitcoin.", "time": 1643915735, "type": "comment"}, {"by": "bpierre", "descendants": 0, "id": 30197270, "score": 1, "time": 1643915748, "title": "The type hierarchy tree in TypeScript", "type": "story", "url": "https://www.zhenghao.io/posts/type-hierarchy-tree"}, {"by": "kick_in_the_dor", "id": 30197271, "parent": 30194306, "text": "Very interesting! Any idea why this only works for a decade? Or has it only been a therapy for that long?", "time": 1643915748, "type": "comment"}, {"by": "scarface74", "id": 30197272, "parent": 30196852, "text": "Guess what? I as a consumer don’t want to enter my credit card all over the place or have to jump through hoops when I want to cancel  a subscription. I want to be able to use “Hide My Email” so when you have a data breach or sell my email  I can cancel it.  I don’t want to use your lowest common denominator web app. I want to just use an app I pay for and I don’t need to have a “relationship “ with you.", "time": 1643915749, "type": "comment"}, {"by": "BiteCode_dev", "id": 30197273, "parent": 30197037, "text": "The first time I read &quot;99 francs&quot;, I remember arriving on the double page that was nothing but a list of tag lines from tv ads. No context. No brands. Just 2 full pages of things that I&#x27;ve heard in between shows.<p>I could hear the jingle in my head. I knew each of the names of the brand after reading the tag lines.<p>For every. Single. One. Of. Them.<p>I always though I was not susceptible to this. Ads are only influencing others, but not me.<p>But no.<p>There are ways for people to burn themself through the screen into your brain. And video games mechanics is no exception.", "time": 1643915768, "type": "comment"}, {"by": "ilamont", "descendants": 0, "id": 30197274, "score": 1, "time": 1643915769, "title": "‘Mob’ accusations add fuel to the online battle between Fast and Bolt", "type": "story", "url": "https://www.modernretail.co/startups/mob-accusations-add-fuel-to-the-online-battle-between-one-click-payments-startups-fast-and-bolt/"}, {"by": "jdminhbg", "id": 30197275, "parent": 30197218, "text": "Every iPhone (and Android and dumbphone) was coopted into a global surveillance network from the very beginning.", "time": 1643915771, "type": "comment"}, {"by": "ryukafalz", "id": 30197276, "parent": 30196689, "text": "&gt; I&#x27;m not sure why there&#x27;s a push to eliminate gas cooking in favor of electricity. Perhaps some people are concerned with methane leaks in the natural gas distribution system.<p>It&#x27;s that, as well as the fact that having a gas stove means you have a gas hookup in the first place, so you&#x27;re more likely to also use it for heating. That in turn leads to more emissions than other heating methods produce.", "time": 1643915772, "type": "comment"}, {"by": "nightski", "id": 30197277, "parent": 30196902, "text": "That is rather reductionist.  Users care about lots of things including the hardware itself, the camera, battery life, etc...", "time": 1643915780, "type": "comment"}, {"by": "dandelany", "id": 30197278, "parent": 30196745, "text": "How else would you explain why people play the lottery? It&#x27;s well-known that the expected value of any given ticket is negative (except in rare cases), unless you place some entertainment&#x2F;fantasy value on playing.", "time": 1643915781, "type": "comment"}, {"deleted": true, "id": 30197279, "parent": 30197250, "time": 1643915782, "type": "comment"}, {"by": "X6S1x6Okd1st", "id": 30197280, "parent": 30197133, "text": "To be fair the situation he was talking about was that bridges are vulnerable to reorgs&#x2F;51% attacks on either side and if that happens the bridged asset might lose it&#x27;s peg, while the local&#x2F;native asset won&#x27;t.", "time": 1643915783, "type": "comment"}, {"by": "Jochim", "id": 30197281, "parent": 30196627, "text": "I bought a copy in late 2016. At the time CIG were running their &quot;Answer the Call&quot; campaign. At the previous year&#x27;s citizen con they&#x27;d announced Squadron 42 would be coming out in 2016. When I bought in I figured even if they don&#x27;t make the 2016 release window how long a wait could it possibly be, given they&#x27;d committed to 2016? Well, it&#x27;s been 6 years and the email updates indicate that they&#x27;re still working on extremely rudimentary features. They&#x27;re nowhere near wrapping up something that was apparently a year away from release 6 years ago.<p>CIG later announced they&#x27;d be creating what is effectively a Battlefield clone called Theatres of War. Originally shown off at citizen con 2019, It&#x27;s now been 2 years later and even that doesn&#x27;t sound like it&#x27;s coming any time soon.<p>CIG go beyond just giving bad estimates, they&#x27;re persistently found to be outright lying about the state of the game and at the rate of progress they&#x27;re making we&#x27;ll probably be dead if it ever releases.<p>SC might not be an intentional scam, but if it isn&#x27;t then the people running it are so incompetent that it might as well be.", "time": 1643915784, "type": "comment"}, {"by": "TuringNYC", "id": 30197282, "parent": 30197250, "text": "&gt;&gt; The AirTags only update their position when an Apple device (made after 2015) is within the relatively short bluetooth range of the tag, with an internet connection.<p>Luckily the &quot;only&quot; is pretty good. There are Apple devices almost everywhere i&#x27;d need to track a lost bike&#x2F;car&#x2F;schoolbag.", "time": 1643915798, "type": "comment"}, {"by": "edublancas", "id": 30197283, "parent": 30197089, "text": "Great question! Yes, we allow users to open .py files as notebooks in Jupyter, so you can get the best of both worlds: interactivity with Jupyter and nice code reviews. jupytext does the heavy lifting for us (it&#x27;s a great package!) and we add some extra things to improve the experience<p>More on the docs: <a href=\"https:&#x2F;&#x2F;docs.ploomber.io&#x2F;en&#x2F;latest&#x2F;user-guide&#x2F;jupyter.html\" rel=\"nofollow\">https:&#x2F;&#x2F;docs.ploomber.io&#x2F;en&#x2F;latest&#x2F;user-guide&#x2F;jupyter.html</a>", "time": 1643915799, "type": "comment"}, {"by": "stefan_", "id": 30197284, "parent": 30196866, "text": "Yeah but they need, you know, <i>GPS</i>. Which is an incredibly faint signal that is hopelessly attenuated by just about any indoors space.", "time": 1643915800, "type": "comment"}, {"by": "fortran77", "id": 30197285, "parent": 30193953, "text": "NSO has changed owners several times. They’re now owned by a UK firm called Novalpina Capital.", "time": 1643915801, "type": "comment"}, {"by": "bpierre", "descendants": 0, "id": 30197286, "score": 1, "time": 1643915802, "title": "Systemd by example – Part 1: Minimization", "type": "story", "url": "https://seb.jambor.dev/posts/systemd-by-example-part-1-minimization/"}, {"by": "the_arun", "descendants": 0, "id": 30197287, "score": 1, "time": 1643915803, "title": "Teen tracking Musk's private jet now monitoring Bill Gates, Jeff Bezos and Drake", "type": "story", "url": "https://inews.co.uk/news/elon-musk-teen-tracking-billionaires-private-jet-now-monitoring-bill-gates-jeff-bezos-drake-1438871"}, {"by": "marto1", "id": 30197288, "parent": 30193236, "text": "&gt; To prove the André-Oort conjecture, Pila needed to show that a non-Shimura variety living inside a Shimura variety doesn’t have a lot of special points.<p>This looks just so advanced to me. Is that how people sound when they talk about programming ?", "time": 1643915807, "type": "comment"}, {"by": "sidewndr46", "id": 30197289, "parent": 30196685, "text": "Well given that I worked on military comms for over a year I&#x27;d say I&#x27;m pretty knowlegeable.<p>Let&#x27;s see, this system predates even my birth:\n <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Fleet_Satellite_Communications_System\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Fleet_Satellite_Communications...</a><p>It&#x27;s still in use as recently as 2009, by pirates however. Newer systems include some form of conditional access to prevent anyone with the gear from using them.", "time": 1643915809, "type": "comment"}, {"by": "errantmind", "id": 30197290, "parent": 30195413, "text": "I&#x27;d argue the opposite, everyone does it to some degree or another on every topic. Some have the patience and curiosity to develop a more nuanced understanding of a topic and refuse to generalize in discussion, which has the effect of excluding those with a less nuanced understanding of the topic; others generalize faster, possibly for rhetorical purposes and to align with people lacking a more nuanced understanding of the topic.", "time": 1643915814, "type": "comment"}, {"by": "lapetitejort", "id": 30197291, "parent": 30197178, "text": "You have a &quot;gaming addiction&quot; as much as some people have a &quot;network television&quot; addiction. Some people just like to experience a medium for several hours a day. Playing four hours of LoL is just as meaningless as watching four hours of TV. One is more stigmatized than the other (I&#x27;ll give you a hint, the one where ads can be delivered on a regular schedule is the more acceptable one). And I&#x27;m willing to bet that if there&#x27;s something you need to do that night, you could sacrifice one or two days to get things done and not feel any ill effects (and if I may rib on it a bit, probably feel much better having stepped away from LoL).", "time": 1643915819, "type": "comment"}, {"by": "jrochkind1", "id": 30197292, "parent": 30193203, "text": "Interesting, because I realize I would not personally want that done with models, in my apps models&#x2F;controllers frequently don&#x27;t have a 1-1 relationship.<p>But controllers and view templates almost always do, because of the nature of the architecture.<p>So actually just using the `view_component` gem for all my views from now on (not just partials) probably satisfies me!", "time": 1643915822, "type": "comment"}, {"by": "feross", "descendants": 0, "id": 30197293, "score": 1, "time": 1643915824, "title": "Visual Studio Code January 2022", "type": "story", "url": "https://code.visualstudio.com/updates/v1_64"}, {"by": "agd", "id": 30197294, "parent": 30196343, "text": "Another question to ask - who lost most of the ETH in the first place? Could some of this be VCs paying themselves back and shoring up their investment in Solana at the same time?", "time": 1643915825, "type": "comment"}, {"by": "danielvf", "id": 30197295, "parent": 30196343, "text": "Wormhole is now owned by the crypto arm of a large traditional financial trading company, Jump Capital. Here&#x27;s a tweet from the CEO of Jump Crypto saying that they put up the funds:<p>&quot;Jump put up 120k of it’s own ETH because we believe in Wormhole and want to support it in this stage of its development.&quot;<p><a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;KariyaKanav&#x2F;status&#x2F;1489312871456649228\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;KariyaKanav&#x2F;status&#x2F;1489312871456649228</a><p>I think Jump Crypto also also heavily trading across the bridge, which means that some portion of the lost funds were their own funds.", "time": 1643915829, "type": "comment"}, {"by": "shagie", "id": 30197296, "parent": 30193245, "text": "<a href=\"https:&#x2F;&#x2F;broadbandnow.com&#x2F;national-broadband-map\" rel=\"nofollow\">https:&#x2F;&#x2F;broadbandnow.com&#x2F;national-broadband-map</a> is informative.<p>Select max speed and then go zoom in somewhere rural and see &quot;1Mbps to 25Mbps&quot; and then switch over to min price or provider counts...<p>There aren&#x27;t a lot of options in rural areas and running wire to the spot is expensive.", "time": 1643915830, "type": "comment"}, {"by": "rjakobsson", "id": 30197297, "parent": 30196989, "text": "This is a false comparison.", "time": 1643915830, "type": "comment"}]