[{"by": "JohnBooty", "id": 30184504, "parent": 30182176, "text": "What a poor attempt at reductio ad absurdum. If you put half the effort into <i>understanding</i> this as you&#x27;re currently spending on <i>fighting very hard to not understand</i> it, you&#x27;d have more free time in your day and learn something to boot.<p>There are quite a few native americans who find it wack when people, especially those belonging to the culture that took their land and more or less genocided them, co-opt their cultural symbols.<p>There are also a lot of native americans who don&#x27;t care, probably some who think it&#x27;s neato and a lot of native americans for whom the entire issue gets a big old &quot;not applicable&quot; because it&#x27;s a big continent and &quot;native american&quot; is not a monolithic culture and not all of them give a shit about dream catchers.<p>Ultimately, it&#x27;s up to you. You can decide to give a shit about the N% of native americans who feel it&#x27;s wack for white people to make dream catchers, or you can decide they&#x27;re a bunch of whiny crybabies who aren&#x27;t qualified to make decisions about their own culture, and open a big ol&#x27; dream catcher factory within spitting distance of your nearest reservation. A lot of people will think you&#x27;re a dick, and probably a lot of people will think you&#x27;re a totally cool dude who just owned the libs.", "time": 1643838397, "type": "comment"}, {"by": "malepoon", "id": 30184505, "parent": 30184185, "text": "To be honest I only notice that with movies. Books are fine, TV show episodes are usually fine, but long movies I can have a hard time concentrating on. Maybe because I can easily change my reading speed to keep my mind occupied.", "time": 1643838407, "type": "comment"}, {"by": "jjav", "id": 30184506, "parent": 30179429, "text": "&gt; Should this be legal?<p>It should not be legal, to do testing on public streets with unwilling participants.<p>Tesla should be required to be able to enable this only in closed areas where access is limited to those participating in the testing.", "time": 1643838407, "type": "comment"}, {"by": "Jtsummers", "id": 30184507, "parent": 30184307, "text": "I&#x27;m not sure if that&#x27;s supposed to be a counterargument or not. I mean, MIT taught SICP for over 20 years with Scheme before dropping it. So it may be true that a majority of MIT trained programmers learned a Lisp in college. But that&#x27;s not the typical experience across universities, and I doubt it ever was the case that the majority of universities taught the majority of their CS students with a mandatory Lisp course (that is, a course beyond the survey-style course I mentioned before, which seems to be <i>far</i> more common course).<p>Even top universities didn&#x27;t require it. Georgia Tech, one of the top technical universities in the US, did something like a 2-year stint with a mandatory SICP course before dropping it in favor of Python (IIRC), and had no mandatory Lisp course besides that (though they did have a mandatory Smalltalk course at the time).", "time": 1643838414, "type": "comment"}, {"by": "jacquesm", "id": 30184508, "parent": 30184384, "text": "Very large textured voxels!", "time": 1643838417, "type": "comment"}, {"deleted": true, "id": 30184509, "parent": 30183732, "time": 1643838427, "type": "comment"}, {"by": "rrrodia", "id": 30184510, "parent": 30162767, "text": "Despite the &#x27;growth&#x27; of the web and its related professions, I feel like a lot of it has neither good UX or interesting design. I&#x27;ve been out of front end for years now, but don&#x27;t feel inspired to put it mildly.. my plan is to separate these interest:<p>* build interesting graphical web styles &#x2F; experiments, pushing the envelope<p>* build a living UX guide founded in research (like an up to date wiki);", "time": 1643838427, "type": "comment"}, {"by": "sandworm101", "id": 30184511, "parent": 30184422, "text": "Have you been to LA, SF, Vancouver or Denver?  These are Teslas, not Ferraris.  Lots of teenagers are driving their parent&#x27;s tesla.  Go look at any university parking lot and you will find plenty of 50,000$ cars.", "time": 1643838427, "type": "comment"}, {"by": "iNic", "descendants": 0, "id": 30184512, "score": 2, "time": 1643838429, "title": "Code Smell: Concrete Abstraction", "type": "story", "url": "https://matklad.github.io//2020/08/15/concrete-abstraction.html"}, {"by": "ricardobeat", "id": 30184513, "parent": 30178570, "text": "600% from where it sat before the craze, which was the market price for a failing company. The company has seen revenue decline by 40%, lost roughly half a billion dollars in both 2019 and 2020, their EBITDA is negative, cash flow is negative, their margins are negative and falling. Their only plan to turnaround the ship so far seems to be entering the NFT market...<p>&gt; subjectively high chance of having a real stock squeeze<p>Ha, that explains a lot. The only way to believe the stock will go up, is the fairy-tale short squeeze. The current valuation is extremely generous based on reality.", "time": 1643838430, "type": "comment"}, {"by": "detaro", "id": 30184514, "parent": 30184500, "text": "because FAANG is originally a stock market term for (at the time) hot tech stocks, and Microsoft was already old and boring.", "time": 1643838446, "type": "comment"}, {"by": "solarmist", "id": 30184515, "parent": 30182617, "text": "Really?<p>Maybe that&#x27;s true in general because the spread in skill for being able to make a living as a lawyer and the same as a programmer depends far less on that attention to detail being a core skill. Still, I wonder if that also holds at the high levels of the profession. I get the impression that at the FAANG-level, lawyers would compare pretty favorably to programmers in detail orientation. In particular, patent and contract law.<p>That said, it&#x27;s just my general impression of what lawyers get up to.<p>...Hmm, thinking about the contract law thing a bit more. Yeah, I do believe you are right. Lawyers aren&#x27;t writing nearly as many extremely detail-oriented texts as programmers are on a day-to-day basis. Their jobs are much more around finding, reading, and understanding those things and building stories around them.", "time": 1643838460, "type": "comment"}, {"by": "nathias", "id": 30184516, "parent": 30184217, "text": "Yea, I was thinking more in terms of what would be good for society, regardless of current implementation. It would really help fight corruption if each state&#x2F;business interaction can be tracked along with all supply chains.", "time": 1643838460, "type": "comment"}, {"by": "bm-rf", "id": 30184517, "parent": 30180674, "text": "You could use Microsoft&#x27;s DeepSpeed to run the model for inference on multiple GPUS, see <a href=\"https:&#x2F;&#x2F;www.deepspeed.ai&#x2F;tutorials&#x2F;inference-tutorial&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.deepspeed.ai&#x2F;tutorials&#x2F;inference-tutorial&#x2F;</a>", "time": 1643838465, "type": "comment"}, {"by": "standardUser", "id": 30184518, "parent": 30184206, "text": "Fans should also check out the Brave New World mod for the game (excellent changes to combat and gameplay, plus tons of minor tweaks and improvements) and the T edition (massive Japanese expansion that was recently release in English).", "time": 1643838469, "type": "comment"}, {"by": "withinboredom", "id": 30184519, "parent": 30171501, "text": "Tinfoil hat: the number of US GPS satellites in operation has been going down, both in % of total satellites and in actual numbers over the years. I’d venture “US being able to rely on GPS” is probably not a great thing.<p>That being said, wanting more user data is probably the right answer.", "time": 1643838471, "type": "comment"}, {"by": "chrisofspades", "descendants": 0, "id": 30184520, "score": 2, "time": 1643838473, "title": "NPM enrolls Top package maintainers into mandatory 2FA", "type": "story", "url": "https://therecord.media/npm-enrolls-top-100-package-maintainers-into-mandatory-2fa/"}, {"by": "awinter-py", "id": 30184521, "parent": 30181291, "text": "settings are also a great resolution to behind-the-scenes design conversations<p>in particular the classic &#x27;PM wants to incentivize a flow, developer thinks it will be annoying as shit and threatens to throw phone out the window&#x27;<p>&#x27;let&#x27;s make this a setting to see if people turn it off&#x27; is my favorite compromise for these. (Also simplifies phase two of a gradual rollout, because jealous early adopters can turn the beta setting on manually)", "time": 1643838478, "type": "comment"}, {"by": "rootsudo", "id": 30184522, "parent": 30184149, "text": "The more longer you pretend, the more rights she has to your future income and alimony.<p>But What&#x27;s the problem? You don&#x27;t want kids, and she said she isn&#x27;t sure.<p>The more longer you stay together and let her complete her studies, her biological clock ticks and women do have issues having kids later in life.<p>You just don&#x27;t like being married? Not being together?<p>More for reddit, but, just curious in general.", "time": 1643838482, "type": "comment"}, {"by": "sne11ius", "descendants": 0, "id": 30184523, "score": 1, "text": "Hi HN.\nI did a small thing. If you&#x27;re bound to use host code on bitbucket (and&#x2F;or use Jenkins), you&#x27;re probably just a corporate dev like me ;)<p>I hope this tool can make your life a little easier. I use it mainly to clone repositories I only vaguely know the name of.<p>Any comments welcome.", "time": 1643838492, "title": "Show HN: Furbnicator, a tool to ease burdens for the common corporate programmer", "type": "story", "url": "https://github.com/sne11ius/furbnicator"}, {"deleted": true, "id": 30184524, "parent": 30184394, "time": 1643838495, "type": "comment"}, {"by": "bmhin", "id": 30184525, "parent": 30184385, "text": "Yeah, we need our TicketFixer to also include the No_Bob 0.2 plugin that figures out that a decent percentage of the time whatever &quot;Bob&quot; is asking for in that meeting is not what &quot;Bob&quot; thinks he is asking for or should be asking for and can squash those tickets.  Without that we&#x27;re gonna somehow end up with spreadsheets in everything.", "time": 1643838498, "type": "comment"}, {"by": "burnished", "id": 30184526, "parent": 30183895, "text": "This isn&#x27;t turning the problem around in the same sense. In order to effectively turn a problem around you need to use its complement, and then it should be a binary proposition. Your example where you suppose an idealogical attack fails here because it is not the only other explanation, you haven&#x27;t turned the problem around in the same way that turning &quot;what is the probability this action had an effect&quot; around can become &quot;what is the probability that this action had no effect&quot;.", "time": 1643838507, "type": "comment"}, {"by": "roelschroeven", "id": 30184527, "parent": 30180596, "text": "Jordan, not UAE. Both Lawrence of Arabia and Dune 2021 were (largely) shot in the Wadi Rum in Jordan (and likewise desert scenes in many other movies).", "time": 1643838516, "type": "comment"}, {"by": "Someone1234", "id": 30184528, "parent": 30184149, "text": "&gt; Main problem is that she still depends on me financially. Am I a bad person if I keep pretending for a couple of years until she finishes her studies, gets a good job and then break up? (she is also a software dev, she is already working but earns a pretty low salary)<p>Those aren&#x27;t the only two options. You could both agree to support her financially AND move on.<p>I would suggest you should be having these conversations with her, even if just to give her a heads up that you&#x27;re feeling this way so when you decide to make a change it isn&#x27;t completely out of the blue.<p>&gt; One strategy I used was to tell her that I don&#x27;t want to have kids, and I told her it was ok if she left me.<p>This isn&#x27;t a &quot;strategy.&quot; This is just not dealing with the problem and trying to push her into doing it for you.<p>You two need counseling, even if only as a nicer way to let her know you&#x27;re one foot out the door already. If you want to support her after your married dissolves then try to do arbitration and offer that.", "time": 1643838516, "type": "comment"}, {"by": "ketzo", "id": 30184529, "parent": 30184032, "text": "Wow. Excellent analogy.", "time": 1643838523, "type": "comment"}, {"by": "Zababa", "id": 30184530, "parent": 30181349, "text": "If some people are confused (I was for a long time):<p>- OCaml is a functional, object-oriented and statically typed programming language that compiles to binaries and bytecode. It&#x27;s a ML (Meta Language) descendant, like SML for example<p>- js_of_ocaml is a compiler that takes in OCaml bytecode and outputs JavaScript<p>- BuckleScript is a compiler that takes OCaml code and outputs JavaScript<p>- ReasonML is an alternative syntax for OCaml. ReasonML code can be compiled to binaries like regular OCaml code.<p>- BuckleScript and ReasonML were used together often<p>- ReScript is a new language that&#x27;s based on the OCaml compiler, BuckleScript, and ReasonML syntax. ReScript targets only JavaScript and has a<p>A post on the history of ReScript&#x2F;BuckleScript in the OCaml forum: <a href=\"https:&#x2F;&#x2F;discuss.ocaml.org&#x2F;t&#x2F;a-short-history-of-rescript-bucklescript&#x2F;7222\" rel=\"nofollow\">https:&#x2F;&#x2F;discuss.ocaml.org&#x2F;t&#x2F;a-short-history-of-rescript-buck...</a>", "time": 1643838524, "type": "comment"}, {"by": "spiffytech", "id": 30184531, "parent": 30183932, "text": "A better option would be using the HTML meta tag to perform the redirect, since HN has a bunch of JS-avoidant users:<p><pre><code>  &lt;meta http-equiv=&quot;refresh&quot; content=&quot;0;url=https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=30180253&quot; &#x2F;&gt;</code></pre>", "time": 1643838527, "type": "comment"}, {"by": "donsupreme", "id": 30184532, "parent": 30184454, "text": "Wormhole mainly focused on bridging in&#x2F;out of Solana.  Solana isn&#x27;t having a good year to say the least.", "time": 1643838528, "type": "comment"}, {"by": "overgard", "id": 30184533, "parent": 30183113, "text": "I&#x27;m not sure that&#x27;s true. I usually am far more frustrated when something in an OS isn&#x27;t customizable. One reason I prefer Linux and Windows over macOS is because macOS tends to be much more rigid in what I can customize.", "time": 1643838528, "type": "comment"}, {"by": "YeGoblynQueenne", "id": 30184534, "parent": 30183925, "text": "Program synthesis from natural language specifications has existed for many\nyears, also. I&#x27;m not particularly interested in the task, but here&#x27;s a paper I\nfound from 2017, with a quick search:<p><a href=\"https:&#x2F;&#x2F;www.semanticscholar.org&#x2F;paper&#x2F;Program-Synthesis-from-Natural-Language-Using-Lin&#x2F;8ec6abfdc5009b4e490e975991c871dfeec05434\" rel=\"nofollow\">https:&#x2F;&#x2F;www.semanticscholar.org&#x2F;paper&#x2F;Program-Synthesis-from...</a><p>AlphaCode is not particularly good at it, either. In the arxiv preprint, besides\nthe subjetive and pretty meaningless &quot;evaluation&quot; against human coders it&#x27;s also\ntested on a formal prorgam synthesis benchmark, the APPS dataset. The best\nperforming variant reported in the arxiv preprint solves 25% of the\n&quot;introductory&quot; tasks (the least challenging ones). All AlphaCode variants tested\nsolve less than 10% on the &quot;interview&quot; and &quot;competition&quot; (intermediary and\nadvanced) tasks. These more objective results are not reported in the article\nabove, I think for obvious reasons (because they are extremely poor).<p>So it&#x27;s not doing anything radically new and it&#x27;s not doing it particularlly\nwell either. Please be better informed before propagating hype.", "time": 1643838541, "type": "comment"}, {"by": "Scarblac", "id": 30184535, "parent": 30181932, "text": "In the Netherlands, in my case. Party lists, yes. Most European countries have that as far as I know, I thought the UK was an outlier.", "time": 1643838542, "type": "comment"}, {"by": "aantix", "id": 30184536, "parent": 30183686, "text": "Interesting take..<p>What do you think is the solution - when an enterprise already has Jira, Github and Confluence, how do you think a product like Grafana Incident should integrate with these somewhat overlapping products?", "time": 1643838546, "type": "comment"}, {"by": "facundo_olano", "id": 30184537, "parent": 30184330, "text": "Thanks for the suggestion, and for your book and your blog posts, by the way, they are the main reason we thought about tackling this project!", "time": 1643838548, "type": "comment"}, {"by": "DavideNL", "id": 30184538, "parent": 30183236, "text": "I once read (somewhere...) that the position of text on the page is also an important factor; when scrolling the position of &quot;the location on the page where you read something&quot; changes constantly, versus paper where the info always stays in the same location.\nApparently, this helps our brain to remember things, better.<p>So, if you read on an electronic device, it&#x27;s probably beneficial to configure it to not use &quot;continuous scrolling&quot; but rather use something &quot;fixed&quot;.", "time": 1643838550, "type": "comment"}, {"by": "jahewson", "id": 30184539, "parent": 30183675, "text": "More style than substance but the blazon disregard for IP is clear:<p><a href=\"https:&#x2F;&#x2F;www.agriland.ie&#x2F;farming-news&#x2F;fancy-a-chinese-interpretation-of-a-john-deere&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.agriland.ie&#x2F;farming-news&#x2F;fancy-a-chinese-interpr...</a>", "time": 1643838550, "type": "comment"}, {"by": "sanedigital", "id": 30184540, "parent": 30178142, "text": "[Citation needed] on the part where you said being smart makes you less likely to believe in bullshit. I know plenty of smart people who aren’t independent thinkers at all.", "time": 1643838553, "type": "comment"}, {"by": "capableweb", "id": 30184541, "parent": 30183958, "text": "In my person experience, the &quot;drunk drivers&quot;, &quot;road ragers&quot;, &quot;habitual speeders&quot; groups seems to be over-represented in expensive cars rather than cheaper cars. Poor people cannot afford to crash their car while rich people can.", "time": 1643838555, "type": "comment"}, {"by": "henryw", "id": 30184542, "parent": 30182146, "text": "Can this be made into bulletproof clothing that looks like normal clothes? That would be cool", "time": 1643838559, "type": "comment"}, {"by": "donsupreme", "id": 30184543, "parent": 30184498, "text": "Dare I say  ... money?", "time": 1643838566, "type": "comment"}, {"deleted": true, "id": 30184544, "parent": 30178594, "time": 1643838566, "type": "comment"}, {"by": "mrtksn", "id": 30184545, "parent": 30184453, "text": "How it&#x27;s other car companies fault that Tesla isn&#x27;t publishing data so we can check if Autopilot miles are mostly on straight lines and human miles are at tricky situations?", "time": 1643838567, "type": "comment"}, {"by": "dmitriid", "id": 30184546, "parent": 30184361, "text": "&gt; Autopilot is a tool. You can miss use it, sure. But if you care about safety it&#x27;s hard to match with what they offer.<p>1. It&#x27;s not autopilot, by any measurable criteria<p>2. As the adjusted data clearl shows, it&#x27;s not that hard to match it. And since you mention Volvo, they definitely match it. They are honest enough though not to call it &quot;autopilot&quot;, or &quot;full safe driving&quot; or pin the plame for its failures on the driver.", "time": 1643838569, "type": "comment"}, {"by": "riantogo", "id": 30184547, "parent": 30182181, "text": "How much of an impact would you say it has on the index? If it were normalized for “citizens only” do you really think US will fare much better?<p>If your larger point is about treatment of immigrants, how do you feel about US taxing its immigrants as citizens after 1 yr of stay, but putting them on a line to actual citizenship that could be more than multiple lifetimes long? Didn’t we fight a war about “taxation without representation”? I’m not even talking about literally tearing apart poor immigrant families while all along extracting taxes from them.", "time": 1643838584, "type": "comment"}, {"by": "petermcneeley", "id": 30184548, "parent": 30182146, "text": "Joules per Kg or gtfo.", "time": 1643838599, "type": "comment"}, {"by": "nerdjon", "id": 30184549, "parent": 30183693, "text": "I think at the time I set it up that feature may not exist?<p>It isn&#x27;t really anything sensitive, really more just when I am interviewing and related activities.<p>But I also want it to be a separate email instead of just an alias which I assume iClouds is. Could be wrong though.<p>Amazon&#x27;s is just $5 a month so not really a huge drive to change it.", "time": 1643838605, "type": "comment"}, {"by": "samueljbrewer", "dead": true, "id": 30184550, "score": 1, "time": 1643838608, "type": "story"}, {"by": "frickinLasers", "id": 30184551, "parent": 30183959, "text": "Ugh. As a not-really-power user I can&#x27;t stand Gnome 3, not least because I have to Google how to and then install a tool just to make useful settings accessible. Everything in Tweaks should be in the default settings panel.", "time": 1643838616, "type": "comment"}, {"by": "solarmist", "id": 30184552, "parent": 30181663, "text": "There isn&#x27;t? I feel like there&#x27;s still a ton of places software hasn&#x27;t even touched and not because it doesn&#x27;t make sense, but because no one&#x27;s gotten to it. It&#x27;s not the most profitable thing people could write software for.", "time": 1643838618, "type": "comment"}, {"by": "Ericson2314", "id": 30184553, "parent": 30178814, "text": "If the compiler is so omnicient, then you should just be able to take the pointer to the field in the unsafe struct too!<p>Surely such a genius compiler can see &quot;oh, they took a field reference, better make sure that field is aligned&quot; whether the reference is a safe one or not!", "time": 1643838620, "type": "comment"}, {"by": "statico", "id": 30184554, "parent": 30184456, "text": "As of right now, I have almost zero information about who is using it. It&#x27;s currently running on Vercel as a hobby project, and I&#x27;ve already used my single free analytics add-on for another project.<p>(Will I run out of free Vercel function execution credits or whatever? Probably. We&#x27;ll see, I guess.)", "time": 1643838622, "type": "comment"}, {"by": "tagoregrtst", "id": 30184555, "parent": 30180839, "text": "I hate title.<p>Do they mean run of the mill plastic?<p>What does stronger than steel mean? Tensile strength? Yield strength? Toughness?<p>And “stronger” than steel is not that impressive in of itself. Many materials are stringer than steel. Steel’s combination of properties makes it useful, not merely its tensile strength.", "time": 1643838622, "type": "comment"}, {"by": "megous", "id": 30184556, "parent": 30137504, "text": "Well, if you set max-width: something for example. You need to set other dimension as auto in CSS. So that would be height: auto.", "time": 1643838627, "type": "comment"}, {"by": "pjmlp", "id": 30184557, "parent": 30184062, "text": "It fits on having a <i>var : type</i> syntax, naturally it isn&#x27;t Turbo Pascal 6.0 with the Turbo Vision IDE, given 1992.", "time": 1643838630, "type": "comment"}, {"by": "FireBeyond", "id": 30184558, "parent": 30183058, "text": "Huh. Citation needed that drivers who buy, say, a Model S, particularly one with Ludicrous mode are less likely to be &quot;habitual speeders&quot; than the average driver.<p>This has come up before. When the new FSD beta started, people started claiming that safe driving was a function of vehicle price, and therefore Tesla drivers, especially those who had paid for FSD, were more likely to be safer. When I noted that my current vehicle costs more than a Model S, based on the logic, Tesla should be recruiting me to beta test FSD, well it was hard to find a refutation.", "time": 1643838635, "type": "comment"}, {"by": "tshaddox", "id": 30184559, "parent": 30181418, "text": "This is cherry-picking. There are countless characters from comic books who are so powerful that they would be considered laughable in modern superhero movies the same way you seem to think a few cherry-picked modern superhero movie characters are laughably overpowered compared to a few cherry-picked characters from older superhero movies.", "time": 1643838644, "type": "comment"}]